iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define GPIOF_2_0 (*(volatile struct GPIOF_2_0_tag *) 0x40011c00)

struct GPIOG_0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE0:2;
      uint64_t CNF0:2;
      uint64_t MODE1:2;
      uint64_t CNF1:2;
      uint64_t MODE2:2;
      uint64_t CNF2:2;
      uint64_t MODE3:2;
      uint64_t CNF3:2;
      uint64_t MODE4:2;
      uint64_t CNF4:2;
      uint64_t MODE5:2;
      uint64_t CNF5:2;
      uint64_t MODE6:2;
      uint64_t CNF6:2;
      uint64_t MODE7:2;
      uint64_t CNF7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE8:2;
      uint64_t CNF8:2;
      uint64_t MODE9:2;
      uint64_t CNF9:2;
      uint64_t MODE10:2;
      uint64_t CNF10:2;
      uint64_t MODE11:2;
      uint64_t CNF11:2;
      uint64_t MODE12:2;
      uint64_t CNF12:2;
      uint64_t MODE13:2;
      uint64_t CNF13:2;
      uint64_t MODE14:2;
      uint64_t CNF14:2;
      uint64_t MODE15:2;
      uint64_t CNF15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDR0:1;
      uint64_t IDR1:1;
      uint64_t IDR2:1;
      uint64_t IDR3:1;
      uint64_t IDR4:1;
      uint64_t IDR5:1;
      uint64_t IDR6:1;
      uint64_t IDR7:1;
      uint64_t IDR8:1;
      uint64_t IDR9:1;
      uint64_t IDR10:1;
      uint64_t IDR11:1;
      uint64_t IDR12:1;
      uint64_t IDR13:1;
      uint64_t IDR14:1;
      uint64_t IDR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ODR0:1;
      uint64_t ODR1:1;
      uint64_t ODR2:1;
      uint64_t ODR3:1;
      uint64_t ODR4:1;
      uint64_t ODR5:1;
      uint64_t ODR6:1;
      uint64_t ODR7:1;
      uint64_t ODR8:1;
      uint64_t ODR9:1;
      uint64_t ODR10:1;
      uint64_t ODR11:1;
      uint64_t ODR12:1;
      uint64_t ODR13:1;
      uint64_t ODR14:1;
      uint64_t ODR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ODR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BS0:1;
      uint64_t BS1:1;
      uint64_t BS2:1;
      uint64_t BS3:1;
      uint64_t BS4:1;
      uint64_t BS5:1;
      uint64_t BS6:1;
      uint64_t BS7:1;
      uint64_t BS8:1;
      uint64_t BS9:1;
      uint64_t BS10:1;
      uint64_t BS11:1;
      uint64_t BS12:1;
      uint64_t BS13:1;
      uint64_t BS14:1;
      uint64_t BS15:1;
      uint64_t BR0:1;
      uint64_t BR1:1;
      uint64_t BR2:1;
      uint64_t BR3:1;
      uint64_t BR4:1;
      uint64_t BR5:1;
      uint64_t BR6:1;
      uint64_t BR7:1;
      uint64_t BR8:1;
      uint64_t BR9:1;
      uint64_t BR10:1;
      uint64_t BR11:1;
      uint64_t BR12:1;
      uint64_t BR13:1;
      uint64_t BR14:1;
      uint64_t BR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BSRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR0:1;
      uint64_t BR1:1;
      uint64_t BR2:1;
      uint64_t BR3:1;
      uint64_t BR4:1;
      uint64_t BR5:1;
      uint64_t BR6:1;
      uint64_t BR7:1;
      uint64_t BR8:1;
      uint64_t BR9:1;
      uint64_t BR10:1;
      uint64_t BR11:1;
      uint64_t BR12:1;
      uint64_t BR13:1;
      uint64_t BR14:1;
      uint64_t BR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCK0:1;
      uint64_t LCK1:1;
      uint64_t LCK2:1;
      uint64_t LCK3:1;
      uint64_t LCK4:1;
      uint64_t LCK5:1;
      uint64_t LCK6:1;
      uint64_t LCK7:1;
      uint64_t LCK8:1;
      uint64_t LCK9:1;
      uint64_t LCK10:1;
      uint64_t LCK11:1;
      uint64_t LCK12:1;
      uint64_t LCK13:1;
      uint64_t LCK14:1;
      uint64_t LCK15:1;
      uint64_t LCKK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCKR;

};

#define GPIOG_0_0 (*(volatile struct GPIOG_0_0_tag *) 0x40012000)

struct AFIO_0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN:4;
      uint64_t PORT:3;
      uint64_t EVOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI1_REMAP:1;
      uint64_t I2C1_REMAP:1;
      uint64_t USART1_REMAP:1;
      uint64_t USART2_REMAP:1;
      uint64_t USART3_REMAP:2;
      uint64_t TIM1_REMAP:2;
      uint64_t TIM2_REMAP:2;
      uint64_t TIM3_REMAP:2;
      uint64_t TIM4_REMAP:1;
      uint64_t CAN_REMAP:2;
      uint64_t PD01_REMAP:1;
      uint64_t TIM5CH4_IREMAP:1;
      uint64_t ADC1_ETRGINJ_REMAP:1;
      uint64_t ADC1_ETRGREG_REMAP:1;
      uint64_t ADC2_ETRGINJ_REMAP:1;
      uint64_t ADC2_ETRGREG_REMAP:1;
      uint64_t reservedSpace0:3;
      uint64_t SWJ_CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI0:4;
      uint64_t EXTI1:4;
      uint64_t EXTI2:4;
      uint64_t EXTI3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI4:4;
      uint64_t EXTI5:4;
      uint64_t EXTI6:4;
      uint64_t EXTI7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI8:4;
      uint64_t EXTI9:4;
      uint64_t EXTI10:4;
      uint64_t EXTI11:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI12:4;
      uint64_t EXTI13:4;
      uint64_t EXTI14:4;
      uint64_t EXTI15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTICR4;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t TIM9_REMAP:1;
      uint64_t TIM10_REMAP:1;
      uint64_t TIM11_REMAP:1;
      uint64_t TIM13_REMAP:1;
      uint64_t TIM14_REMAP:1;
      uint64_t FSMC_NADV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAPR2;

