iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define FLASH_2_0 (*(volatile struct FLASH_2_0_tag *) 0x40023c00)

struct HASH_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INIT:1;
      uint64_t DMAE:1;
      uint64_t DATATYPE:2;
      uint64_t MODE:1;
      uint64_t ALGO:1;
      uint64_t NBW:4;
      uint64_t DINNE:1;
      uint64_t reservedSpace1:3;
      uint64_t LKEY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAIN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBLW:5;
      uint64_t reservedSpace0:3;
      uint64_t DCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DINIE:1;
      uint64_t DCIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DINIS:1;
      uint64_t DCIS:1;
      uint64_t DMAS:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  uint8_t res0[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR8:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR9:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR10:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR12:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR13:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR14:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR15:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR16:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR17:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR18:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR19:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR20:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR21:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR22:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR23:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR24:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR25:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR26:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR27:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR28:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR29:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR30:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR31:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR33:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR34:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR35:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR36:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR37:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR38:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR39:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR40:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR41:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR42:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR43:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR44:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR45:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR46:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR47:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR48:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR49:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR50:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR50;

