iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define HASH_1 (*(volatile struct HASH_1_tag *) 0x50060400)

struct CRYP_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ALGODIR:1;
      uint64_t ALGOMODE:3;
      uint64_t DATATYPE:2;
      uint64_t KEYSIZE:2;
      uint64_t reservedSpace1:4;
      uint64_t FFLUSH:1;
      uint64_t CRYPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEM:1;
      uint64_t IFNF:1;
      uint64_t OFNE:1;
      uint64_t OFFU:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAIN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAOUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIEN:1;
      uint64_t DOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIM:1;
      uint64_t OUTIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INRIS:1;
      uint64_t OUTRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMIS:1;
      uint64_t OUTMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b224:1;
      uint64_t b225:1;
      uint64_t b226:1;
      uint64_t b227:1;
      uint64_t b228:1;
      uint64_t b229:1;
      uint64_t b230:1;
      uint64_t b231:1;
      uint64_t b232:1;
      uint64_t b233:1;
      uint64_t b234:1;
      uint64_t b235:1;
      uint64_t b236:1;
      uint64_t b237:1;
      uint64_t b238:1;
      uint64_t b239:1;
      uint64_t b240:1;
      uint64_t b241:1;
      uint64_t b242:1;
      uint64_t b243:1;
      uint64_t b244:1;
      uint64_t b245:1;
      uint64_t b246:1;
      uint64_t b247:1;
      uint64_t b248:1;
      uint64_t b249:1;
      uint64_t b250:1;
      uint64_t b251:1;
      uint64_t b252:1;
      uint64_t b253:1;
      uint64_t b254:1;
      uint64_t b255:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) K0LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b192:1;
      uint64_t b193:1;
      uint64_t b194:1;
      uint64_t b195:1;
      uint64_t b196:1;
      uint64_t b197:1;
      uint64_t b198:1;
      uint64_t b199:1;
      uint64_t b200:1;
      uint64_t b201:1;
      uint64_t b202:1;
      uint64_t b203:1;
      uint64_t b204:1;
      uint64_t b205:1;
      uint64_t b206:1;
      uint64_t b207:1;
      uint64_t b208:1;
      uint64_t b209:1;
      uint64_t b210:1;
      uint64_t b211:1;
      uint64_t b212:1;
      uint64_t b213:1;
      uint64_t b214:1;
      uint64_t b215:1;
      uint64_t b216:1;
      uint64_t b217:1;
      uint64_t b218:1;
      uint64_t b219:1;
      uint64_t b220:1;
      uint64_t b221:1;
      uint64_t b222:1;
      uint64_t b223:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) K0RR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b160:1;
      uint64_t b161:1;
      uint64_t b162:1;
      uint64_t b163:1;
      uint64_t b164:1;
      uint64_t b165:1;
      uint64_t b166:1;
      uint64_t b167:1;
      uint64_t b168:1;
      uint64_t b169:1;
      uint64_t b170:1;
      uint64_t b171:1;
      uint64_t b172:1;
      uint64_t b173:1;
      uint64_t b174:1;
      uint64_t b175:1;
      uint64_t b176:1;
      uint64_t b177:1;
      uint64_t b178:1;
      uint64_t b179:1;
      uint64_t b180:1;
      uint64_t b181:1;
      uint64_t b182:1;
      uint64_t b183:1;
      uint64_t b184:1;
      uint64_t b185:1;
      uint64_t b186:1;
      uint64_t b187:1;
      uint64_t b188:1;
      uint64_t b189:1;
      uint64_t b190:1;
      uint64_t b191:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) K1LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b128:1;
      uint64_t b129:1;
      uint64_t b130:1;
      uint64_t b131:1;
      uint64_t b132:1;
      uint64_t b133:1;
      uint64_t b134:1;
      uint64_t b135:1;
      uint64_t b136:1;
      uint64_t b137:1;
      uint64_t b138:1;
      uint64_t b139:1;
      uint64_t b140:1;
      uint64_t b141:1;
      uint64_t b142:1;
      uint64_t b143:1;
      uint64_t b144:1;
      uint64_t b145:1;
      uint64_t b146:1;
      uint64_t b147:1;
      uint64_t b148:1;
      uint64_t b149:1;
      uint64_t b150:1;
      uint64_t b151:1;
      uint64_t b152:1;
      uint64_t b153:1;
      uint64_t b154:1;
      uint64_t b155:1;
      uint64_t b156:1;
      uint64_t b157:1;
      uint64_t b158:1;
      uint64_t b159:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) K1RR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b96:1;
      uint64_t b97:1;
      uint64_t b98:1;
      uint64_t b99:1;
      uint64_t b100:1;
      uint64_t b101:1;
      uint64_t b102:1;
      uint64_t b103:1;
      uint64_t b104:1;
      uint64_t b105:1;
      uint64_t b106:1;
      uint64_t b107:1;
      uint64_t b108:1;
      uint64_t b109:1;
      uint64_t b110:1;
      uint64_t b111:1;
      uint64_t b112:1;
      uint64_t b113:1;
      uint64_t b114:1;
      uint64_t b115:1;
      uint64_t b116:1;
      uint64_t b117:1;
      uint64_t b118:1;
      uint64_t b119:1;
      uint64_t b120:1;
      uint64_t b121:1;
      uint64_t b122:1;
      uint64_t b123:1;
      uint64_t b124:1;
      uint64_t b125:1;
      uint64_t b126:1;
      uint64_t b127:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) K2LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b64:1;
      uint64_t b65:1;
      uint64_t b66:1;
      uint64_t b67:1;
      uint64_t b68:1;
      uint64_t b69:1;
      uint64_t b70:1;
      uint64_t b71:1;
      uint64_t b72:1;
      uint64_t b73:1;
      uint64_t b74:1;
      uint64_t b75:1;
      uint64_t b76:1;
      uint64_t b77:1;
      uint64_t b78:1;
      uint64_t b79:1;
      uint64_t b80:1;
      uint64_t b81:1;
      uint64_t b82:1;
      uint64_t b83:1;
      uint64_t b84:1;
      uint64_t b85:1;
      uint64_t b86:1;
      uint64_t b87:1;
      uint64_t b88:1;
      uint64_t b89:1;
      uint64_t b90:1;
      uint64_t b91:1;
      uint64_t b92:1;
      uint64_t b93:1;
      uint64_t b94:1;
      uint64_t b95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) K2RR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b32:1;
      uint64_t b33:1;
      uint64_t b34:1;
      uint64_t b35:1;
      uint64_t b36:1;
      uint64_t b37:1;
      uint64_t b38:1;
      uint64_t b39:1;
      uint64_t b40:1;
      uint64_t b41:1;
      uint64_t b42:1;
      uint64_t b43:1;
      uint64_t b44:1;
      uint64_t b45:1;
      uint64_t b46:1;
      uint64_t b47:1;
      uint64_t b48:1;
      uint64_t b49:1;
      uint64_t b50:1;
      uint64_t b51:1;
      uint64_t b52:1;
      uint64_t b53:1;
      uint64_t b54:1;
      uint64_t b55:1;
      uint64_t b56:1;
      uint64_t b57:1;
      uint64_t b58:1;
      uint64_t b59:1;
      uint64_t b60:1;
      uint64_t b61:1;
      uint64_t b62:1;
      uint64_t b63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) K3LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t b0:1;
      uint64_t b1:1;
      uint64_t b2:1;
      uint64_t b3:1;
      uint64_t b4:1;
      uint64_t b5:1;
      uint64_t b6:1;
      uint64_t b7:1;
      uint64_t b8:1;
      uint64_t b9:1;
      uint64_t b10:1;
      uint64_t b11:1;
      uint64_t b12:1;
      uint64_t b13:1;
      uint64_t b14:1;
      uint64_t b15:1;
      uint64_t b16:1;
      uint64_t b17:1;
      uint64_t b18:1;
      uint64_t b19:1;
      uint64_t b20:1;
      uint64_t b21:1;
      uint64_t b22:1;
      uint64_t b23:1;
      uint64_t b24:1;
      uint64_t b25:1;
      uint64_t b26:1;
      uint64_t b27:1;
      uint64_t b28:1;
      uint64_t b29:1;
      uint64_t b30:1;
      uint64_t b31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) K3RR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IV31:1;
      uint64_t IV30:1;
      uint64_t IV29:1;
      uint64_t IV28:1;
      uint64_t IV27:1;
      uint64_t IV26:1;
      uint64_t IV25:1;
      uint64_t IV24:1;
      uint64_t IV23:1;
      uint64_t IV22:1;
      uint64_t IV21:1;
      uint64_t IV20:1;
      uint64_t IV19:1;
      uint64_t IV18:1;
      uint64_t IV17:1;
      uint64_t IV16:1;
      uint64_t IV15:1;
      uint64_t IV14:1;
      uint64_t IV13:1;
      uint64_t IV12:1;
      uint64_t IV11:1;
      uint64_t IV10:1;
      uint64_t IV9:1;
      uint64_t IV8:1;
      uint64_t IV7:1;
      uint64_t IV6:1;
      uint64_t IV5:1;
      uint64_t IV4:1;
      uint64_t IV3:1;
      uint64_t IV2:1;
      uint64_t IV1:1;
      uint64_t IV0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IV0LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IV63:1;
      uint64_t IV62:1;
      uint64_t IV61:1;
      uint64_t IV60:1;
      uint64_t IV59:1;
      uint64_t IV58:1;
      uint64_t IV57:1;
      uint64_t IV56:1;
      uint64_t IV55:1;
      uint64_t IV54:1;
      uint64_t IV53:1;
      uint64_t IV52:1;
      uint64_t IV51:1;
      uint64_t IV50:1;
      uint64_t IV49:1;
      uint64_t IV48:1;
      uint64_t IV47:1;
      uint64_t IV46:1;
      uint64_t IV45:1;
      uint64_t IV44:1;
      uint64_t IV43:1;
      uint64_t IV42:1;
      uint64_t IV41:1;
      uint64_t IV40:1;
      uint64_t IV39:1;
      uint64_t IV38:1;
      uint64_t IV37:1;
      uint64_t IV36:1;
      uint64_t IV35:1;
      uint64_t IV34:1;
      uint64_t IV33:1;
      uint64_t IV32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IV0RR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IV95:1;
      uint64_t IV94:1;
      uint64_t IV93:1;
      uint64_t IV92:1;
      uint64_t IV91:1;
      uint64_t IV90:1;
      uint64_t IV89:1;
      uint64_t IV88:1;
      uint64_t IV87:1;
      uint64_t IV86:1;
      uint64_t IV85:1;
      uint64_t IV84:1;
      uint64_t IV83:1;
      uint64_t IV82:1;
      uint64_t IV81:1;
      uint64_t IV80:1;
      uint64_t IV79:1;
      uint64_t IV78:1;
      uint64_t IV77:1;
      uint64_t IV76:1;
      uint64_t IV75:1;
      uint64_t IV74:1;
      uint64_t IV73:1;
      uint64_t IV72:1;
      uint64_t IV71:1;
      uint64_t IV70:1;
      uint64_t IV69:1;
      uint64_t IV68:1;
      uint64_t IV67:1;
      uint64_t IV66:1;
      uint64_t IV65:1;
      uint64_t IV64:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IV1LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IV127:1;
      uint64_t IV126:1;
      uint64_t IV125:1;
      uint64_t IV124:1;
      uint64_t IV123:1;
      uint64_t IV122:1;
      uint64_t IV121:1;
      uint64_t IV120:1;
      uint64_t IV119:1;
      uint64_t IV118:1;
      uint64_t IV117:1;
      uint64_t IV116:1;
      uint64_t IV115:1;
      uint64_t IV114:1;
      uint64_t IV113:1;
      uint64_t IV112:1;
      uint64_t IV111:1;
      uint64_t IV110:1;
      uint64_t IV109:1;
      uint64_t IV108:1;
      uint64_t IV107:1;
      uint64_t IV106:1;
      uint64_t IV105:1;
      uint64_t IV104:1;
      uint64_t IV103:1;
      uint64_t IV102:1;
      uint64_t IV101:1;
      uint64_t IV100:1;
      uint64_t IV99:1;
      uint64_t IV98:1;
      uint64_t IV97:1;
      uint64_t IV96:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IV1RR;

