iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define MFT1_0 (*(volatile struct MFT1_0_tag *) 0x40d00000)

struct MFT2_0_tag
{
  uint16_t TNCNT1;
  uint8_t res0[2];

  uint16_t TNCRA;
  uint8_t res1[2];

  uint16_t TNCRB;
  uint8_t res2[2];

  uint16_t TNCNT2;
  uint8_t res3[2];

  uint8_t TNPRSC;
  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TNC1CSEL:3;
      uint64_t TNC2CSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TNCKC;

  uint8_t res5[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TNMDSEL:2;
      uint64_t TNAEDG:1;
      uint64_t TNBEDG:1;
      uint64_t TNAEN:1;
      uint64_t TNBEN:1;
      uint64_t TNAOUT:1;
      uint64_t TNEN:1;
      uint64_t TNPTEN:1;
      uint64_t TNPTSE:1;
      uint64_t TNPTET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TNMCTRL;

  uint8_t res6[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TNAPND:1;
      uint64_t TNBPND:1;
      uint64_t TNCPND:1;
      uint64_t TNDPND:1;
      uint64_t TNAIEN:1;
      uint64_t TNBIEN:1;
      uint64_t TNCIEN:1;
      uint64_t TNDIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TNICTRL;

  uint8_t res7[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TNACLR:1;
      uint64_t TNBCLR:1;
      uint64_t TNCCLR:1;
      uint64_t TNDCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TNICLR;

};

#define MFT2_0 (*(volatile struct MFT2_0_tag *) 0x40e00000)

struct RTC_3_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWSEC:6;
      uint64_t CWMIN:6;
      uint64_t CWHOUR:5;
      uint64_t CWDAYW:3;
      uint64_t CWDAYM:5;
      uint64_t CWMONTH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWSECM:6;
      uint64_t CWMINM:6;
      uint64_t CWHOURM:5;
      uint64_t CWDAYWM:3;
      uint64_t CWDAYMM:5;
      uint64_t CWMONTHM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWDMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWSECL:6;
      uint64_t CWMINL:6;
      uint64_t CWHOURL:5;
      uint64_t CWDAYWL:3;
      uint64_t CWDAYML:5;
      uint64_t CWMONTHL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWDLR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CWYEAR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CWYR;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CWYEARM:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CWYMR;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CWYEARL:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CWYLR;

  uint8_t res2[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKDIV:15;
      uint64_t reservedSpace0:1;
      uint64_t CKDEL:10;
      uint64_t CWEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WIMSC:1;
      uint64_t TIMSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMSC;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WRIS:1;
      uint64_t TRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RIS;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WMIS:1;
      uint64_t TMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MIS;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WIC:1;
      uint64_t TIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ICR;

  uint8_t res6[3];

  uint32_t TDR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t OS:1;
      uint64_t EN:1;
      uint64_t S:1;
      uint64_t reservedSpace0:1;
      uint64_t SP:7;
      uint64_t CLK:1;
      uint64_t BYPASS_GATED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TCR;

  uint8_t res7[2];

  uint32_t TLR1;
  uint32_t TLR2;
  uint32_t TPR1;
  uint32_t TPR2;
  uint32_t TPR3;
  uint32_t TPR4;
  uint32_t TIN;
};

#define RTC_3_0 (*(volatile struct RTC_3_0_tag *) 0x40f00000)

struct BLUE_CTRL_0_tag
{
  uint32_t TIMEOUT;
  uint8_t res0[4];

  uint32_t RADIO_CONFIG;
};

#define BLUE_CTRL_0 (*(volatile struct BLUE_CTRL_0_tag *) 0x48000004)

struct CKGEN_BLE_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t BOR:1;
      uint64_t POR:1;
      uint64_t WKP_IO9:1;
      uint64_t WKP_IO10:1;
      uint64_t WKP_IO11:1;
      uint64_t WKP_IO12:1;
      uint64_t WKP_IO13:1;
      uint64_t WKP_BLUE:1;
      uint64_t reservedSpace1:1;
      uint64_t WKP2_BLUE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) REASON_RST;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SLOW_COUNT:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK32K_COUNT;

  uint8_t res1[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOW_PERIOD:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK32K_PERIOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOW_FREQ:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK32K_FREQ;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLK32K_MEAS_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK32K_IT;

};

#define CKGEN_BLE_0 (*(volatile struct CKGEN_BLE_0_tag *) 0x48100008)

struct DMA_2_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIF0:1;
      uint64_t TCIF0:1;
      uint64_t HTIF0:1;
      uint64_t TEIF0:1;
      uint64_t GIF1:1;
      uint64_t TCIF1:1;
      uint64_t HTIF1:1;
      uint64_t TEIF1:1;
      uint64_t GIF2:1;
      uint64_t TCIF2:1;
      uint64_t HTIF2:1;
      uint64_t TEIF2:1;
      uint64_t GIF3:1;
      uint64_t TCIF3:1;
      uint64_t HTIF3:1;
      uint64_t TEIF3:1;
      uint64_t GIF4:1;
      uint64_t TCIF4:1;
      uint64_t HTIF4:1;
      uint64_t TEIF4:1;
      uint64_t GIF5:1;
      uint64_t TCIF5:1;
      uint64_t HTIF5:1;
      uint64_t TEIF5:1;
      uint64_t GIF6:1;
      uint64_t TCIF6:1;
      uint64_t HTIF6:1;
      uint64_t TEIF6:1;
      uint64_t GIF7:1;
      uint64_t TCIF7:1;
      uint64_t HTIF7:1;
      uint64_t TEIF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CGIF0:1;
      uint64_t CTCIF0:1;
      uint64_t CHTIF0:1;
      uint64_t CTEIF0:1;
      uint64_t CGIF1:1;
      uint64_t CTCIF1:1;
      uint64_t CHTIF1:1;
      uint64_t CTEIF1:1;
      uint64_t CGIF2:1;
      uint64_t CTCIF2:1;
      uint64_t CHTIF2:1;
      uint64_t CTEIF2:1;
      uint64_t CGIF3:1;
      uint64_t CTCIF3:1;
      uint64_t CHTIF3:1;
      uint64_t CTEIF3:1;
      uint64_t CGIF4:1;
      uint64_t CTCIF4:1;
      uint64_t CHTIF4:1;
      uint64_t CTEIF4:1;
      uint64_t CGIF5:1;
      uint64_t CTCIF5:1;
      uint64_t CHTIF5:1;
      uint64_t CTEIF5:1;
      uint64_t CGIF6:1;
      uint64_t CTCIF6:1;
      uint64_t CHTIF6:1;
      uint64_t CTEIF6:1;
      uint64_t CGIF7:1;
      uint64_t CTCIF7:1;
      uint64_t CHTIF7:1;
      uint64_t CTEIF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCR;

