iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t TIM3EN:1;
      uint64_t TIM4EN:1;
      uint64_t TIM5EN:1;
      uint64_t TIM6EN:1;
      uint64_t TIM7EN:1;
      uint64_t TIM12EN:1;
      uint64_t TIM13EN:1;
      uint64_t TIM14EN:1;
      uint64_t reservedSpace0:2;
      uint64_t WWDGEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SPI2EN:1;
      uint64_t SPI3EN:1;
      uint64_t reservedSpace2:1;
      uint64_t USART2EN:1;
      uint64_t USART3EN:1;
      uint64_t UART4EN:1;
      uint64_t UART5EN:1;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t I2C3EN:1;
      uint64_t reservedSpace3:1;
      uint64_t CAN1EN:1;
      uint64_t CAN2EN:1;
      uint64_t reservedSpace4:1;
      uint64_t PWREN:1;
      uint64_t DACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1EN:1;
      uint64_t TIM8EN:1;
      uint64_t reservedSpace0:2;
      uint64_t USART1EN:1;
      uint64_t USART6EN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADC1EN:1;
      uint64_t ADC2EN:1;
      uint64_t ADC3EN:1;
      uint64_t SDIOEN:1;
      uint64_t SPI1EN:1;
      uint64_t reservedSpace2:1;
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace3:1;
      uint64_t TIM9EN:1;
      uint64_t TIM10EN:1;
      uint64_t TIM11EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2ENR;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOALPEN:1;
      uint64_t GPIOBLPEN:1;
      uint64_t GPIOCLPEN:1;
      uint64_t GPIODLPEN:1;
      uint64_t GPIOELPEN:1;
      uint64_t GPIOFLPEN:1;
      uint64_t GPIOGLPEN:1;
      uint64_t GPIOHLPEN:1;
      uint64_t GPIOILPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CRCLPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t FLITFLPEN:1;
      uint64_t SRAM1LPEN:1;
      uint64_t SRAM2LPEN:1;
      uint64_t BKPSRAMLPEN:1;
      uint64_t reservedSpace2:2;
      uint64_t DMA1LPEN:1;
      uint64_t DMA2LPEN:1;
      uint64_t reservedSpace3:2;
      uint64_t ETHMACLPEN:1;
      uint64_t ETHMACTXLPEN:1;
      uint64_t ETHMACRXLPEN:1;
      uint64_t ETHMACPTPLPEN:1;
      uint64_t OTGHSLPEN:1;
      uint64_t OTGHSULPILPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMILPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CRYPLPEN:1;
      uint64_t HASHLPEN:1;
      uint64_t RNGLPEN:1;
      uint64_t OTGFSLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSMCLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3LPENR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2LPEN:1;
      uint64_t TIM3LPEN:1;
      uint64_t TIM4LPEN:1;
      uint64_t TIM5LPEN:1;
      uint64_t TIM6LPEN:1;
      uint64_t TIM7LPEN:1;
      uint64_t TIM12LPEN:1;
      uint64_t TIM13LPEN:1;
      uint64_t TIM14LPEN:1;
      uint64_t reservedSpace0:2;
      uint64_t WWDGLPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SPI2LPEN:1;
      uint64_t SPI3LPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t USART2LPEN:1;
      uint64_t USART3LPEN:1;
      uint64_t UART4LPEN:1;
      uint64_t UART5LPEN:1;
      uint64_t I2C1LPEN:1;
      uint64_t I2C2LPEN:1;
      uint64_t I2C3LPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t CAN1LPEN:1;
      uint64_t CAN2LPEN:1;
      uint64_t reservedSpace4:1;
      uint64_t PWRLPEN:1;
      uint64_t DACLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM1LPEN:1;
      uint64_t TIM8LPEN:1;
      uint64_t reservedSpace0:2;
      uint64_t USART1LPEN:1;
      uint64_t USART6LPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADC1LPEN:1;
      uint64_t ADC2LPEN:1;
      uint64_t ADC3LPEN:1;
      uint64_t SDIOLPEN:1;
      uint64_t SPI1LPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t SYSCFGLPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t TIM9LPEN:1;
      uint64_t TIM10LPEN:1;
      uint64_t TIM11LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2LPENR;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSEON:1;
      uint64_t LSERDY:1;
      uint64_t LSEBYP:1;
      uint64_t reservedSpace0:5;
      uint64_t RTCSEL0:1;
      uint64_t RTCSEL1:1;
      uint64_t reservedSpace1:5;
      uint64_t RTCEN:1;
      uint64_t BDRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSION:1;
      uint64_t LSIRDY:1;
      uint64_t reservedSpace0:22;
      uint64_t RMVF:1;
      uint64_t BORRSTF:1;
      uint64_t PADRSTF:1;
      uint64_t PORRSTF:1;
      uint64_t SFTRSTF:1;
      uint64_t WDGRSTF:1;
      uint64_t WWDGRSTF:1;
      uint64_t LPWRRSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODPER:13;
      uint64_t INCSTEP:15;
      uint64_t reservedSpace0:2;
      uint64_t SPREADSEL:1;
      uint64_t SSCGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSCGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t PLLI2SN0:1;
      uint64_t PLLI2SN1:1;
      uint64_t PLLI2SN2:1;
      uint64_t PLLI2SN3:1;
      uint64_t PLLI2SN4:1;
      uint64_t PLLI2SN5:1;
      uint64_t PLLI2SN6:1;
      uint64_t PLLI2SN7:1;
      uint64_t PLLI2SN8:1;
      uint64_t reservedSpace1:13;
      uint64_t PLLI2SR0:1;
      uint64_t PLLI2SR1:1;
      uint64_t PLLI2SR2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLI2SCFGR;

};

#define RCC_2_1 (*(volatile struct RCC_2_1_tag *) 0x40023800)

