iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define NVIC_2_1 (*(volatile struct NVIC_2_1_tag *) 0xe000e004)

struct GPIO_1_tag
{
  uint32_t DATA;
  uint32_t OEN;
  uint32_t PE;
  uint32_t DS;
  uint32_t IS;
  uint32_t IBE;
  uint32_t IEV;
  uint32_t IE;
  uint8_t res0[4];

  uint32_t MIS;
  uint32_t IC;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO0:3;
      uint64_t reservedSpace0:1;
      uint64_t IO1:3;
      uint64_t reservedSpace1:1;
      uint64_t IO2:3;
      uint64_t reservedSpace2:1;
      uint64_t IO3:3;
      uint64_t reservedSpace3:1;
      uint64_t IO4:3;
      uint64_t reservedSpace4:1;
      uint64_t IO5:3;
      uint64_t reservedSpace5:1;
      uint64_t IO6:3;
      uint64_t reservedSpace6:1;
      uint64_t IO7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO8:3;
      uint64_t reservedSpace0:1;
      uint64_t IO9:3;
      uint64_t reservedSpace1:1;
      uint64_t IO10:3;
      uint64_t reservedSpace2:1;
      uint64_t IO11:3;
      uint64_t reservedSpace3:1;
      uint64_t IO12:3;
      uint64_t reservedSpace4:1;
      uint64_t IO13:3;
      uint64_t reservedSpace5:1;
      uint64_t IO14:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE1;

  uint8_t res1[8];

  uint32_t DATS;
  uint32_t DATC;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFT1_TIMER_A:8;
      uint64_t MFT1_TIMER_B:1;
      uint64_t reservedSpace0:7;
      uint64_t MFT2_TIMER_A:1;
      uint64_t reservedSpace1:7;
      uint64_t MFT2_TIMER_B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MFTX;

};

#define GPIO_1 (*(volatile struct GPIO_1_tag *) 0x40000000)

struct FLASH_2_tag
{
  uint16_t COMMAND;
  uint8_t res0[2];

  uint16_t CONFIG;
  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMDDONE:1;
      uint64_t CMDSTART:1;
      uint64_t CMDERR:1;
      uint64_t ILLCMD:1;
      uint64_t READOK:1;
      uint64_t FLNREADY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRQSTAT;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMDDONE:1;
      uint64_t CMDSTART:1;
      uint64_t CMDERR:1;
      uint64_t ILLCMD:1;
      uint64_t READOK:1;
      uint64_t FLNREADY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRQMASK;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMDDONE:1;
      uint64_t CMDSTART:1;
      uint64_t CMDERR:1;
      uint64_t ILLCMD:1;
      uint64_t READOK:1;
      uint64_t FLNREADY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRQRAW;

  uint8_t res4[2];

  uint16_t SIZE;
  uint8_t res5[2];

  uint32_t ADDRESS;
  uint8_t res6[8];

  uint32_t LFSRVAL;
  uint32_t TIMETRIM1;
  uint32_t TIMETRIM2;
  uint32_t TIMETRIM3;
  uint8_t res7[12];

  uint32_t DATA0;
  uint32_t DATA1;
  uint32_t DATA2;
  uint32_t DATA3;
};

#define FLASH_2 (*(volatile struct FLASH_2_tag *) 0x40100000)

struct SYSTEM_CTRL_1_tag
{
  uint8_t WKP_IO_IS;
  uint8_t res0[3];

  uint8_t WKP_IO_IE;
  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MHZ32_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CTRL;

};

#define SYSTEM_CTRL_1 (*(volatile struct SYSTEM_CTRL_1_tag *) 0x40200000)

struct SPI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSS:5;
      uint64_t reservedSpace0:1;
      uint64_t SPO:1;
      uint64_t SPH:1;
      uint64_t SCR:8;
      uint64_t reservedSpace1:7;
      uint64_t SPIM:2;
      uint64_t INVCLK:1;
      uint64_t CS1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SSE:1;
      uint64_t MS:1;
      uint64_t SOD:1;
      uint64_t RENDN:2;
      uint64_t reservedSpace1:1;
      uint64_t RXIFLSEL:3;
      uint64_t TXIFLSEL:3;
      uint64_t FLOWCTRLEN:1;
      uint64_t MSPIWAIT:4;
      uint64_t TENDN:2;
      uint64_t reservedSpace2:1;
      uint64_t DATAINDEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TFE:1;
      uint64_t TNF:1;
      uint64_t RNE:1;
      uint64_t RFF:1;
      uint64_t BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SR;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CPSDVSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CPSR;

  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RORIM:1;
      uint64_t RTIM:1;
      uint64_t RXIM:1;
      uint64_t TXIM:1;
      uint64_t TURIM:1;
      uint64_t TEIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IMSC;

  uint8_t res2[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RORRIS:1;
      uint64_t RTRIS:1;
      uint64_t RXRIS:1;
      uint64_t TXRIS:1;
      uint64_t TURRIS:1;
      uint64_t TERIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RIS;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RORMIS:1;
      uint64_t RTMIS:1;
      uint64_t RXMIS:1;
      uint64_t TXMIS:1;
      uint64_t TURMIS:1;
      uint64_t TEMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MIS;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RORIC:1;
      uint64_t RTIC:1;
      uint64_t TURIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ICR;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXDMASE:1;
      uint64_t reservedSpace0:1;
      uint64_t TXDMASE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMACR;

  uint8_t res6[3];

  uint16_t RXFRM;
  uint8_t res7[2];

  uint32_t CHN;
  uint16_t WDTXF;
  uint8_t res8[78];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SWAPFIFO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ITCR;

  uint8_t res9[11];

  uint32_t TDR;
};

#define SPI_1 (*(volatile struct SPI_1_tag *) 0x40400000)

struct WDG_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VAL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t RESEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CR;

  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTICLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RIS;

  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MIS;

