iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define I2C2_2 (*(volatile struct I2C2_2_tag *) 0x40a00000)

struct I2C1_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t OM:2;
      uint64_t SAM:1;
      uint64_t SM:2;
      uint64_t SGCM:1;
      uint64_t FTX:1;
      uint64_t FRX:1;
      uint64_t DMA_TX_EN:1;
      uint64_t DMA_RX_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FON:2;
      uint64_t FS_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SA7:7;
      uint64_t ESA10:3;
      uint64_t reservedSpace0:6;
      uint64_t SLSU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OP:1;
      uint64_t A7:7;
      uint64_t EA10:3;
      uint64_t SB:1;
      uint64_t AM:2;
      uint64_t P:1;
      uint64_t LENGTH:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TFR;

  uint8_t res1[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OP:2;
      uint64_t STATUS:2;
      uint64_t CAUSE:3;
      uint64_t TYPE:2;
      uint64_t LENGTH:10;
      uint64_t reservedSpace0:10;
      uint64_t DUALF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RFR;

  uint8_t res2[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t THRESH_TX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TFTR;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t THRESH_RX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFTR;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DBSIZE_TX:3;
      uint64_t BURST_TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMAR;

  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BRCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BRCR;

  uint8_t res6[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFEM:1;
      uint64_t TXFNEM:1;
      uint64_t TXFFM:1;
      uint64_t TXFOVRM:1;
      uint64_t RXFEM:1;
      uint64_t RXFNFM:1;
      uint64_t RXFFM:1;
      uint64_t reservedSpace0:9;
      uint64_t RFSRM:1;
      uint64_t RFSEM:1;
      uint64_t WTSRM:1;
      uint64_t MTDM:1;
      uint64_t STDM:1;
      uint64_t reservedSpace1:3;
      uint64_t MALM:1;
      uint64_t BERRM:1;
      uint64_t reservedSpace2:2;
      uint64_t MTDWSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFE:1;
      uint64_t TXFNE:1;
      uint64_t TXFF:1;
      uint64_t TXFOVR:1;
      uint64_t RXFE:1;
      uint64_t RXFNF:1;
      uint64_t RXFF:1;
      uint64_t reservedSpace0:8;
      uint64_t LBR:1;
      uint64_t RFSR:1;
      uint64_t RFSE:1;
      uint64_t WTSR:1;
      uint64_t MTD:1;
      uint64_t STD:1;
      uint64_t reservedSpace1:2;
      uint64_t SAL:1;
      uint64_t MAL:1;
      uint64_t BERR:1;
      uint64_t reservedSpace2:2;
      uint64_t MTDWS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFEMIS:1;
      uint64_t TXFNEMIS:1;
      uint64_t TXFFMIS:1;
      uint64_t TXFOVRMIS:1;
      uint64_t RXFEMIS:1;
      uint64_t RXFNFMIS:1;
      uint64_t RXFFMIS:1;
      uint64_t reservedSpace0:8;
      uint64_t LBRMIS:1;
      uint64_t RFSRMIS:1;
      uint64_t RFSEMIS:1;
      uint64_t WTSRMIS:1;
      uint64_t MTDMIS:1;
      uint64_t STDMIS:1;
      uint64_t reservedSpace1:2;
      uint64_t SALMIS:1;
      uint64_t MALMIS:1;
      uint64_t BERRMIS:1;
      uint64_t reservedSpace2:2;
      uint64_t MTDWSMIS:1;
      uint64_t reservedSpace3:1;
      uint64_t TIMEOUTMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXFOVRIC:1;
      uint64_t reservedSpace1:11;
      uint64_t LBRIC:1;
      uint64_t RFSRIC:1;
      uint64_t RFSEIC:1;
      uint64_t WTSRIC:1;
      uint64_t MTDIC:1;
      uint64_t STDIC:1;
      uint64_t reservedSpace2:2;
      uint64_t SALIC:1;
      uint64_t MALIC:1;
      uint64_t BERRIC:1;
      uint64_t reservedSpace3:2;
      uint64_t MTDWSIC:1;
      uint64_t reservedSpace4:1;
      uint64_t TIMEOUTIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  uint8_t res7[16];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t THDDAT:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) THDDAT;

  uint8_t res8[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THDSTA_STD:9;
      uint64_t reservedSpace0:7;
      uint64_t THDSTA_FST:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THDSTA_FST_STD;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSUSTA_STD:9;
      uint64_t reservedSpace0:7;
      uint64_t TSUSTA_FST:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSUSTA_FST_STD;

};

#define I2C1_2 (*(volatile struct I2C1_2_tag *) 0x40b00000)

struct AHBUPCONV_1_tag
{
  uint8_t COMMAND;
};

#define AHBUPCONV_1 (*(volatile struct AHBUPCONV_1_tag *) 0x40c00000)

struct MFT1_1_tag
{
  uint16_t TNCNT1;
  uint8_t res0[2];

  uint16_t TNCRA;
  uint8_t res1[2];

  uint16_t TNCRB;
  uint8_t res2[2];

  uint16_t TNCNT2;
  uint8_t res3[2];

  uint8_t TNPRSC;
  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TNC1CSEL:3;
      uint64_t TNC2CSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TNCKC;

  uint8_t res5[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TNMDSEL:2;
      uint64_t TNAEDG:1;
      uint64_t TNBEDG:1;
      uint64_t TNAEN:1;
      uint64_t TNBEN:1;
      uint64_t TNAOUT:1;
      uint64_t TNEN:1;
      uint64_t TNPTEN:1;
      uint64_t TNPTSE:1;
      uint64_t TNPTET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TNMCTRL;

  uint8_t res6[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TNAPND:1;
      uint64_t TNBPND:1;
      uint64_t TNCPND:1;
      uint64_t TNDPND:1;
      uint64_t TNAIEN:1;
      uint64_t TNBIEN:1;
      uint64_t TNCIEN:1;
      uint64_t TNDIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TNICTRL;

  uint8_t res7[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TNACLR:1;
      uint64_t TNBCLR:1;
      uint64_t TNCCLR:1;
      uint64_t TNDCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TNICLR;

