iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define NVIC_3 (*(volatile struct NVIC_3_tag *) 0xe000e100)

struct SIG_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STIR;

};

#define SIG_0 (*(volatile struct SIG_0_tag *) 0xe000ef00)

struct SAU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t ALLNS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SREGION:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_RNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t BADDR:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t NSC:1;
      uint64_t reservedSpace0:3;
      uint64_t LADDR:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAU_RLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVEP:1;
      uint64_t INVIS:1;
      uint64_t INVER:1;
      uint64_t AUVIOL:1;
      uint64_t INVTRAN:1;
      uint64_t LSPERR:1;
      uint64_t SFARVALID:1;
      uint64_t LSERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFAR;

};

#define SAU_0 (*(volatile struct SAU_0_tag *) 0xe000edd0)

struct ADPLL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF_MODE_RX:1;
      uint64_t IF_MODE_TX:1;
      uint64_t reservedSpace0:6;
      uint64_t PWR_MODE_RX:1;
      uint64_t PWR_MODE_TX:1;
      uint64_t OL_RX:1;
      uint64_t OL_TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_ATTR_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CN:7;
      uint64_t reservedSpace0:1;
      uint64_t CS:1;
      uint64_t reservedSpace1:6;
      uint64_t SGN:1;
      uint64_t CH0:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_CN_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFRX_1M:14;
      uint64_t reservedSpace0:2;
      uint64_t FIFRX_2M:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_FIF_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFRX_OFFSET:14;
      uint64_t reservedSpace0:2;
      uint64_t FIFTX:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_FIF_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KDCOHFIC_1M:8;
      uint64_t KDCOHFIC_2M:8;
      uint64_t KDCOLF_IN_1M:8;
      uint64_t KDCOLF_IN_2M:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_KDCO_CAL_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KMOD_ALPHA_1M:5;
      uint64_t reservedSpace0:3;
      uint64_t KMOD_ALPHA_2M:5;
      uint64_t reservedSpace1:3;
      uint64_t KDCOCN_IC:7;
      uint64_t reservedSpace2:1;
      uint64_t TKDCOCAL:3;
      uint64_t KDCOLFCALEN:1;
      uint64_t KDCOCALRX:1;
      uint64_t KDCOCALTX:1;
      uint64_t KDCOESTDEV:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_KDCO_CAL_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KDTC_ALPHA:6;
      uint64_t KTDC_IN:9;
      uint64_t KDTC_PIPELINE_BYPASS:1;
      uint64_t KDTCCN_IC:7;
      uint64_t KDTCIC:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_KDTCTDC_CAL_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KDTCCALEN:1;
      uint64_t KDTCCALMOD:1;
      uint64_t KDTCCALMOD1P:1;
      uint64_t KDTCCAL_INV:1;
      uint64_t KDTCCALLG:3;
      uint64_t reservedSpace0:1;
      uint64_t KTDCCALEN:1;
      uint64_t PHRDLY:2;
      uint64_t TKDTCCAL:4;
      uint64_t PHRDLY_EXTRA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_KDTCTDC_CAL_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KCOARSE:3;
      uint64_t KMEDIUM:3;
      uint64_t AMPCALEN:1;
      uint64_t DCOAMPTM:1;
      uint64_t reservedSpace0:8;
      uint64_t DCOAMPIC_HP_RX:4;
      uint64_t DCOAMPIC_HP_TX:4;
      uint64_t DCOAMPIC_LP_RX:4;
      uint64_t DCOAMPIC_LP_TX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_DCOAMP_CAL_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BT_SEL:1;
      uint64_t TX_DATA_INV:1;
      uint64_t MOD_INDEX:2;
      uint64_t EO_PACKET_DIS:1;
      uint64_t MOD_EXT_SEL:1;
      uint64_t TX_MODE:2;
      uint64_t INV_CKMODEXT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_TXMOD_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDMMODERX:3;
      uint64_t SDMMODETX:3;
      uint64_t reservedSpace0:2;
      uint64_t SDMMODERX_OL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_SDMOD_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FINETAU:5;
      uint64_t FINEK:5;
      uint64_t FINEKZ:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_LF_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODTAU_TUNE:6;
      uint64_t MODK_TUNE:6;
      uint64_t MODTAU:6;
      uint64_t MODK:6;
      uint64_t MODKZ:6;
      uint64_t RST_TAU_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_LF_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDC_DTCIN_EN:1;
      uint64_t TDC_CKVIN_EN:1;
      uint64_t TDC_INV:1;
      uint64_t INV_CKTDC:1;
      uint64_t INV_CKPHV:1;
      uint64_t INV_CKDCOMOD:1;
      uint64_t EN_CKDCOMOD:1;
      uint64_t TGLDETEN:1;
      uint64_t DTCOFFSET:7;
      uint64_t DTC_EN:1;
      uint64_t TDC_OFFSET:6;
      uint64_t reservedSpace0:2;
      uint64_t VPASETTLE:2;
      uint64_t reservedSpace1:1;
      uint64_t DTC_LDO_DMY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_ANA_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FBDIV_EN:1;
      uint64_t RXDIV_FB_EN_RX:1;
      uint64_t RXDIV_FB_EN_TX:1;
      uint64_t reservedSpace0:5;
      uint64_t RXDIV_TRIM:9;
      uint64_t TXDIV_TRIM:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_DIV_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOCOARSEIC:4;
      uint64_t DCOMEDIUMIC:3;
      uint64_t reservedSpace0:1;
      uint64_t DCOFINEIC:6;
      uint64_t reservedSpace1:2;
      uint64_t DCOMODIC:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_INIT_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCOARSE:4;
      uint64_t TMEDIUM:4;
      uint64_t TFINE:4;
      uint64_t TMOD:4;
      uint64_t TPASETTLE:4;
      uint64_t TSETTLE:4;
      uint64_t TVPASETTLE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_FSM_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFREQMEAS:5;
      uint64_t TMREN:1;
      uint64_t ENRFMEAS:1;
      uint64_t RFMEAS_MODE:1;
      uint64_t HOLD_STATE:4;
      uint64_t reservedSpace0:4;
      uint64_t QUALMONMOD:2;
      uint64_t QUALMONWND:6;
      uint64_t QUALMONTRHLD:6;
      uint64_t QUALMONFRCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_MON_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLYFCWDT:2;
      uint64_t RESDLY:2;
      uint64_t MODDLY:2;
      uint64_t ENRESIDUE:1;
      uint64_t ENFCWMOD:1;
      uint64_t PHR_FRAC_PRESET_VAL:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_MISC_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDIV_FB_EN_OL_RX:1;
      uint64_t FBDIV_EN_OL_RX:1;
      uint64_t TXDIV_EN_OL_RX:1;
      uint64_t reservedSpace0:5;
      uint64_t TSETTLE_OL:10;
      uint64_t TAVG_OL:9;
      uint64_t NAVG_OL:4;
      uint64_t OL_RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_OL_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVR_ACTIVE_SEL:1;
      uint64_t OVR_ACTIVE_WR:1;
      uint64_t OVR_RXBIT_SEL:1;
      uint64_t OVR_RXBIT_WR:1;
      uint64_t OVR_ENPAIN_SEL:1;
      uint64_t OVR_ENPAIN_WR:1;
      uint64_t OVR_SRESETN_SEL:1;
      uint64_t OVR_SRESETN_WR:1;
      uint64_t OVR_VPAEN_SEL:1;
      uint64_t OVR_VPAEN_WR:1;
      uint64_t OVR_RDYFORDIV_SEL:1;
      uint64_t OVR_RDYFORDIV_WR:1;
      uint64_t OVR_DCOAMPHOLD_SEL:1;
      uint64_t OVR_DCOAMPHOLD_WR:1;
      uint64_t reservedSpace0:2;
      uint64_t OVR_DCOAMP_SEL:1;
      uint64_t OVR_DCOAMP_WR:4;
      uint64_t reservedSpace1:3;
      uint64_t OVR_DTC_OH_SEL:1;
      uint64_t OVR_DTC_OH_WR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_OVERRULE_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVR_DCOCOARSE_SEL:1;
      uint64_t OVR_DCOCOARSE_WR:4;
      uint64_t reservedSpace0:3;
      uint64_t OVR_DCOMEDIUM_SEL:1;
      uint64_t OVR_DCOMEDIUM_WR:3;
      uint64_t reservedSpace1:4;
      uint64_t OVR_DCOFINE_SEL:1;
      uint64_t OVR_DCOFINE_WR:6;
      uint64_t OVR_DCOMOD_SEL:1;
      uint64_t OVR_DCOMOD_WR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_OVERRULE_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVR_RXDIV_EN_SEL:1;
      uint64_t OVR_RXDIV_EN_WR:1;
      uint64_t OVR_TXDIV_EN_SEL:1;
      uint64_t OVR_TXDIV_EN_WR:1;
      uint64_t OVR_FBDIV_EN_SEL:1;
      uint64_t OVR_FBDIV_EN_WR:1;
      uint64_t OVR_RXDIV_FB_EN_SEL:1;
      uint64_t OVR_RXDIV_FB_EN_WR:1;
      uint64_t OVR_OPENLOOP_RDY_SEL:1;
      uint64_t OVR_OPENLOOP_RDY_WR:1;
      uint64_t OVR_OPENLOOP_RDY_INT_SEL:1;
      uint64_t OVR_OPENLOOP_RDY_INT_WR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_OVERRULE_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFPT_MUX:4;
      uint64_t INV_CKRFPT:1;
      uint64_t RFPT_RATE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_RFPT_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ANATSTEN:16;
      uint64_t ANATSTSPARE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_ANATST_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLIP_MOD_TUNE_0_RX:13;
      uint64_t reservedSpace0:3;
      uint64_t CLIP_MOD_TUNE_0_TX:13;
      uint64_t reservedSpace1:2;
      uint64_t EN_CMF_AVG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_ACC_CTRL_REG;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQDIFF:23;
      uint64_t PHVSA1:1;
      uint64_t PHVSA0:1;
      uint64_t TDCBUB:1;
      uint64_t QUALMONDET:1;
      uint64_t reservedSpace0:2;
      uint64_t MEASDONE_OUT:1;
      uint64_t DCOAMPDET_ASYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_FREQMEAS_RD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOCOARSE:4;
      uint64_t DCOMEDIUM:3;
      uint64_t DCOFINE:6;
      uint64_t DCOMOD:13;
      uint64_t DCOAMP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_DCO_RD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KDCO_HF_INT:8;
      uint64_t KDCO_HF_OUT:8;
      uint64_t KDCOCN:7;
      uint64_t CAL_KDCOCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_KDCO_RD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KDTC_OUT:9;
      uint64_t KDTCCN:7;
      uint64_t KDTC_ALPHA_COMP:9;
      uint64_t CAL_KDTCCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_KDTC_RD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUNE_STATE:4;
      uint64_t TMRVAL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_TUNESTATE_RD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLFCWDT:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_PLLFCWDT_RD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ANATSTSPARE_IN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPLL_ANATST_RD_REG;

