iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define ADPLL_0 (*(volatile struct ADPLL_0_tag *) 0x40022000)

struct AES_HASH_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_ALG:2;
      uint64_t CRYPTO_ALG_MD:2;
      uint64_t CRYPTO_OUT_MD:1;
      uint64_t CRYPTO_AES_KEY_SZ:2;
      uint64_t CRYPTO_ENCDEC:1;
      uint64_t CRYPTO_IRQ_EN:1;
      uint64_t CRYPTO_HASH_SEL:1;
      uint64_t CRYPTO_HASH_OUT_LEN:6;
      uint64_t CRYPTO_MORE_IN:1;
      uint64_t CRYPTO_AES_KEXP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_FETCH_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_FETCH_ADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_LEN:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_DEST_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_DEST_ADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_INACTIVE:1;
      uint64_t CRYPTO_WAIT_FOR_IN:1;
      uint64_t CRYPTO_IRQ_ST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_CLRIRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_CLRIRQ_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_MREG0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_MREG0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_MREG1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_MREG1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_MREG2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_MREG2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_MREG3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_MREG3_REG;

  uint8_t res0[212];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_KEY_X:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_KEYS_START;

};

#define AES_HASH_0 (*(volatile struct AES_HASH_0_tag *) 0x30040000)

struct ANAMISC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_STRUCTURE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_TEST_REG;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CLK_SEL:3;
      uint64_t REF_CAL_START:1;
      uint64_t EXT_CNT_EN_SEL:1;
      uint64_t CAL_CLK_SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_REF_SEL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT_VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_REF_CNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL_CNT_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_REF_VAL_REG;

};

#define ANAMISC_0 (*(volatile struct ANAMISC_0_tag *) 0x50030b00)

struct APU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_EN:1;
      uint64_t SRC_IN_AMODE:1;
      uint64_t SRC_IN_CAL_BYPASS:1;
      uint64_t SRC_PDM_IN_INV:1;
      uint64_t SRC_IN_DS:2;
      uint64_t SRC_IN_OK:1;
      uint64_t SRC_DITHER_DISABLE:1;
      uint64_t SRC_IN_DSD_MODE:1;
      uint64_t SRC_OUT_DSD_MODE:1;
      uint64_t SRC_FIFO_ENABLE:1;
      uint64_t SRC_FIFO_DIRECTION:1;
      uint64_t SRC_PDM_OUT_INV:1;
      uint64_t SRC_OUT_AMODE:1;
      uint64_t SRC_OUT_CAL_BYPASS:1;
      uint64_t reservedSpace0:1;
      uint64_t SRC_OUT_US:2;
      uint64_t SRC_OUT_OK:1;
      uint64_t SRC_RESYNC:1;
      uint64_t SRC_IN_OVFLOW:1;
      uint64_t SRC_IN_UNFLOW:1;
      uint64_t SRC_OUT_OVFLOW:1;
      uint64_t SRC_OUT_UNFLOW:1;
      uint64_t SRC_IN_FLOWCLR:1;
      uint64_t SRC_OUT_FLOWCLR:1;
      uint64_t SRC_PDM_DI_DEL:2;
      uint64_t SRC_PDM_MODE:2;
      uint64_t SRC_PDM_DO_DEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_IN_FS:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_IN_FS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_OUT_FS:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_OUT_FS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_IN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_IN1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_IN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_IN2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_OUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_OUT1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_OUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_OUT2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC1_MUX_IN:3;
      uint64_t PCM1_MUX_IN:3;
      uint64_t PDM1_MUX_IN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APU_MUX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF0:16;
      uint64_t SRC_COEF1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF10_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF2:16;
      uint64_t SRC_COEF3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF32_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF4:16;
      uint64_t SRC_COEF5:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF54_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF6:16;
      uint64_t SRC_COEF7:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF76_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF8:16;
      uint64_t SRC_COEF9:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF98_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF10:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF0A_SET1_REG;

  uint8_t res0[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_EN:1;
      uint64_t PCM_MASTER:1;
      uint64_t PCM_FSCLEN:4;
      uint64_t PCM_FSCDEL:1;
      uint64_t PCM_PPOD:1;
      uint64_t PCM_CLKINV:1;
      uint64_t PCM_FSCINV:1;
      uint64_t PCM_CLK_BIT:1;
      uint64_t PCM_CH_DEL:5;
      uint64_t PCM_FSC_EDGE:1;
      uint64_t reservedSpace0:3;
      uint64_t PCM_FSC_DIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_IN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_IN1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_IN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_IN2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_OUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_OUT1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_OUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_OUT2_REG;

