iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define APU_0 (*(volatile struct APU_0_tag *) 0x50030600)

struct CACHE_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_FLUSH:1;
      uint64_t CACHE_RES1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_LINE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_LNSIZECFG_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_ASSOC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_ASSOCCFG_REG;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_LEN:9;
      uint64_t CACHE_WEN:1;
      uint64_t CACHE_CGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_ASSOCIATIVITY_RESET_VALUE:2;
      uint64_t CACHE_LINE_SIZE_RESET_VALUE:2;
      uint64_t CACHE_RAM_SIZE_RESET_VALUE:3;
      uint64_t CACHE_CONTROLLER_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_HITS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_HITS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_MISSES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_MISSES_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_START:1;
      uint64_t MRM_IRQ_MASK:1;
      uint64_t MRM_IRQ_TINT_STATUS:1;
      uint64_t MRM_IRQ_MISSES_THRES_STATUS:1;
      uint64_t MRM_IRQ_HITS_THRES_STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_TINT:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_TINT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_MISSES_THRES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_MISSES_THRES_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_HITS_THRES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_HITS_THRES_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_REGION_SIZE:3;
      uint64_t reservedSpace0:1;
      uint64_t FLASH_REGION_OFFSET:12;
      uint64_t FLASH_REGION_BASE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_FLASH_REG;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWD_HW_RESET_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWD_RESET_REG;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_CPU_M_HADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_CPU_M_HADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_M_HADDR_MAP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_M_HADDR_MAP0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_CTRLR_M_HADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_CTRLR_M_HADDR_REG;

};

#define CACHE_0 (*(volatile struct CACHE_0_tag *) 0x100c0000)

struct CHARGER_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARGER_ENABLE:1;
      uint64_t CHARGE_START:1;
      uint64_t CHARGER_BYPASS:1;
      uint64_t CHARGER_RESUME:1;
      uint64_t TDIE_PROT_ENABLE:1;
      uint64_t TDIE_ERROR_RESUME:1;
      uint64_t TBAT_PROT_ENABLE:1;
      uint64_t NTC_LOW_DISABLE:1;
      uint64_t reservedSpace0:1;
      uint64_t CHARGE_TIMERS_HALT_ENABLE:1;
      uint64_t TBAT_MONITOR_MODE:2;
      uint64_t JEITA_SUPPORT_DISABLED:1;
      uint64_t CHARGE_LOOP_HOLD:1;
      uint64_t PRE_CHARGE_MODE:1;
      uint64_t REPLENISH_MODE:1;
      uint64_t EOC_INTERVAL_CHECK_THRES:6;
      uint64_t EOC_INTERVAL_CHECK_TIMER:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V_CHARGE_TRIM:4;
      uint64_t I_CHARGE_TRIM:5;
      uint64_t CHARGER_IOTRIM:5;
      uint64_t CHARGER_TEST:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_TEST_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARGER_IS_POWERED_UP:1;
      uint64_t CHARGER_CC_MODE:1;
      uint64_t CHARGER_CV_MODE:1;
      uint64_t END_OF_CHARGE:1;
      uint64_t MAIN_VBAT_COMP_OUT:1;
      uint64_t VBAT_OVP_COMP_OUT:1;
      uint64_t TDIE_COMP_OUT:1;
      uint64_t TBAT_HOT_COMP_OUT:1;
      uint64_t MAIN_TBAT_COMP_OUT:1;
      uint64_t TBAT_STATUS:5;
      uint64_t CHARGER_STATE:4;
      uint64_t CHARGER_JEITA_STATE:3;
      uint64_t TDIE_ERROR_DEBOUNCE_CNT:3;
      uint64_t EOC_EVENTS_DEBOUNCE_CNT:3;
      uint64_t OVP_EVENTS_DEBOUNCE_CNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V_CHARGE:6;
      uint64_t V_PRECHARGE:6;
      uint64_t V_REPLENISH:6;
      uint64_t V_OVP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_VOLTAGE_PARAM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I_CHARGE:6;
      uint64_t I_PRECHARGE:6;
      uint64_t I_END_OF_CHARGE:3;
      uint64_t I_EOC_DOUBLE_RANGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_CURRENT_PARAM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBAT_COLD:6;
      uint64_t TBAT_COOL:6;
      uint64_t TBAT_WARM:6;
      uint64_t TBAT_HOT:6;
      uint64_t TDIE_MAX:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_TEMPSET_PARAM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_PRE_CHARGE_TIME:15;
      uint64_t reservedSpace0:1;
      uint64_t PRE_CHARGE_TIMER:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_PRE_CHARGE_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_CC_CHARGE_TIME:15;
      uint64_t reservedSpace0:1;
      uint64_t CC_CHARGE_TIMER:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_CC_CHARGE_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_CV_CHARGE_TIME:15;
      uint64_t reservedSpace0:1;
      uint64_t CV_CHARGE_TIMER:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_CV_CHARGE_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_TOTAL_CHARGE_TIME:16;
      uint64_t TOTAL_CHARGE_TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_TOTAL_CHARGE_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V_CHARGE_TCOOL:6;
      uint64_t V_CHARGE_TWARM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_JEITA_V_CHARGE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V_PRECHARGE_TCOOL:6;
      uint64_t V_PRECHARGE_TWARM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_JEITA_V_PRECHARGE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V_REPLENISH_TCOOL:6;
      uint64_t V_REPLENISH_TWARM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_JEITA_V_REPLENISH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V_OVP_TCOOL:6;
      uint64_t V_OVP_TWARM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_JEITA_V_OVP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I_CHARGE_TCOOL:6;
      uint64_t I_CHARGE_TWARM:6;
      uint64_t I_PRECHARGE_TCOOL:6;
      uint64_t I_PRECHARGE_TWARM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_JEITA_CURRENT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBAT_COMP_SETTLING:10;
      uint64_t reservedSpace0:6;
      uint64_t VBAT_COMP_TIMER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_VBAT_COMP_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBAT_OVP_COMP_SETTLING:10;
      uint64_t OVP_INTERVAL_CHECK_THRES:6;
      uint64_t VBAT_OVP_COMP_TIMER:10;
      uint64_t OVP_INTERVAL_CHECK_TIMER:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_VOVP_COMP_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDIE_COMP_SETTLING:10;
      uint64_t reservedSpace0:6;
      uint64_t TDIE_COMP_TIMER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_TDIE_COMP_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBAT_MON_INTERVAL:10;
      uint64_t reservedSpace0:6;
      uint64_t TBAT_MON_TIMER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_TBAT_MON_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBAT_COMP_SETTLING:10;
      uint64_t reservedSpace0:6;
      uint64_t TBAT_COMP_TIMER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_TBAT_COMP_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THOT_COMP_SETTLING:10;
      uint64_t reservedSpace0:6;
      uint64_t THOT_COMP_TIMER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_THOT_COMP_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARGER_PWR_UP_SETTLING:10;
      uint64_t reservedSpace0:6;
      uint64_t CHARGER_PWR_UP_TIMER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_PWR_UP_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISABLED_TO_PRECHARGE_IRQ_EN:1;
      uint64_t PRECHARGE_TO_CC_IRQ_EN:1;
      uint64_t CC_TO_CV_IRQ_EN:1;
      uint64_t CC_TO_EOC_IRQ_EN:1;
      uint64_t CV_TO_EOC_IRQ_EN:1;
      uint64_t EOC_TO_PRECHARGE_IRQ_EN:1;
      uint64_t TDIE_PROT_TO_PRECHARGE_IRQ_EN:1;
      uint64_t TBAT_PROT_TO_PRECHARGE_IRQ_EN:1;
      uint64_t TBAT_STATUS_UPDATE_IRQ_EN:1;
      uint64_t CV_TO_CC_IRQ_EN:1;
      uint64_t CC_TO_PRECHARGE_IRQ_EN:1;
      uint64_t CV_TO_PRECHARGE_IRQ_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_STATE_IRQ_MASK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRECHARGE_TIMEOUT_IRQ_EN:1;
      uint64_t CC_CHARGE_TIMEOUT_IRQ_EN:1;
      uint64_t CV_CHARGE_TIMEOUT_IRQ_EN:1;
      uint64_t TOTAL_CHARGE_TIMEOUT_IRQ_EN:1;
      uint64_t VBAT_OVP_ERROR_IRQ_EN:1;
      uint64_t TDIE_ERROR_IRQ_EN:1;
      uint64_t TBAT_ERROR_IRQ_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_ERROR_IRQ_MASK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISABLED_TO_PRECHARGE_IRQ:1;
      uint64_t PRECHARGE_TO_CC_IRQ:1;
      uint64_t CC_TO_CV_IRQ:1;
      uint64_t CC_TO_EOC_IRQ:1;
      uint64_t CV_TO_EOC_IRQ:1;
      uint64_t EOC_TO_PRECHARGE_IRQ:1;
      uint64_t TDIE_PROT_TO_PRECHARGE_IRQ:1;
      uint64_t TBAT_PROT_TO_PRECHARGE_IRQ:1;
      uint64_t TBAT_STATUS_UPDATE_IRQ:1;
      uint64_t CV_TO_CC_IRQ:1;
      uint64_t CC_TO_PRECHARGE_IRQ:1;
      uint64_t CV_TO_PRECHARGE_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_STATE_IRQ_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRECHARGE_TIMEOUT_IRQ:1;
      uint64_t CC_CHARGE_TIMEOUT_IRQ:1;
      uint64_t CV_CHARGE_TIMEOUT_IRQ:1;
      uint64_t TOTAL_CHARGE_TIMEOUT_IRQ:1;
      uint64_t VBAT_OVP_ERROR_IRQ:1;
      uint64_t TDIE_ERROR_IRQ:1;
      uint64_t TBAT_ERROR_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_ERROR_IRQ_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISABLED_TO_PRECHARGE_IRQ_CLR:1;
      uint64_t PRECHARGE_TO_CC_IRQ_CLR:1;
      uint64_t CC_TO_CV_IRQ_CLR:1;
      uint64_t CC_TO_EOC_IRQ_CLR:1;
      uint64_t CV_TO_EOC_IRQ_CLR:1;
      uint64_t EOC_TO_PRECHARGE_IRQ_CLR:1;
      uint64_t TDIE_PROT_TO_PRECHARGE_IRQ_CLR:1;
      uint64_t TBAT_PROT_TO_PRECHARGE_IRQ_CLR:1;
      uint64_t TBAT_STATUS_UPDATE_IRQ_CLR:1;
      uint64_t CV_TO_CC_IRQ_CLR:1;
      uint64_t CC_TO_PRECHARGE_IRQ_CLR:1;
      uint64_t CV_TO_PRECHARGE_IRQ_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_STATE_IRQ_CLR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRECHARGE_TIMEOUT_IRQ_CLR:1;
      uint64_t CC_CHARGE_TIMEOUT_IRQ_CLR:1;
      uint64_t CV_CHARGE_TIMEOUT_IRQ_CLR:1;
      uint64_t TOTAL_CHARGE_TIMEOUT_IRQ_CLR:1;
      uint64_t VBAT_OVP_ERROR_IRQ_CLR:1;
      uint64_t TDIE_ERROR_IRQ_CLR:1;
      uint64_t TBAT_ERROR_IRQ_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHARGER_ERROR_IRQ_CLR_REG;

