iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define DCDC_0 (*(volatile struct DCDC_0_tag *) 0x50000304)

struct DEM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EQUAL_EN:1;
      uint64_t BLE_DDC_EN:1;
      uint64_t IQCORR_EN:1;
      uint64_t CIC_EN:1;
      uint64_t AGC_USE_GPIO_IN:1;
      uint64_t IQ_TO_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DEM_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VGA2_GAIN0:2;
      uint64_t VGA1_GAIN0:3;
      uint64_t LNA_GAIN0:3;
      uint64_t VGA2_GAIN1:2;
      uint64_t VGA1_GAIN1:3;
      uint64_t LNA_GAIN1:3;
      uint64_t VGA2_GAIN2:2;
      uint64_t VGA1_GAIN2:3;
      uint64_t LNA_GAIN2:3;
      uint64_t VGA2_GAIN3:2;
      uint64_t VGA1_GAIN3:3;
      uint64_t LNA_GAIN3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_AGC_LUT_0123_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VGA2_GAIN4:2;
      uint64_t VGA1_GAIN4:3;
      uint64_t LNA_GAIN4:3;
      uint64_t VGA2_GAIN5:2;
      uint64_t VGA1_GAIN5:3;
      uint64_t LNA_GAIN5:3;
      uint64_t VGA2_GAIN6:2;
      uint64_t VGA1_GAIN6:3;
      uint64_t LNA_GAIN6:3;
      uint64_t VGA2_GAIN7:2;
      uint64_t VGA1_GAIN7:3;
      uint64_t LNA_GAIN7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_AGC_LUT_4567_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VGA2_GAIN8:2;
      uint64_t VGA1_GAIN8:3;
      uint64_t LNA_GAIN8:3;
      uint64_t VGA2_GAIN9:2;
      uint64_t VGA1_GAIN9:3;
      uint64_t LNA_GAIN9:3;
      uint64_t VGA2_GAIN10:2;
      uint64_t VGA1_GAIN10:3;
      uint64_t LNA_GAIN10:3;
      uint64_t VGA2_GAIN11:2;
      uint64_t VGA1_GAIN11:3;
      uint64_t LNA_GAIN11:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_AGC_LUT_89AB_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VGA2_GAIN12:2;
      uint64_t VGA1_GAIN12:3;
      uint64_t LNA_GAIN12:3;
      uint64_t VGA2_GAIN13:2;
      uint64_t VGA1_GAIN13:3;
      uint64_t LNA_GAIN13:3;
      uint64_t VGA2_GAIN14:2;
      uint64_t VGA1_GAIN14:3;
      uint64_t LNA_GAIN14:3;
      uint64_t VGA2_GAIN15:2;
      uint64_t VGA1_GAIN15:3;
      uint64_t LNA_GAIN15:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_AGC_LUT_CDEF_REG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AGC_TH_LOW:7;
      uint64_t AGC_TH_HIGH:7;
      uint64_t AGC_TH2_HIGH:7;
      uint64_t AGC_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_AGC_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FASTAGC_EN:1;
      uint64_t FASTAGC_STEPS:2;
      uint64_t FASTAGC_WAIT:2;
      uint64_t AGCINC_WAIT:2;
      uint64_t AGCDEC_WAIT:2;
      uint64_t AGC_MAX_SETTING:4;
      uint64_t reservedSpace0:4;
      uint64_t AGCSETTING_SEL:1;
      uint64_t AGCSETTING_WR:4;
      uint64_t EN_FRZ_GAIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_AGC_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFC_MODE:4;
      uint64_t PAD_MODE:2;
      uint64_t APD_MODE:3;
      uint64_t AFC_SYNCF_DIRECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_AFC_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOFFSET_I_WR:9;
      uint64_t DCOFFSET_Q_WR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOFFSET_SEL:1;
      uint64_t DCPARCAL_EN:1;
      uint64_t DCNSTEP:3;
      uint64_t DCFULLNGAIN:3;
      uint64_t DCPARCAL_INIT:2;
      uint64_t DCVGA1SCALE_EN:1;
      uint64_t DCPARNGAIN:3;
      uint64_t DCPAR_MULT_STEPS_EN:1;
      uint64_t DCPAR_DCF_EN:1;
      uint64_t DCOC_RESULT_LNAGAIN0_LUT:2;
      uint64_t DCOC_RESULT_LNAGAIN1_LUT:2;
      uint64_t DCOC_RESULT_LNAGAIN2_LUT:2;
      uint64_t DCOC_RESULT_LNAGAIN345_LUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCBETA_I:8;
      uint64_t DCBETA_Q:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCAGCSETTING_FULL0:4;
      uint64_t DCAGCSETTING_FULL1:4;
      uint64_t DCAGCSETTING_FULL2:4;
      uint64_t DCAGCSETTING_FULL3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_CTRL4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFC_RD:8;
      uint64_t AGCSETTING_RD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_AGC_RESULT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSSI_LATCHED_RD:10;
      uint64_t RSSI_AVG_RD:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_RSSI_RESULT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFC_POLE1:2;
      uint64_t AFC_POLE2:2;
      uint64_t RXDATA_INV:1;
      uint64_t DEM_HSI_POL:1;
      uint64_t MATCH0101_TH:4;
      uint64_t DEM_SET_DEC2N:1;
      uint64_t AGC_SPEED8M_EN:1;
      uint64_t DCOC_SPEED8M_EN:1;
      uint64_t DCPOLE:2;
      uint64_t RSSI_TH:6;
      uint64_t DEM_16M_CLK_SET:1;
      uint64_t RFADC_CLK_PHASE:2;
      uint64_t ADDR_TIMEOUT_X2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DEM_ATTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSSI_COMP0:4;
      uint64_t RSSI_COMP1:4;
      uint64_t RSSI_COMP2:4;
      uint64_t RSSI_COMP3:4;
      uint64_t RSSI_COMP4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_RSSI_COMP_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEM_TESTMODE:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DEM_TESTMODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IQCORR_BETA:8;
      uint64_t IQCORR_ALPHA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DEM_IQCORRECT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_POS_LIMIT:7;
      uint64_t PAD_NEG_LIMIT:7;
      uint64_t PAD_CLEAR_COUNT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_PAD_CNT_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_POS_CNT_RD:8;
      uint64_t PAD_NEG_CNT_RD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_PAD_CNT_RESULT_REG;

