iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOFFSET_I_RD:9;
      uint64_t DCOFFSET_Q_RD:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_RESULT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOFFSET_I_RD:9;
      uint64_t DCOFFSET_Q_RD:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_FULL_RES_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOFFSET_I_RD:9;
      uint64_t DCOFFSET_Q_RD:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_MPAR_RES0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOFFSET_I_RD:9;
      uint64_t DCOFFSET_Q_RD:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_MPAR_RES1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOFFSET_I_RD:9;
      uint64_t DCOFFSET_Q_RD:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_MPAR_RES2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOFFSET_I_RD:9;
      uint64_t DCOFFSET_Q_RD:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_DC_OFFSET_MPAR_RES3_REG;

};

#define DEM_0 (*(volatile struct DEM_0_tag *) 0x40021000)

struct DMA_2_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_A_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA0_A_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_B_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA0_B_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA0_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA0_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
      uint64_t REQ_SENSE:1;
      uint64_t BURST_MODE:2;
      uint64_t BUS_ERROR_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA0_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA0_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA0_IDX_REG;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_A_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_A_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_B_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_B_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
      uint64_t REQ_SENSE:1;
      uint64_t BURST_MODE:2;
      uint64_t BUS_ERROR_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_IDX_REG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA2_A_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_A_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA2_B_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_B_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA2_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA2_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
      uint64_t REQ_SENSE:1;
      uint64_t BURST_MODE:2;
      uint64_t BUS_ERROR_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA2_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_IDX_REG;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA3_A_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA3_A_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA3_B_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA3_B_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA3_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA3_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA3_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA3_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
      uint64_t REQ_SENSE:1;
      uint64_t BURST_MODE:2;
      uint64_t BUS_ERROR_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA3_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA3_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA3_IDX_REG;

