iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA4_A_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA4_A_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA4_B_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA4_B_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA4_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA4_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA4_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA4_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
      uint64_t REQ_SENSE:1;
      uint64_t BURST_MODE:2;
      uint64_t BUS_ERROR_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA4_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA4_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA4_IDX_REG;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA5_A_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA5_A_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA5_B_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA5_B_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA5_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA5_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA5_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA5_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
      uint64_t REQ_SENSE:1;
      uint64_t BURST_MODE:2;
      uint64_t BUS_ERROR_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA5_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA5_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA5_IDX_REG;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA6_A_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA6_A_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA6_B_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA6_B_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA6_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA6_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA6_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA6_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
      uint64_t REQ_SENSE:1;
      uint64_t BURST_MODE:2;
      uint64_t BUS_ERROR_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA6_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA6_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA6_IDX_REG;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA7_A_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA7_A_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA7_B_START:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA7_B_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA7_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA7_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA7_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA7_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
      uint64_t REQ_SENSE:1;
      uint64_t BURST_MODE:2;
      uint64_t BUS_ERROR_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA7_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA7_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA7_IDX_REG;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA01_SEL:4;
      uint64_t DMA23_SEL:4;
      uint64_t DMA45_SEL:4;
      uint64_t DMA67_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_REQ_MUX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_IRQ_CH0:1;
      uint64_t DMA_IRQ_CH1:1;
      uint64_t DMA_IRQ_CH2:1;
      uint64_t DMA_IRQ_CH3:1;
      uint64_t DMA_IRQ_CH4:1;
      uint64_t DMA_IRQ_CH5:1;
      uint64_t DMA_IRQ_CH6:1;
      uint64_t DMA_IRQ_CH7:1;
      uint64_t DMA_BUS_ERR0:1;
      uint64_t DMA_BUS_ERR1:1;
      uint64_t DMA_BUS_ERR2:1;
      uint64_t DMA_BUS_ERR3:1;
      uint64_t DMA_BUS_ERR4:1;
      uint64_t DMA_BUS_ERR5:1;
      uint64_t DMA_BUS_ERR6:1;
      uint64_t DMA_BUS_ERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_INT_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_RST_IRQ_CH0:1;
      uint64_t DMA_RST_IRQ_CH1:1;
      uint64_t DMA_RST_IRQ_CH2:1;
      uint64_t DMA_RST_IRQ_CH3:1;
      uint64_t DMA_RST_IRQ_CH4:1;
      uint64_t DMA_RST_IRQ_CH5:1;
      uint64_t DMA_RST_IRQ_CH6:1;
      uint64_t DMA_RST_IRQ_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CLEAR_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_IRQ_ENABLE0:1;
      uint64_t DMA_IRQ_ENABLE1:1;
      uint64_t DMA_IRQ_ENABLE2:1;
      uint64_t DMA_IRQ_ENABLE3:1;
      uint64_t DMA_IRQ_ENABLE4:1;
      uint64_t DMA_IRQ_ENABLE5:1;
      uint64_t DMA_IRQ_ENABLE6:1;
      uint64_t DMA_IRQ_ENABLE7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_INT_MASK_REG;

