iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define GPIO_2 (*(volatile struct GPIO_2_tag *) 0x50020a00)

struct GPREG_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ_WKUPTIM:1;
      uint64_t FRZ_SWTIM:1;
      uint64_t FRZ_RESERVED:1;
      uint64_t FRZ_SYS_WDOG:1;
      uint64_t FRZ_USB:1;
      uint64_t FRZ_DMA:1;
      uint64_t FRZ_SWTIM2:1;
      uint64_t FRZ_PWMLED:1;
      uint64_t FRZ_SWTIM3:1;
      uint64_t FRZ_SWTIM4:1;
      uint64_t FRZ_CMAC_WDOG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_FREEZE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ_WKUPTIM:1;
      uint64_t FRZ_SWTIM:1;
      uint64_t FRZ_RESERVED:1;
      uint64_t FRZ_SYS_WDOG:1;
      uint64_t FRZ_USB:1;
      uint64_t FRZ_DMA:1;
      uint64_t FRZ_SWTIM2:1;
      uint64_t FRZ_PWMLED:1;
      uint64_t FRZ_SWTIM3:1;
      uint64_t FRZ_SWTIM4:1;
      uint64_t FRZ_CMAC_WDOG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_FREEZE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYS_CPU_FREEZE_EN:1;
      uint64_t CMAC_CPU_FREEZE_EN:1;
      uint64_t HALT_SYS_CMAC_CPU_EN:1;
      uint64_t HALT_CMAC_SYS_CPU_EN:1;
      uint64_t SYS_CPU_IS_HALTED:1;
      uint64_t CMAC_CPU_IS_HALTED:1;
      uint64_t SYS_CPUWAIT:1;
      uint64_t SYS_CPUWAIT_ON_JTAG:1;
      uint64_t CROSS_CPU_HALT_SENSITIVITY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL_PHASE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t CMAC_H2H_BRIDGE_BYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP_CONTROL_REG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBPAD_EN:1;
      uint64_t USBPHY_FORCE_SW1_OFF:1;
      uint64_t USBPHY_FORCE_SW2_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBPAD_REG;

};

#define GPREG_0 (*(volatile struct GPREG_0_tag *) 0x50040300)

struct I2C_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_MASTER_MODE:1;
      uint64_t I2C_SPEED:2;
      uint64_t I2C_10BITADDR_SLAVE:1;
      uint64_t I2C_10BITADDR_MASTER:1;
      uint64_t I2C_RESTART_EN:1;
      uint64_t I2C_SLAVE_DISABLE:1;
      uint64_t I2C_STOP_DET_IFADDRESSED:1;
      uint64_t I2C_TX_EMPTY_CTRL:1;
      uint64_t I2C_RX_FIFO_FULL_HLD_CTRL:1;
      uint64_t I2C_STOP_DET_IF_MASTER_ACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CON_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_TAR:10;
      uint64_t GC_OR_START:1;
      uint64_t SPECIAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_TAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_SAR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_SAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_IC_HS_MAR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_HS_MADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_DAT:8;
      uint64_t I2C_CMD:1;
      uint64_t I2C_STOP:1;
      uint64_t I2C_RESTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_DATA_CMD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_SS_SCL_HCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_SS_SCL_HCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_SS_SCL_LCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_SS_SCL_LCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_FS_SCL_HCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_FS_SCL_HCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_FS_SCL_LCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_FS_SCL_LCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_HS_SCL_HCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_HS_SCL_HCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_HS_SCL_LCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_HS_SCL_LCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R_RX_UNDER:1;
      uint64_t R_RX_OVER:1;
      uint64_t R_RX_FULL:1;
      uint64_t R_TX_OVER:1;
      uint64_t R_TX_EMPTY:1;
      uint64_t R_RD_REQ:1;
      uint64_t R_TX_ABRT:1;
      uint64_t R_RX_DONE:1;
      uint64_t R_ACTIVITY:1;
      uint64_t R_STOP_DET:1;
      uint64_t R_START_DET:1;
      uint64_t R_GEN_CALL:1;
      uint64_t R_RESTART_DET:1;
      uint64_t R_MASTER_ON_HOLD:1;
      uint64_t R_SCL_STUCK_AT_LOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_INTR_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M_RX_UNDER:1;
      uint64_t M_RX_OVER:1;
      uint64_t M_RX_FULL:1;
      uint64_t M_TX_OVER:1;
      uint64_t M_TX_EMPTY:1;
      uint64_t M_RD_REQ:1;
      uint64_t M_TX_ABRT:1;
      uint64_t M_RX_DONE:1;
      uint64_t M_ACTIVITY:1;
      uint64_t M_STOP_DET:1;
      uint64_t M_START_DET:1;
      uint64_t M_GEN_CALL:1;
      uint64_t M_RESTART_DET:1;
      uint64_t M_MASTER_ON_HOLD:1;
      uint64_t M_SCL_STUCK_AT_LOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_INTR_MASK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_UNDER:1;
      uint64_t RX_OVER:1;
      uint64_t RX_FULL:1;
      uint64_t TX_OVER:1;
      uint64_t TX_EMPTY:1;
      uint64_t RD_REQ:1;
      uint64_t TX_ABRT:1;
      uint64_t RX_DONE:1;
      uint64_t ACTIVITY:1;
      uint64_t STOP_DET:1;
      uint64_t START_DET:1;
      uint64_t GEN_CALL:1;
      uint64_t RESTART_DET:1;
      uint64_t MASTER_ON_HOLD:1;
      uint64_t SCL_STUCK_AT_LOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_RAW_INTR_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_RX_TL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_TL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_TX_TL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_INTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_INTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_RX_UNDER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_RX_UNDER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_RX_OVER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_RX_OVER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_TX_OVER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_TX_OVER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_RD_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_RD_REQ_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_TX_ABRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_TX_ABRT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_RX_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_RX_DONE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_ACTIVITY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_ACTIVITY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_ACTIVITY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_STOP_DET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_START_DET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_START_DET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_GEN_CALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CLR_GEN_CALL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_EN:1;
      uint64_t I2C_ABORT:1;
      uint64_t I2C_TX_CMD_BLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_ENABLE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ACTIVITY:1;
      uint64_t TFNF:1;
      uint64_t TFE:1;
      uint64_t RFNE:1;
      uint64_t RFF:1;
      uint64_t MST_ACTIVITY:1;
      uint64_t SLV_ACTIVITY:1;
      uint64_t MST_HOLD_TX_FIFO_EMPTY:1;
      uint64_t MST_HOLD_RX_FIFO_FULL:1;
      uint64_t SLV_HOLD_TX_FIFO_EMPTY:1;
      uint64_t LV_HOLD_RX_FIFO_FULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFLR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_TXFLR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFLR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_RXFLR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_SDA_TX_HOLD:16;
      uint64_t I2C_SDA_RX_HOLD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_SDA_HOLD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ABRT_7B_ADDR_NOACK:1;
      uint64_t ABRT_10ADDR1_NOACK:1;
      uint64_t ABRT_10ADDR2_NOACK:1;
      uint64_t ABRT_TXDATA_NOACK:1;
      uint64_t ABRT_GCALL_NOACK:1;
      uint64_t ABRT_GCALL_READ:1;
      uint64_t ABRT_HS_ACKDET:1;
      uint64_t ABRT_SBYTE_ACKDET:1;
      uint64_t ABRT_HS_NORSTRT:1;
      uint64_t ABRT_SBYTE_NORSTRT:1;
      uint64_t ABRT_10B_RD_NORSTRT:1;
      uint64_t ABRT_MASTER_DIS:1;
      uint64_t ARB_LOST:1;
      uint64_t ABRT_SLVFLUSH_TXFIFO:1;
      uint64_t ABRT_SLV_ARBLOST:1;
      uint64_t ABRT_SLVRD_INTX:1;
      uint64_t ABRT_USER_ABRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_TX_ABRT_SOURCE_REG;

