iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDMAE:1;
      uint64_t TDMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_DMA_CR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMATDL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_DMA_TDLR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMARDL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_DMA_RDLR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDA_SETUP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_SDA_SETUP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACK_GEN_CALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_ACK_GENERAL_CALL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_EN:1;
      uint64_t SLV_DISABLED_WHILE_BUSY:1;
      uint64_t SLV_RX_DATA_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_ENABLE_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_FS_SPKLEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_IC_FS_SPKLEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_HS_SPKLEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_IC_HS_SPKLEN_REG;

  uint8_t res1[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_COMP_PARAM1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_COMP_PARAM1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_COMP_VERSION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_COMP_VERSION_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC_COMP_TYPE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C2_COMP_TYPE_REG;

};

#define I2C2_3 (*(volatile struct I2C2_3_tag *) 0x50020700)

struct LCDC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_TMODE:1;
      uint64_t LCDC_DSCAN:1;
      uint64_t reservedSpace0:1;
      uint64_t LCDC_FORM_OFF:1;
      uint64_t LCDC_MIPI_OFF:1;
      uint64_t LCDC_OUT_MODE:4;
      uint64_t reservedSpace1:2;
      uint64_t LCDC_PIXCLKOUT_SEL:1;
      uint64_t reservedSpace2:5;
      uint64_t LCDC_SFRAME_UPD:1;
      uint64_t reservedSpace3:1;
      uint64_t LCDC_FORCE_BLANK:1;
      uint64_t reservedSpace4:2;
      uint64_t LCDC_PIXCLKOUT_POL:1;
      uint64_t LCDC_VSYNC_SCPL:1;
      uint64_t reservedSpace5:2;
      uint64_t LCDC_DE_POL:1;
      uint64_t LCDC_HSYNC_POL:1;
      uint64_t LCDC_VSYNC_POL:1;
      uint64_t reservedSpace6:2;
      uint64_t LCDC_MODE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_CLK_DIV:6;
      uint64_t reservedSpace0:2;
      uint64_t LCDC_DMA_HOLD:6;
      uint64_t reservedSpace1:13;
      uint64_t LCDC_SEC_CLK_DIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_CLKCTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_BG_ALPHA:8;
      uint64_t LCDC_BG_BLUE:8;
      uint64_t LCDC_BG_GREEN:8;
      uint64_t LCDC_BG_RED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_BGCOLOR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_RES_Y:16;
      uint64_t LCDC_RES_X:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_RESXY_REG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_FPORCH_Y:16;
      uint64_t LCDC_FPORCH_X:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_FRONTPORCHXY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_BLANKING_Y:16;
      uint64_t LCDC_BLANKING_X:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_BLANKINGXY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_BPORCH_Y:16;
      uint64_t LCDC_BPORCH_X:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_BACKPORCHXY_REG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_DBIB_FMT:5;
      uint64_t reservedSpace0:8;
      uint64_t LCDC_DBIB_JDI_SOFT_RST:1;
      uint64_t LCDC_DBIB_JDI_INV_PIX:1;
      uint64_t LCDC_DBIB_INV_DATA:1;
      uint64_t LCDC_DBIB_SPI_INV_ADDR:1;
      uint64_t LCDC_DBIB_SPI_HOLD:1;
      uint64_t LCDC_DBIB_SPI_JDI:1;
      uint64_t LCDC_DBIB_SPI_CPOL:1;
      uint64_t LCDC_DBIB_SPI_CPHA:1;
      uint64_t reservedSpace1:1;
      uint64_t LCDC_DBIB_SPI4_EN:1;
      uint64_t LCDC_DBIB_SPI3_EN:1;
      uint64_t LCDC_DBIB_DMA_EN:1;
      uint64_t LCDC_DBIB_RESX:1;
      uint64_t reservedSpace2:2;
      uint64_t LCDC_DBIB_SPI_PAD:1;
      uint64_t LCDC_DBIB_CSX_FORCE_VAL:1;
      uint64_t LCDC_DBIB_CSX_FORCE:1;
      uint64_t LCDC_DBIB_TE_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_DBIB_CFG_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_PARIF_SEL:1;
      uint64_t LCDC_TE_INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_GPIO_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_L0_COLOUR_MODE:5;
      uint64_t reservedSpace0:26;
      uint64_t LCDC_L0_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_LAYER0_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_L0_START_Y:16;
      uint64_t LCDC_L0_START_X:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_LAYER0_STARTXY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_L0_SIZE_Y:16;
      uint64_t LCDC_L0_SIZE_X:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_LAYER0_SIZEXY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_L0_FB_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_LAYER0_BASEADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_L0_STRIDE:16;
      uint64_t LCDC_L0_BURST_LEN:3;
      uint64_t LCDC_L0_FIFO_THR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_LAYER0_STRIDE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_L0_RES_Y:16;
      uint64_t LCDC_L0_RES_X:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_LAYER0_RESXY_REG;

