iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define OTPC_0 (*(volatile struct OTPC_0_tag *) 0x30070000)

struct PATCH_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_VALID:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_VALID_REG;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR0_REG;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR1_REG;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR2_REG;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR3_REG;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR4_REG;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR5_REG;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR6_REG;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR7_REG;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR8_REG;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR9_REG;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR10_REG;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR11_REG;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR12_REG;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR13_REG;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR14_REG;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR15_REG;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR16_REG;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR17_REG;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR18_REG;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR19_REG;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR20_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA20_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR21_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA21_REG;

};

#define PATCH_0 (*(volatile struct PATCH_0_tag *) 0x30090000)

struct PDC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL9_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL10_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL12_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL13_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL14_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_SELECT:2;
      uint64_t TRIG_ID:5;
      uint64_t EN_XTAL:1;
      uint64_t EN_TMR:1;
      uint64_t EN_PER:1;
      uint64_t EN_COM:1;
      uint64_t PDC_MASTER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDC_CTRL15_REG;

