iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define QSPIC2_0 (*(volatile struct QSPIC2_0_tag *) 0x34000000)

struct RFCU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIA_IF_MODE:1;
      uint64_t IFF_IF_MODE:1;
      uint64_t reservedSpace0:1;
      uint64_t IFF_POLARITY:1;
      uint64_t reservedSpace1:1;
      uint64_t LNA_PWR_MODE:1;
      uint64_t reservedSpace2:2;
      uint64_t MIX_BIAS:4;
      uint64_t TIA_BIAS:4;
      uint64_t IFF_BIAS:5;
      uint64_t reservedSpace3:3;
      uint64_t PA_POWER_SETTING:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ATTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RADIO_LDO_EN:1;
      uint64_t RADIO_LDO_EN_SEL:1;
      uint64_t RADIO_LDO_EN_WR:1;
      uint64_t ADPLLDIG_LDO_EN:1;
      uint64_t ADPLLDIG_LDO_EN_SEL:1;
      uint64_t ADPLLDIG_LDO_EN_WR:1;
      uint64_t reservedSpace0:2;
      uint64_t ADPLLDIG_HRESET_N:1;
      uint64_t ADPLLDIG_HCLK_EN:1;
      uint64_t reservedSpace1:6;
      uint64_t RADIO_REGS_RDY:1;
      uint64_t ADPLLDIG_HCLK_DIS:1;
      uint64_t reservedSpace2:6;
      uint64_t RADIO_INIT_AUTOCLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_RADIO_INIT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RADIO_LDO_EN_RD:1;
      uint64_t RADIO_LDO_ZERO_EN_RD:1;
      uint64_t ADPLLDIG_LDO_EN_RD:1;
      uint64_t ADPLLDIG_LDO_ZERO_EN_RD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_LDO_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPENLOOP_RDY_SEL:1;
      uint64_t OPENLOOP_RDY_WR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ADPLLDIG_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AGC_EXT_LUT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_AGC_EXT_LUT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALSTATE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CALSTATE_REG;

  uint32_t RF_SCAN_FEEDBACK_REG;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT_RO:6;
      uint64_t CNT_CLK:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_REF_OSC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SO_CAL:1;
      uint64_t EO_CAL:1;
      uint64_t reservedSpace0:1;
      uint64_t IFF_CAL_DIS:1;
      uint64_t DC_OFFSET_CAL_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CAL_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EO_CAL_CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_IRQ_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_OFFP_I_RD:9;
      uint64_t ADC_OFFN_I_RD:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ADCI_DC_OFFSET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_OFFP_Q_RD:9;
      uint64_t ADC_OFFN_Q_RD:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ADCQ_DC_OFFSET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF_SPARE_BITS:16;
      uint64_t RF_SPARE_BITS_HV:8;
      uint64_t RF_SPARE_IN:4;
      uint64_t RF_SPARE_IN_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_SPARE_REG;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF_CAL_CAP:4;
      uint64_t IF_MUTE:1;
      uint64_t IFF_DCOC_DAC_DIS:1;
      uint64_t RO_TO_PINS:1;
      uint64_t IF_SEL_SET2_GT:4;
      uint64_t IF_SELECT_FSM:1;
      uint64_t IFF_COMPLEX_DIS:1;
      uint64_t IFF_DCOC_DAC_REFCUR_CTRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_IFF_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_DC_OFFSET_SEL:1;
      uint64_t reservedSpace0:12;
      uint64_t ADC_MUTE:1;
      uint64_t ADC_SIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ADC_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_OFFP_I_WR:9;
      uint64_t ADC_OFFN_I_WR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ADC_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_OFFP_Q_WR:9;
      uint64_t ADC_OFFN_Q_WR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ADC_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM_DUTY_POS:3;
      uint64_t TRIM_DUTY_NEG:3;
      uint64_t reservedSpace0:2;
      uint64_t PA_RAMP_STEP_SPEED:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_PA_CTRL_REG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF_LDO_RADIO_VREF_SEL:1;
      uint64_t RF_LDO_RFIO_VREF_SEL:1;
      uint64_t RF_LDO_PA_VREF_SEL:1;
      uint64_t RF_LDO_LNA_VREF_SEL:1;
      uint64_t RF_LDO_MIX_VREF_SEL:1;
      uint64_t RF_LDO_IFF_VREF_SEL:1;
      uint64_t RF_LDO_IFADC_VREF_SEL:1;
      uint64_t RF_LDO_TDC_VREF_SEL:1;
      uint64_t RF_LDO_DTC_VREF_SEL:1;
      uint64_t RF_LDO_DCO_VREF_SEL:1;
      uint64_t RF_LDO_ADPLLDIG_VREF_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_LDO_VREF_SEL_REG;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIXER_IP2_DAC_QN_TRIM:6;
      uint64_t reservedSpace0:2;
      uint64_t MIXER_IP2_DAC_QP_TRIM:6;
      uint64_t reservedSpace1:2;
      uint64_t MIXER_IP2_DAC_IN_TRIM:6;
      uint64_t reservedSpace2:2;
      uint64_t MIXER_IP2_DAC_IP_TRIM:6;
      uint64_t MIXER_IP2_DAC_EXTEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_MIXER_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIX_CAL_CAP_WR_1M:4;
      uint64_t reservedSpace0:4;
      uint64_t MIX_CAL_CAP_WR_2M:4;
      uint64_t reservedSpace1:4;
      uint64_t MIX_CAL_SELECT:1;
      uint64_t reservedSpace2:7;
      uint64_t MIX_SPARE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_MIXER_CTRL2_REG;

