iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res0[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_9_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_10_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_12_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_13_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_14_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_15_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_16_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_17_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_18_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_19_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_20_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_21_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_22_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_23_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_24_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_25_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_26_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_27_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_28_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_29_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_30_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_CNTRL_TIMER_31_REG;

