iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define TIMER_0 (*(volatile struct TIMER_0_tag *) 0x50010200)

struct TIMER2_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_EN:1;
      uint64_t TIM_ONESHOT_MODE_EN:1;
      uint64_t TIM_COUNT_DOWN_EN:1;
      uint64_t TIM_IN1_EVENT_FALL_EN:1;
      uint64_t TIM_IN2_EVENT_FALL_EN:1;
      uint64_t TIM_IRQ_EN:1;
      uint64_t TIM_FREE_RUN_MODE_EN:1;
      uint64_t TIM_SYS_CLK_EN:1;
      uint64_t TIM_CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_TIMER_VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_TIMER_VAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_IN1_STATE:1;
      uint64_t TIM_IN2_STATE:1;
      uint64_t TIM_ONESHOT_PHASE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO1_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_GPIO1_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO2_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_GPIO2_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_RELOAD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_SHOTWIDTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_SHOTWIDTH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PRESCALER:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_PRESCALER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_CAPTURE_GPIO1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_CAPTURE_GPIO2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PRESCALER_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_PRESCALER_VAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PWM_FREQ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_PWM_FREQ_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PWM_DC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_PWM_DC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CLEAR_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2_CLEAR_IRQ_REG;

};

#define TIMER2_0 (*(volatile struct TIMER2_0_tag *) 0x50010300)

struct TIMER3_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t TIM_COUNT_DOWN_EN:1;
      uint64_t TIM_IN1_EVENT_FALL_EN:1;
      uint64_t TIM_IN2_EVENT_FALL_EN:1;
      uint64_t TIM_IRQ_EN:1;
      uint64_t TIM_FREE_RUN_MODE_EN:1;
      uint64_t TIM_SYS_CLK_EN:1;
      uint64_t TIM_CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_TIMER_VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_TIMER_VAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_IN1_STATE:1;
      uint64_t TIM_IN2_STATE:1;
      uint64_t TIM_ONESHOT_PHASE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO1_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_GPIO1_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO2_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_GPIO2_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_RELOAD_REG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PRESCALER:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_PRESCALER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_CAPTURE_GPIO1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_CAPTURE_GPIO2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PRESCALER_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_PRESCALER_VAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PWM_FREQ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_PWM_FREQ_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PWM_DC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_PWM_DC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CLEAR_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER3_CLEAR_IRQ_REG;

};

#define TIMER3_0 (*(volatile struct TIMER3_0_tag *) 0x50040a00)

struct TIMER4_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t TIM_COUNT_DOWN_EN:1;
      uint64_t TIM_IN1_EVENT_FALL_EN:1;
      uint64_t TIM_IN2_EVENT_FALL_EN:1;
      uint64_t TIM_IRQ_EN:1;
      uint64_t TIM_FREE_RUN_MODE_EN:1;
      uint64_t TIM_SYS_CLK_EN:1;
      uint64_t TIM_CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_TIMER_VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_TIMER_VAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_IN1_STATE:1;
      uint64_t TIM_IN2_STATE:1;
      uint64_t TIM_ONESHOT_PHASE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO1_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_GPIO1_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO2_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_GPIO2_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_RELOAD_REG;

