iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PRESCALER:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_PRESCALER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_CAPTURE_GPIO1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_CAPTURE_GPIO2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PRESCALER_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_PRESCALER_VAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PWM_FREQ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_PWM_FREQ_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PWM_DC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_PWM_DC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CLEAR_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER4_CLEAR_IRQ_REG;

};

#define TIMER4_0 (*(volatile struct TIMER4_0_tag *) 0x50040b00)

struct TRNG_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRNG_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRNG_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRNG_FIFOLVL:5;
      uint64_t TRNG_FIFOFULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRNG_FIFOLVL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRNG_SVN:16;
      uint64_t TRNG_MIN:8;
      uint64_t TRNG_MAJ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRNG_VER_REG;

};

#define TRNG_0 (*(volatile struct TRNG_0_tag *) 0x50040c00)

struct UART_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBR_THR_DLL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_RBR_THR_DLL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERBFI_DLH0:1;
      uint64_t ETBEI_DLH1:1;
      uint64_t ELSI_DLH2:1;
      uint64_t EDSSI_DLH3:1;
      uint64_t ELCOLR_DLH4:1;
      uint64_t DLH6_5:2;
      uint64_t PTIME_DLH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_IER_DLH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IIR_FCR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_IIR_FCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DLS:2;
      uint64_t UART_STOP:1;
      uint64_t UART_PEN:1;
      uint64_t UART_EPS:1;
      uint64_t reservedSpace0:1;
      uint64_t UART_BC:1;
      uint64_t UART_DLAB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_LCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t UART_LB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_MCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DR:1;
      uint64_t UART_OE:1;
      uint64_t UART_PE:1;
      uint64_t UART_FE:1;
      uint64_t UART_BI:1;
      uint64_t UART_THRE:1;
      uint64_t UART_TEMT:1;
      uint64_t UART_RFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_LSR_REG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SCRATCH_PAD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SCR_REG;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR9_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR10_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR12_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR13_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR14_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRBR_STHR15_REG;

