iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_BUSY:1;
      uint64_t UART_TFNF:1;
      uint64_t UART_TFE:1;
      uint64_t UART_RFNE:1;
      uint64_t UART_RFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_USR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_TRANSMIT_FIFO_LEVEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_TFL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_RECEIVE_FIFO_LEVEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_RFL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_UR:1;
      uint64_t UART_RFR:1;
      uint64_t UART_XFR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRR_REG;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_BREAK_CONTROL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SBCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_DMA_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SDMAM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_FIFO_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SFE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_RCVR_TRIGGER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_SRT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_TX_EMPTY_TRIGGER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_STET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_HALT_TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_HTX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DMASA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_DMASA_REG;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DLF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_DLF_REG;

  uint8_t res5[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_UCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_UCV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_CTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_CTR_REG;

};

#define UART_0 (*(volatile struct UART_0_tag *) 0x50020000)

struct UART2_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBR_THR_DLL:8;
      uint64_t RBR_THR_9BIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_RBR_THR_DLL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERBFI_DLH0:1;
      uint64_t ETBEI_DLH1:1;
      uint64_t ELSI_DLH2:1;
      uint64_t EDSSI_DLH3:1;
      uint64_t ELCOLR_DLH4:1;
      uint64_t DLH6_5:2;
      uint64_t PTIME_DLH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_IER_DLH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IIR_FCR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_IIR_FCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DLS:2;
      uint64_t UART_STOP:1;
      uint64_t UART_PEN:1;
      uint64_t UART_EPS:1;
      uint64_t UART_SP:1;
      uint64_t UART_BC:1;
      uint64_t UART_DLAB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_LCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t UART_RTS:1;
      uint64_t reservedSpace1:2;
      uint64_t UART_LB:1;
      uint64_t UART_AFCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_MCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DR:1;
      uint64_t UART_OE:1;
      uint64_t UART_PE:1;
      uint64_t UART_FE:1;
      uint64_t UART_BI:1;
      uint64_t UART_THRE:1;
      uint64_t UART_TEMT:1;
      uint64_t UART_RFE:1;
      uint64_t UART_ADDR_RCVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_LSR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DCTS:1;
      uint64_t reservedSpace0:3;
      uint64_t UART_CTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_MSR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SCRATCH_PAD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SCR_REG;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR9_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR10_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR12_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR13_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR14_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRBR_STHR15_REG;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_BUSY:1;
      uint64_t UART_TFNF:1;
      uint64_t UART_TFE:1;
      uint64_t UART_RFNE:1;
      uint64_t UART_RFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_USR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_TRANSMIT_FIFO_LEVEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_TFL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_RECEIVE_FIFO_LEVEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_RFL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_UR:1;
      uint64_t UART_RFR:1;
      uint64_t UART_XFR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_REQUEST_TO_SEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRTS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_BREAK_CONTROL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SBCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_DMA_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SDMAM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_FIFO_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SFE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_RCVR_TRIGGER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_SRT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_TX_EMPTY_TRIGGER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_STET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_HALT_TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_HTX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DMASA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_DMASA_REG;

