iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DLF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_DLF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_RAR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_RAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_TAR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_TAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DLS_E:1;
      uint64_t UART_ADDR_MATCH:1;
      uint64_t UART_SEND_ADDR:1;
      uint64_t UART_TRANSMIT_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_LCR_EXT;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISO7816_CLK_DIV:5;
      uint64_t ISO7816_CLK_EN:1;
      uint64_t ISO7816_CLK_LEVEL:1;
      uint64_t ISO7816_CLK_STATUS:1;
      uint64_t ISO7816_TIM_EXPIRED_IRQMASK:1;
      uint64_t ISO7816_ERR_TX_TIME_IRQMASK:1;
      uint64_t ISO7816_ERR_TX_VALUE_IRQMASK:1;
      uint64_t ISO7816_AUTO_GT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISO7816_TIM_MAX:16;
      uint64_t ISO7816_TIM_EN:1;
      uint64_t ISO7816_TIM_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISO7816_ERR_PULSE_OFFSET:4;
      uint64_t ISO7816_ERR_PULSE_WIDTH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_ERR_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISO7816_TIM_EXPIRED_IRQ:1;
      uint64_t ISO7816_ERR_TX_TIME_IRQ:1;
      uint64_t ISO7816_ERR_TX_VALUE_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_IRQ_STATUS_REG;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_UCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_UCV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_CTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_CTR_REG;

};

#define UART3_0 (*(volatile struct UART3_0_tag *) 0x50020200)

struct USB_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBEN:1;
      uint64_t USB_DBG:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_NAT:1;
      uint64_t LSMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_MCTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_XCV_TEST:1;
      uint64_t USB_XCV_TXp:1;
      uint64_t USB_XCV_TXn:1;
      uint64_t USB_XCV_TXEN:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_RCV:1;
      uint64_t USB_VMIN:1;
      uint64_t USB_VPIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_XCVDIAG_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_CADJ:5;
      uint64_t USB_VADJ:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_UTR_RES:5;
      uint64_t USB_SF:1;
      uint64_t USB_NCRC:1;
      uint64_t USB_DIAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_UTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_AD:7;
      uint64_t USB_AD_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_FAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_NFS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_NFSR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_WARN:1;
      uint64_t USB_ALT:1;
      uint64_t USB_TX_EV:1;
      uint64_t USB_FRAME:1;
      uint64_t USB_NAK:1;
      uint64_t USB_ULD:1;
      uint64_t USB_RX_EV:1;
      uint64_t USB_INTR:1;
      uint64_t USB_EP0_TX:1;
      uint64_t USB_EP0_RX:1;
      uint64_t USB_EP0_NAK:1;
      uint64_t USB_CH_EV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_MAEV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_M_WARN:1;
      uint64_t USB_M_ALT:1;
      uint64_t USB_M_TX_EV:1;
      uint64_t USB_M_FRAME:1;
      uint64_t USB_M_NAK:1;
      uint64_t USB_M_ULD:1;
      uint64_t USB_M_RX_EV:1;
      uint64_t USB_M_INTR:1;
      uint64_t USB_M_EP0_TX:1;
      uint64_t USB_M_EP0_RX:1;
      uint64_t USB_M_EP0_NAK:1;
      uint64_t USB_M_CH_EV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_MAMSK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t USB_EOP:1;
      uint64_t USB_SD3:1;
      uint64_t USB_SD5:1;
      uint64_t USB_RESET:1;
      uint64_t USB_RESUME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_ALTEV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t USB_M_EOP:1;
      uint64_t USB_M_SD3:1;
      uint64_t USB_M_SD5:1;
      uint64_t USB_M_RESET:1;
      uint64_t USB_M_RESUME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_ALTMSK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TXFIFO31:3;
      uint64_t reservedSpace0:1;
      uint64_t USB_TXUDRRN31:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXEV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_M_TXFIFO31:3;
      uint64_t reservedSpace0:1;
      uint64_t USB_M_TXUDRRN31:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXMSK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RXFIFO31:3;
      uint64_t reservedSpace0:1;
      uint64_t USB_RXOVRRN31:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXEV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_M_RXFIFO31:3;
      uint64_t reservedSpace0:1;
      uint64_t USB_M_RXOVRRN31:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXMSK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_IN31:3;
      uint64_t reservedSpace0:1;
      uint64_t USB_OUT31:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_NAKEV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_M_IN31:3;
      uint64_t reservedSpace0:1;
      uint64_t USB_M_OUT31:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_NAKMSK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TXWARN31:3;
      uint64_t reservedSpace0:1;
      uint64_t USB_RXWARN31:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_FWEV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_M_TXWARN31:3;
      uint64_t reservedSpace0:1;
      uint64_t USB_M_RXWARN31:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_FWMSK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_FN_10_8:3;
      uint64_t reservedSpace0:2;
      uint64_t USB_RFC:1;
      uint64_t USB_UL:1;
      uint64_t USB_MF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_FNH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_FN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_FNL_REG;

  uint8_t res0[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPU_SSPROTEN:1;
      uint64_t RPU_RCDELAY:1;
      uint64_t RPU_TEST_SW1DM:1;
      uint64_t reservedSpace0:1;
      uint64_t RPU_TEST_EN:1;
      uint64_t RPU_TEST_SW1:1;
      uint64_t RPU_TEST_SW2:1;
      uint64_t RPU_TEST7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_UX20CDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_EP:4;
      uint64_t reservedSpace0:2;
      uint64_t USB_DEF:1;
      uint64_t USB_STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EPC0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TXFD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXD0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TCOUNT:5;
      uint64_t USB_TX_DONE:1;
      uint64_t USB_ACK_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXS0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TX_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_TOGGLE_TX0:1;
      uint64_t USB_FLUSH:1;
      uint64_t USB_IGN_IN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXC0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_EP0_INNAK:1;
      uint64_t USB_EP0_OUTNAK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EP0_NAK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RXFD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXD0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RCOUNT:4;
      uint64_t USB_RX_LAST:1;
      uint64_t USB_TOGGLE_RX0:1;
      uint64_t USB_SETUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXS0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RX_EN:1;
      uint64_t USB_IGN_OUT:1;
      uint64_t USB_IGN_SETUP:1;
      uint64_t USB_FLUSH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXC0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_EP:4;
      uint64_t USB_EP_EN:1;
      uint64_t USB_ISO:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EPC1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TXFD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXD1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TCOUNT:5;
      uint64_t USB_TX_DONE:1;
      uint64_t USB_ACK_STAT:1;
      uint64_t USB_TX_URUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXS1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TX_EN:1;
      uint64_t USB_LAST:1;
      uint64_t USB_TOGGLE_TX:1;
      uint64_t USB_FLUSH:1;
      uint64_t USB_RFF:1;
      uint64_t USB_TFWL:2;
      uint64_t USB_IGN_ISOMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXC1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_EP:4;
      uint64_t USB_EP_EN:1;
      uint64_t USB_ISO:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EPC2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RXFD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXD1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RCOUNT:4;
      uint64_t USB_RX_LAST:1;
      uint64_t USB_TOGGLE_RX:1;
      uint64_t USB_SETUP:1;
      uint64_t USB_RX_ERR:1;
      uint64_t USB_RXCOUNT:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXS1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RX_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_IGN_SETUP:1;
      uint64_t USB_FLUSH:1;
      uint64_t reservedSpace1:1;
      uint64_t USB_RFWL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXC1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_EP:4;
      uint64_t USB_EP_EN:1;
      uint64_t USB_ISO:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EPC3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TXFD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXD2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TCOUNT:5;
      uint64_t USB_TX_DONE:1;
      uint64_t USB_ACK_STAT:1;
      uint64_t USB_TX_URUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXS2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TX_EN:1;
      uint64_t USB_LAST:1;
      uint64_t USB_TOGGLE_TX:1;
      uint64_t USB_FLUSH:1;
      uint64_t USB_RFF:1;
      uint64_t USB_TFWL:2;
      uint64_t USB_IGN_ISOMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXC2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_EP:4;
      uint64_t USB_EP_EN:1;
      uint64_t USB_ISO:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EPC4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RXFD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXD2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RCOUNT:4;
      uint64_t USB_RX_LAST:1;
      uint64_t USB_TOGGLE_RX:1;
      uint64_t USB_SETUP:1;
      uint64_t USB_RX_ERR:1;
      uint64_t USB_RXCOUNT:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXS2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RX_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_IGN_SETUP:1;
      uint64_t USB_FLUSH:1;
      uint64_t reservedSpace1:1;
      uint64_t USB_RFWL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXC2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_EP:4;
      uint64_t USB_EP_EN:1;
      uint64_t USB_ISO:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EPC5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TXFD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXD3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TCOUNT:5;
      uint64_t USB_TX_DONE:1;
      uint64_t USB_ACK_STAT:1;
      uint64_t USB_TX_URUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXS3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_TX_EN:1;
      uint64_t USB_LAST:1;
      uint64_t USB_TOGGLE_TX:1;
      uint64_t USB_FLUSH:1;
      uint64_t USB_RFF:1;
      uint64_t USB_TFWL:2;
      uint64_t USB_IGN_ISOMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_TXC3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_EP:4;
      uint64_t USB_EP_EN:1;
      uint64_t USB_ISO:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_EPC6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RXFD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXD3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RCOUNT:4;
      uint64_t USB_RX_LAST:1;
      uint64_t USB_TOGGLE_RX:1;
      uint64_t USB_SETUP:1;
      uint64_t USB_RX_ERR:1;
      uint64_t USB_RXCOUNT:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXS3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_RX_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t USB_IGN_SETUP:1;
      uint64_t USB_FLUSH:1;
      uint64_t reservedSpace1:1;
      uint64_t USB_RFWL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_RXC3_REG;

  uint8_t res1[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_DMA_RX:3;
      uint64_t USB_DMA_TX:3;
      uint64_t USB_DMA_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_DMA_CTRL_REG;

