iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_CHARGE_ON:1;
      uint64_t IDP_SRC_ON:1;
      uint64_t VDP_SRC_ON:1;
      uint64_t VDM_SRC_ON:1;
      uint64_t IDP_SINK_ON:1;
      uint64_t IDM_SINK_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_CHARGER_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_DCP_DET:1;
      uint64_t USB_CHG_DET:1;
      uint64_t USB_DP_VAL:1;
      uint64_t USB_DM_VAL:1;
      uint64_t USB_DP_VAL2:1;
      uint64_t USB_DM_VAL2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_CHARGER_STAT_REG;

};

#define USB_2 (*(volatile struct USB_2_tag *) 0x50040000)

struct WAKEUP_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_DEB_VALUE:6;
      uint64_t WKUP_SFT_KEYHIT:1;
      uint64_t WKUP_ENABLE_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_CTRL_REG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_IRQ_RST:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_RESET_IRQ_REG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_SELECT_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_SELECT_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_SELECT_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_SELECT_P1_REG;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_POL_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_POL_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_POL_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_POL_P1_REG;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_STAT_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_STATUS_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_STAT_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_STATUS_P1_REG;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_CLEAR_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_CLEAR_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_CLEAR_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_CLEAR_P1_REG;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_SEL_GPIO_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_SEL_GPIO_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_SEL_GPIO_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_SEL_GPIO_P1_REG;

};

#define WAKEUP_0 (*(volatile struct WAKEUP_0_tag *) 0x50000100)

struct CRC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t reservedSpace0:4;
      uint64_t REV_IN:2;
      uint64_t REV_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INIT;

};

#define CRC_0 (*(volatile struct CRC_0_tag *) 0x40023000)

struct GPIOF_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODER0:2;
      uint64_t MODER1:2;
      uint64_t MODER2:2;
      uint64_t MODER3:2;
      uint64_t MODER4:2;
      uint64_t MODER5:2;
      uint64_t MODER6:2;
      uint64_t MODER7:2;
      uint64_t MODER8:2;
      uint64_t MODER9:2;
      uint64_t MODER10:2;
      uint64_t MODER11:2;
      uint64_t MODER12:2;
      uint64_t MODER13:2;
      uint64_t MODER14:2;
      uint64_t MODER15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OT0:1;
      uint64_t OT1:1;
      uint64_t OT2:1;
      uint64_t OT3:1;
      uint64_t OT4:1;
      uint64_t OT5:1;
      uint64_t OT6:1;
      uint64_t OT7:1;
      uint64_t OT8:1;
      uint64_t OT9:1;
      uint64_t OT10:1;
      uint64_t OT11:1;
      uint64_t OT12:1;
      uint64_t OT13:1;
      uint64_t OT14:1;
      uint64_t OT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTYPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSPEEDR0:2;
      uint64_t OSPEEDR1:2;
      uint64_t OSPEEDR2:2;
      uint64_t OSPEEDR3:2;
      uint64_t OSPEEDR4:2;
      uint64_t OSPEEDR5:2;
      uint64_t OSPEEDR6:2;
      uint64_t OSPEEDR7:2;
      uint64_t OSPEEDR8:2;
      uint64_t OSPEEDR9:2;
      uint64_t OSPEEDR10:2;
      uint64_t OSPEEDR11:2;
      uint64_t OSPEEDR12:2;
      uint64_t OSPEEDR13:2;
      uint64_t OSPEEDR14:2;
      uint64_t OSPEEDR15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSPEEDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PUPDR0:2;
      uint64_t PUPDR1:2;
      uint64_t PUPDR2:2;
      uint64_t PUPDR3:2;
      uint64_t PUPDR4:2;
      uint64_t PUPDR5:2;
      uint64_t PUPDR6:2;
      uint64_t PUPDR7:2;
      uint64_t PUPDR8:2;
      uint64_t PUPDR9:2;
      uint64_t PUPDR10:2;
      uint64_t PUPDR11:2;
      uint64_t PUPDR12:2;
      uint64_t PUPDR13:2;
      uint64_t PUPDR14:2;
      uint64_t PUPDR15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUPDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDR0:1;
      uint64_t IDR1:1;
      uint64_t IDR2:1;
      uint64_t IDR3:1;
      uint64_t IDR4:1;
      uint64_t IDR5:1;
      uint64_t IDR6:1;
      uint64_t IDR7:1;
      uint64_t IDR8:1;
      uint64_t IDR9:1;
      uint64_t IDR10:1;
      uint64_t IDR11:1;
      uint64_t IDR12:1;
      uint64_t IDR13:1;
      uint64_t IDR14:1;
      uint64_t IDR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ODR0:1;
      uint64_t ODR1:1;
      uint64_t ODR2:1;
      uint64_t ODR3:1;
      uint64_t ODR4:1;
      uint64_t ODR5:1;
      uint64_t ODR6:1;
      uint64_t ODR7:1;
      uint64_t ODR8:1;
      uint64_t ODR9:1;
      uint64_t ODR10:1;
      uint64_t ODR11:1;
      uint64_t ODR12:1;
      uint64_t ODR13:1;
      uint64_t ODR14:1;
      uint64_t ODR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ODR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BS0:1;
      uint64_t BS1:1;
      uint64_t BS2:1;
      uint64_t BS3:1;
      uint64_t BS4:1;
      uint64_t BS5:1;
      uint64_t BS6:1;
      uint64_t BS7:1;
      uint64_t BS8:1;
      uint64_t BS9:1;
      uint64_t BS10:1;
      uint64_t BS11:1;
      uint64_t BS12:1;
      uint64_t BS13:1;
      uint64_t BS14:1;
      uint64_t BS15:1;
      uint64_t BR0:1;
      uint64_t BR1:1;
      uint64_t BR2:1;
      uint64_t BR3:1;
      uint64_t BR4:1;
      uint64_t BR5:1;
      uint64_t BR6:1;
      uint64_t BR7:1;
      uint64_t BR8:1;
      uint64_t BR9:1;
      uint64_t BR10:1;
      uint64_t BR11:1;
      uint64_t BR12:1;
      uint64_t BR13:1;
      uint64_t BR14:1;
      uint64_t BR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BSRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCK0:1;
      uint64_t LCK1:1;
      uint64_t LCK2:1;
      uint64_t LCK3:1;
      uint64_t LCK4:1;
      uint64_t LCK5:1;
      uint64_t LCK6:1;
      uint64_t LCK7:1;
      uint64_t LCK8:1;
      uint64_t LCK9:1;
      uint64_t LCK10:1;
      uint64_t LCK11:1;
      uint64_t LCK12:1;
      uint64_t LCK13:1;
      uint64_t LCK14:1;
      uint64_t LCK15:1;
      uint64_t LCKK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFRL0:4;
      uint64_t AFRL1:4;
      uint64_t AFRL2:4;
      uint64_t AFRL3:4;
      uint64_t AFRL4:4;
      uint64_t AFRL5:4;
      uint64_t AFRL6:4;
      uint64_t AFRL7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AFRH8:4;
      uint64_t AFRH9:4;
      uint64_t AFRH10:4;
      uint64_t AFRH11:4;
      uint64_t AFRH12:4;
      uint64_t AFRH13:4;
      uint64_t AFRH14:4;
      uint64_t AFRH15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR0:1;
      uint64_t BR1:1;
      uint64_t BR2:1;
      uint64_t BR3:1;
      uint64_t BR4:1;
      uint64_t BR5:1;
      uint64_t BR6:1;
      uint64_t BR7:1;
      uint64_t BR8:1;
      uint64_t BR9:1;
      uint64_t BR10:1;
      uint64_t BR11:1;
      uint64_t BR12:1;
      uint64_t BR13:1;
      uint64_t BR14:1;
      uint64_t BR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

