iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define SPI3_1 (*(volatile struct SPI3_1_tag *) 0x40003c00)

struct SPI2_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t MSTR:1;
      uint64_t BR:3;
      uint64_t SPE:1;
      uint64_t LSBFIRST:1;
      uint64_t SSI:1;
      uint64_t SSM:1;
      uint64_t RXONLY:1;
      uint64_t DFF:1;
      uint64_t CRCNEXT:1;
      uint64_t CRCEN:1;
      uint64_t BIDIOE:1;
      uint64_t BIDIMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDMAEN:1;
      uint64_t TXDMAEN:1;
      uint64_t SSOE:1;
      uint64_t reservedSpace0:1;
      uint64_t FRF:1;
      uint64_t ERRIE:1;
      uint64_t RXNEIE:1;
      uint64_t TXEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNE:1;
      uint64_t TXE:1;
      uint64_t CHSIDE:1;
      uint64_t UDR:1;
      uint64_t CRCERR:1;
      uint64_t MODF:1;
      uint64_t OVR:1;
      uint64_t BSY:1;
      uint64_t TIFRFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRCPOLY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RxCRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXCRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxCRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXCRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHLEN:1;
      uint64_t DATLEN:2;
      uint64_t CKPOL:1;
      uint64_t I2SSTD:2;
      uint64_t reservedSpace0:1;
      uint64_t PCMSYNC:1;
      uint64_t I2SCFG:2;
      uint64_t I2SE:1;
      uint64_t I2SMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SDIV:8;
      uint64_t ODD:1;
      uint64_t MCKOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SPR;

};

#define SPI2_2 (*(volatile struct SPI2_2_tag *) 0x40003800)

struct ADC1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWD:1;
      uint64_t EOC:1;
      uint64_t JEOC:1;
      uint64_t JSTRT:1;
      uint64_t STRT:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWDCH:5;
      uint64_t EOCIE:1;
      uint64_t AWDIE:1;
      uint64_t JEOCIE:1;
      uint64_t SCAN:1;
      uint64_t AWDSGL:1;
      uint64_t JAUTO:1;
      uint64_t DISCEN:1;
      uint64_t JDISCEN:1;
      uint64_t DISCNUM:3;
      uint64_t reservedSpace0:6;
      uint64_t JAWDEN:1;
      uint64_t AWDEN:1;
      uint64_t RES:2;
      uint64_t OVRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADON:1;
      uint64_t CONT:1;
      uint64_t reservedSpace0:6;
      uint64_t DMA:1;
      uint64_t DDS:1;
      uint64_t EOCS:1;
      uint64_t ALIGN:1;
      uint64_t reservedSpace1:4;
      uint64_t JEXTSEL:4;
      uint64_t JEXTEN:2;
      uint64_t JSWSTART:1;
      uint64_t reservedSpace2:1;
      uint64_t EXTSEL:4;
      uint64_t EXTEN:2;
      uint64_t SWSTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMP10:3;
      uint64_t SMP11:3;
      uint64_t SMP12:3;
      uint64_t SMP13:3;
      uint64_t SMP14:3;
      uint64_t SMP15:3;
      uint64_t SMP16:3;
      uint64_t SMP17:3;
      uint64_t SMP18:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMP0:3;
      uint64_t SMP1:3;
      uint64_t SMP2:3;
      uint64_t SMP3:3;
      uint64_t SMP4:3;
      uint64_t SMP5:3;
      uint64_t SMP6:3;
      uint64_t SMP7:3;
      uint64_t SMP8:3;
      uint64_t SMP9:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JOFFSET1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JOFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JOFFSET2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JOFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JOFFSET3:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JOFR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JOFFSET4:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JOFR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQ13:5;
      uint64_t SQ14:5;
      uint64_t SQ15:5;
      uint64_t SQ16:5;
      uint64_t L:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SQR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQ7:5;
      uint64_t SQ8:5;
      uint64_t SQ9:5;
      uint64_t SQ10:5;
      uint64_t SQ11:5;
      uint64_t SQ12:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SQR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQ1:5;
      uint64_t SQ2:5;
      uint64_t SQ3:5;
      uint64_t SQ4:5;
      uint64_t SQ5:5;
      uint64_t SQ6:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SQR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JSQ1:5;
      uint64_t JSQ2:5;
      uint64_t JSQ3:5;
      uint64_t JSQ4:5;
      uint64_t JL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JSQR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

