iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define UART5_1 (*(volatile struct UART5_1_tag *) 0x40005000)

struct ADC_Common_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWD1:1;
      uint64_t EOC1:1;
      uint64_t JEOC1:1;
      uint64_t JSTRT1:1;
      uint64_t STRT1:1;
      uint64_t OVR1:1;
      uint64_t reservedSpace0:2;
      uint64_t AWD2:1;
      uint64_t EOC2:1;
      uint64_t JEOC2:1;
      uint64_t JSTRT2:1;
      uint64_t STRT2:1;
      uint64_t OVR2:1;
      uint64_t reservedSpace1:2;
      uint64_t AWD3:1;
      uint64_t EOC3:1;
      uint64_t JEOC3:1;
      uint64_t JSTRT3:1;
      uint64_t STRT3:1;
      uint64_t OVR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MULT:5;
      uint64_t reservedSpace0:3;
      uint64_t DELAY:4;
      uint64_t reservedSpace1:1;
      uint64_t DDS:1;
      uint64_t DMA:2;
      uint64_t ADCPRE:2;
      uint64_t reservedSpace2:4;
      uint64_t VBATE:1;
      uint64_t TSVREFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA1:16;
      uint64_t DATA2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

};

#define ADC_Common_1 (*(volatile struct ADC_Common_1_tag *) 0x40012300)

struct Ethernet_MAC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t DC:1;
      uint64_t BL:2;
      uint64_t APCS:1;
      uint64_t reservedSpace1:1;
      uint64_t RD:1;
      uint64_t IPCO:1;
      uint64_t DM:1;
      uint64_t LM:1;
      uint64_t ROD:1;
      uint64_t FES:1;
      uint64_t reservedSpace2:1;
      uint64_t CSD:1;
      uint64_t IFG:3;
      uint64_t reservedSpace3:2;
      uint64_t JD:1;
      uint64_t WD:1;
      uint64_t reservedSpace4:1;
      uint64_t CSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PM:1;
      uint64_t HU:1;
      uint64_t HM:1;
      uint64_t DAIF:1;
      uint64_t PAM:1;
      uint64_t BFD:1;
      uint64_t PCF:1;
      uint64_t reservedSpace0:1;
      uint64_t SAIF:1;
      uint64_t SAF:1;
      uint64_t HPF:1;
      uint64_t reservedSpace1:20;
      uint64_t RA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACFFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHTHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB:1;
      uint64_t MW:1;
      uint64_t CR:3;
      uint64_t reservedSpace0:1;
      uint64_t MR:5;
      uint64_t PA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACMIIAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACMIIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCB:1;
      uint64_t TFCE:1;
      uint64_t RFCE:1;
      uint64_t UPFD:1;
      uint64_t PLT:2;
      uint64_t reservedSpace0:1;
      uint64_t ZQPD:1;
      uint64_t reservedSpace1:8;
      uint64_t PT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLANTI:16;
      uint64_t VLANTC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACVLANTR;

  uint8_t res0[8];

  uint32_t MACRWUFFR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t MPE:1;
      uint64_t WFE:1;
      uint64_t reservedSpace0:2;
      uint64_t MPR:1;
      uint64_t WFR:1;
      uint64_t reservedSpace1:2;
      uint64_t GU:1;
      uint64_t reservedSpace2:21;
      uint64_t WFFRPR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPMTCSR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MMRPEA:1;
      uint64_t MSFRWCS:1;
      uint64_t reservedSpace0:2;
      uint64_t RFWRA:1;
      uint64_t RFRCS:1;
      uint64_t reservedSpace1:2;
      uint64_t RFFL:1;
      uint64_t reservedSpace2:7;
      uint64_t MMTEA:1;
      uint64_t MTFCS:2;
      uint64_t MTP:1;
      uint64_t TFRS:2;
      uint64_t TFWA:1;
      uint64_t reservedSpace3:1;
      uint64_t TFNE:1;
      uint64_t TFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACDBGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PMTS:1;
      uint64_t MMCS:1;
      uint64_t MMCRS:1;
      uint64_t MMCTS:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PMTIM:1;
      uint64_t reservedSpace1:5;
      uint64_t TSTIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA0H:16;
      uint64_t reservedSpace0:15;
      uint64_t MO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA0HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA0L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA0LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA1H:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA1HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA1LR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA1LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAC2AH:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA2HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA2L:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA2LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA3H:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA3HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBCA3L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA3LR;

