iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res2[3051];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

};

#define WDG (*(volatile struct WDG_tag *) 0x40700000)

struct ADC_1_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t ON:1;
      uint64_t CALEN:1;
      uint64_t SWSTART:1;
      uint64_t RESET:1;
      uint64_t STOP:1;
      uint64_t ENAB_COMP:1;
      uint64_t RSTCALEN:1;
      uint64_t AUTO_OFFSET:1;
      uint64_t MIC_ON:1;
      uint64_t DMA_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN_DFMODE:1;
      uint64_t CHSEL:3;
      uint64_t REFSEL:2;
      uint64_t DECIM_RATE:2;
      uint64_t PGASEL:2;
      uint64_t reservedSpace0:1;
      uint64_t CONT:1;
      uint64_t reservedSpace1:5;
      uint64_t ROUND16:1;
      uint64_t SKIP:1;
      uint64_t reservedSpace2:1;
      uint64_t DIG_FILT_CLK:1;
      uint64_t DIS_WKP_WAIT:1;
      uint64_t MIC_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONF;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ENDCAL:1;
      uint64_t BUSY:1;
      uint64_t EOC:1;
      uint64_t WDOG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IRQSTAT;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ENDCAL:1;
      uint64_t BUSY:1;
      uint64_t EOC:1;
      uint64_t WDOG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) IRQMASK;

  uint8_t res1[7];

  uint32_t DATA_CONV;
  uint32_t OFFSET;
  uint8_t res2[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ENDCAL:1;
      uint64_t BUSY:1;
      uint64_t EOC:1;
      uint64_t WDOG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SR_REG;

  uint8_t res3[3];

  uint32_t THRESHOLD_HI;
  uint32_t THRESHOLD_LO;
};

#define ADC_1 (*(volatile struct ADC_1_tag *) 0x40800002)

struct CKGEN_SOC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t UART_CKDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONTROL;

  uint8_t res0[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYSREQ:1;
      uint64_t WDG_bitfield:1;
      uint64_t LOCKUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) REASON_RST;

  uint8_t res1[19];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:4;
      uint64_t VERSION:5;
      uint64_t PRODUCT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIE_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO:1;
      uint64_t NVM:1;
      uint64_t SYSCTRL:1;
      uint64_t UART:1;
      uint64_t SPI:1;
      uint64_t reservedSpace0:2;
      uint64_t WDOG:1;
      uint64_t ADC:1;
      uint64_t I2C1:1;
      uint64_t I2C2:1;
      uint64_t MFT1_bitfield:1;
      uint64_t MFT2_bitfield:1;
      uint64_t RTC:1;
      uint64_t reservedSpace1:2;
      uint64_t DMA:1;
      uint64_t RNG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLOCK_EN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ADC_CH0:1;
      uint64_t ADC_CH1:1;
      uint64_t ADC_CH2:1;
      uint64_t ADC_CH3:1;
      uint64_t ADC_CH4:1;
      uint64_t ADC_CH5:1;
      uint64_t ADC_CH6:1;
      uint64_t ADC_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMA_CONFIG;

};

#define CKGEN_SOC (*(volatile struct CKGEN_SOC_tag *) 0x40900000)

struct I2C2_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t OM:2;
      uint64_t SAM:1;
      uint64_t SM:2;
      uint64_t SGCM:1;
      uint64_t FTX:1;
      uint64_t FRX:1;
      uint64_t DMA_TX_EN:1;
      uint64_t DMA_RX_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FON:2;
      uint64_t FS_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SA7:7;
      uint64_t ESA10:3;
      uint64_t reservedSpace0:6;
      uint64_t SLSU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OP:1;
      uint64_t A7:7;
      uint64_t EA10:3;
      uint64_t SB:1;
      uint64_t AM:2;
      uint64_t P:1;
      uint64_t LENGTH:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TFR;

  uint8_t res1[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OP:2;
      uint64_t STATUS:2;
      uint64_t CAUSE:3;
      uint64_t TYPE:2;
      uint64_t LENGTH:10;
      uint64_t reservedSpace0:10;
      uint64_t DUALF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RFR;

  uint8_t res2[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t THRESH_TX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TFTR;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t THRESH_RX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFTR;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DBSIZE_TX:3;
      uint64_t BURST_TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMAR;

  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BRCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BRCR;

  uint8_t res6[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFEM:1;
      uint64_t TXFNEM:1;
      uint64_t TXFFM:1;
      uint64_t TXFOVRM:1;
      uint64_t RXFEM:1;
      uint64_t RXFNFM:1;
      uint64_t RXFFM:1;
      uint64_t reservedSpace0:9;
      uint64_t RFSRM:1;
      uint64_t RFSEM:1;
      uint64_t WTSRM:1;
      uint64_t MTDM:1;
      uint64_t STDM:1;
      uint64_t reservedSpace1:3;
      uint64_t MALM:1;
      uint64_t BERRM:1;
      uint64_t reservedSpace2:2;
      uint64_t MTDWSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFE:1;
      uint64_t TXFNE:1;
      uint64_t TXFF:1;
      uint64_t TXFOVR:1;
      uint64_t RXFE:1;
      uint64_t RXFNF:1;
      uint64_t RXFF:1;
      uint64_t reservedSpace0:8;
      uint64_t LBR:1;
      uint64_t RFSR:1;
      uint64_t RFSE:1;
      uint64_t WTSR:1;
      uint64_t MTD:1;
      uint64_t STD:1;
      uint64_t reservedSpace1:2;
      uint64_t SAL:1;
      uint64_t MAL:1;
      uint64_t BERR:1;
      uint64_t reservedSpace2:2;
      uint64_t MTDWS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFEMIS:1;
      uint64_t TXFNEMIS:1;
      uint64_t TXFFMIS:1;
      uint64_t TXFOVRMIS:1;
      uint64_t RXFEMIS:1;
      uint64_t RXFNFMIS:1;
      uint64_t RXFFMIS:1;
      uint64_t reservedSpace0:8;
      uint64_t LBRMIS:1;
      uint64_t RFSRMIS:1;
      uint64_t RFSEMIS:1;
      uint64_t WTSRMIS:1;
      uint64_t MTDMIS:1;
      uint64_t STDMIS:1;
      uint64_t reservedSpace1:2;
      uint64_t SALMIS:1;
      uint64_t MALMIS:1;
      uint64_t BERRMIS:1;
      uint64_t reservedSpace2:2;
      uint64_t MTDWSMIS:1;
      uint64_t reservedSpace3:1;
      uint64_t TIMEOUTMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TXFOVRIC:1;
      uint64_t reservedSpace1:11;
      uint64_t LBRIC:1;
      uint64_t RFSRIC:1;
      uint64_t RFSEIC:1;
      uint64_t WTSRIC:1;
      uint64_t MTDIC:1;
      uint64_t STDIC:1;
      uint64_t reservedSpace2:2;
      uint64_t SALIC:1;
      uint64_t MALIC:1;
      uint64_t BERRIC:1;
      uint64_t reservedSpace3:2;
      uint64_t MTDWSIC:1;
      uint64_t reservedSpace4:1;
      uint64_t TIMEOUTIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  uint8_t res7[16];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t THDDAT:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) THDDAT;

  uint8_t res8[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THDSTA_STD:9;
      uint64_t reservedSpace0:7;
      uint64_t THDSTA_FST:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THDSTA_FST_STD;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSUSTA_STD:9;
      uint64_t reservedSpace0:7;
      uint64_t TSUSTA_FST:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSUSTA_FST_STD;

