iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define DMA_CH6 (*(volatile struct DMA_CH6_tag *) 0xa0000080)

struct DMA_CH7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TCIE:1;
      uint64_t HTIE:1;
      uint64_t TEIE:1;
      uint64_t DIR:1;
      uint64_t CIRC:1;
      uint64_t PINC:1;
      uint64_t MINC:1;
      uint64_t PSIZE:2;
      uint64_t MSIZE:2;
      uint64_t PL:2;
      uint64_t MEM2MEM:1;
      uint64_t RESERVED1:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NDT:16;
      uint64_t RESERVED1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMAR;

};

#define DMA_CH7 (*(volatile struct DMA_CH7_tag *) 0xa0000094)

struct RNG_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DIS:1;
      uint64_t TST_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDY:1;
      uint64_t REVCLK:1;
      uint64_t FAULT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  uint32_t VAL;
};

#define RNG_1 (*(volatile struct RNG_1_tag *) 0xb0000000)

struct CM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Ignored_The_value_written_to_this_field_is_ignored:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIALLU;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICIMVAU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCIMVAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t Level_Cache_level:2;
      uint64_t reservedSpace1:1;
      uint64_t SetWay_Cache_setway:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCISW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCMVAU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCMVAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t Level_Cache_level:2;
      uint64_t reservedSpace1:1;
      uint64_t SetWay_Cache_setway:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCSW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCIMVAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t Level_Cache_level:2;
      uint64_t reservedSpace1:1;
      uint64_t SetWay_Cache_setway:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCCISW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Ignored_Ignored:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BPIALL;

};

#define CM_1 (*(volatile struct CM_1_tag *) 0xe000ef50)

struct ICB_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLINESNUM:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICTR;

  uint32_t ACTLR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUS0:1;
      uint64_t SU0:1;
      uint64_t SUS1:1;
      uint64_t SU1:1;
      uint64_t SUS2:1;
      uint64_t SU2:1;
      uint64_t SUS3:1;
      uint64_t SU3:1;
      uint64_t SUS4:1;
      uint64_t SU4:1;
      uint64_t SUS5:1;
      uint64_t SU5:1;
      uint64_t SUS6:1;
      uint64_t SU6:1;
      uint64_t SUS7:1;
      uint64_t SU7:1;
      uint64_t reservedSpace0:12;
      uint64_t SU10:1;
      uint64_t SUS10:1;
      uint64_t SU11:1;
      uint64_t SUS11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPPWR;

};

#define ICB_1 (*(volatile struct ICB_1_tag *) 0xe000e004)

struct DCB_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t C_DEBUGEN:1;
      uint64_t C_HALT:1;
      uint64_t C_STEP:1;
      uint64_t C_MASKINTS:1;
      uint64_t reservedSpace0:1;
      uint64_t C_SNAPSTALL:1;
      uint64_t reservedSpace1:10;
      uint64_t DBGKEY:15;
      uint64_t S_REGRDY:1;
      uint64_t S_HALT:1;
      uint64_t S_SLEEP:1;
      uint64_t S_LOCKUP:1;
      uint64_t S_SDE:1;
      uint64_t reservedSpace2:3;
      uint64_t S_RETIRE_ST:1;
      uint64_t S_RESET_ST:1;
      uint64_t S_RESTART_ST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DHCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGSEL:6;
      uint64_t reservedSpace0:10;
      uint64_t REGWnR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCRSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGTMP:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCRDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VC_CORERESET:1;
      uint64_t reservedSpace0:3;
      uint64_t VC_MMERR:1;
      uint64_t VC_NOCPERR:1;
      uint64_t VC_CHKERR:1;
      uint64_t VC_STATERR:1;
      uint64_t VC_BUSERR:1;
      uint64_t VC_INTERR:1;
      uint64_t VC_HARDERR:1;
      uint64_t VC_SFERR:1;
      uint64_t reservedSpace1:4;
      uint64_t MON_EN:1;
      uint64_t MON_PEND:1;
      uint64_t MON_STEP:1;
      uint64_t MON_REQ:1;
      uint64_t SDME:1;
      uint64_t reservedSpace2:3;
      uint64_t TRCENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEMCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIDENSEL:1;
      uint64_t INTSPIDEN:1;
      uint64_t SPNIDENSEL:1;
      uint64_t INTSPNIDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAUTHCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBRSELEN:1;
      uint64_t SBRSEL:1;
      uint64_t reservedSpace0:14;
      uint64_t CDS:1;
      uint64_t CDSKEY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSCSR;

