iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define CHARGER_1 (*(volatile struct CHARGER_1_tag *) 0x50040400)

struct CHIP_VERSION_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIP_ID1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIP_ID1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIP_ID2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIP_ID2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIP_ID3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIP_ID3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIP_ID4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIP_ID4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIP_SWC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIP_SWC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIP_REVISION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIP_REVISION_REG;

  uint8_t res0[224];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIP_LAYOUT_REVISION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIP_TEST1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHIP_METAL_OPTION:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHIP_TEST2_REG;

};

#define CHIP_VERSION_1 (*(volatile struct CHIP_VERSION_1_tag *) 0x50040200)

struct CMAC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMAC2SYS_IRQ_STATE:1;
      uint64_t CMAC2SYS_IRQ_CLR:1;
      uint64_t reservedSpace0:5;
      uint64_t CMAC_RST_BS_STATE:1;
      uint64_t CMAC_RST_MCPU_STATE:1;
      uint64_t MCPU_SLEEPING_STATE:1;
      uint64_t CMAC_FW_ERROR_STATE:1;
      uint64_t CMAC_BS_ERROR_STATE:1;
      uint64_t CMAC_CPU_ERROR_STATE:1;
      uint64_t CMAC_SYSMEMCTRL_ERROR_STATE:1;
      uint64_t CMAC_WDOG_EXPIRE_STATE:1;
      uint64_t CMAC_LOCKUP_STATE:1;
      uint64_t reservedSpace1:15;
      uint64_t CMAC_CONST_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM_CTRL_SYS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM_WDOG_CNT:13;
      uint64_t reservedSpace0:4;
      uint64_t CM_WDOG_WRITE_VALID:2;
      uint64_t reservedSpace1:9;
      uint64_t CM_WDOG_SYS_RST_REQ:1;
      uint64_t CM_WDOG_EXPIRE:1;
      uint64_t SYS2CMAC_WDOG_FREEZE_DIS:1;
      uint64_t SYS2CMAC_WDOG_FREEZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM_WDOG_REG;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIAG1_DCF_21:1;
      uint64_t DIAG1_DCF_22:1;
      uint64_t DIAG1_DCF_23:1;
      uint64_t DIAG1_DCF_24:1;
      uint64_t DIAG1_DCF_25:1;
      uint64_t DIAG1_DCF_26:1;
      uint64_t DIAG1_PHY_RX_EN_RFCU:1;
      uint64_t DIAG1_PHY_TX_EN_RFCU:1;
      uint64_t DIAG1_SYNC_FOUND:1;
      uint64_t DIAG1_MATCH0101:1;
      uint64_t DIAG1_SIGNAL_DETECTED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM_DIAG_IRQ1_WORD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIAG1_DCF_21:1;
      uint64_t DIAG1_DCF_22:1;
      uint64_t DIAG1_DCF_23:1;
      uint64_t DIAG1_DCF_24:1;
      uint64_t DIAG1_DCF_25:1;
      uint64_t DIAG1_DCF_26:1;
      uint64_t DIAG1_PHY_RX_EN_RFCU:1;
      uint64_t DIAG1_PHY_TX_EN_RFCU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM_DIAG_IRQ1_EDGE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIAG1_DCF_21:1;
      uint64_t DIAG1_DCF_22:1;
      uint64_t DIAG1_DCF_23:1;
      uint64_t DIAG1_DCF_24:1;
      uint64_t DIAG1_DCF_25:1;
      uint64_t DIAG1_DCF_26:1;
      uint64_t DIAG1_PHY_RX_EN_RFCU:1;
      uint64_t DIAG1_PHY_TX_EN_RFCU:1;
      uint64_t DIAG1_SYNC_FOUND:1;
      uint64_t DIAG1_MATCH0101:1;
      uint64_t DIAG1_SIGNAL_DETECTED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM_DIAG_IRQ1_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIAG1_DCF_21:1;
      uint64_t DIAG1_DCF_22:1;
      uint64_t DIAG1_DCF_23:1;
      uint64_t DIAG1_DCF_24:1;
      uint64_t DIAG1_DCF_25:1;
      uint64_t DIAG1_DCF_26:1;
      uint64_t DIAG1_PHY_RX_EN_RFCU:1;
      uint64_t DIAG1_PHY_TX_EN_RFCU:1;
      uint64_t DIAG1_SYNC_FOUND:1;
      uint64_t DIAG1_MATCH0101:1;
      uint64_t DIAG1_SIGNAL_DETECTED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM_DIAG_IRQ1_MASK_REG;

};

#define CMAC_1 (*(volatile struct CMAC_1_tag *) 0x40002000)

struct CMAC_TIMER_SLP_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLP_TIMER_SW:1;
      uint64_t reservedSpace0:4;
      uint64_t SLP_TIMER_CNT_SIGN:1;
      uint64_t LP_CLK_STATE:1;
      uint64_t SLP_TIMER_ACTIVE:1;
      uint64_t TCLK_FROM_PCLK:1;
      uint64_t TCLK_FROM_LPCLK:1;
      uint64_t reservedSpace1:14;
      uint64_t CMAC_WAKEUP_ON_SWD_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM_SLP_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLP_TIMER_IRQ_STATE:1;
      uint64_t SLP_TIMER_IRQ_CLR:1;
      uint64_t SLP_TIMER_IRQ_SET:1;
      uint64_t reservedSpace0:2;
      uint64_t SLP_TIMER_CNT_SIGN:1;
      uint64_t LP_CLK_STATE:1;
      uint64_t SLP_TIMER_ACTIVE:1;
      uint64_t CMAC_WAKEUP_ON_SWD_STATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM_SLP_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM_SLP_TIMER_VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM_SLP_TIMER_REG;

};

#define CMAC_TIMER_SLP_1 (*(volatile struct CMAC_TIMER_SLP_1_tag *) 0x50010400)

struct CRG_COM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_ENABLE:1;
      uint64_t UART2_ENABLE:1;
      uint64_t UART2_CLK_SEL:1;
      uint64_t UART3_ENABLE:1;
      uint64_t UART3_CLK_SEL:1;
      uint64_t SPI_ENABLE:1;
      uint64_t SPI_CLK_SEL:1;
      uint64_t SPI2_ENABLE:1;
      uint64_t SPI2_CLK_SEL:1;
      uint64_t I2C_ENABLE:1;
      uint64_t I2C_CLK_SEL:1;
      uint64_t I2C2_ENABLE:1;
      uint64_t I2C2_CLK_SEL:1;
      uint64_t SDADC_CLK_SEL:1;
      uint64_t SNC_DIV:2;
      uint64_t LCD_EXT_CLK_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_COM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_ENABLE:1;
      uint64_t UART2_ENABLE:1;
      uint64_t UART2_CLK_SEL:1;
      uint64_t UART3_ENABLE:1;
      uint64_t UART3_CLK_SEL:1;
      uint64_t SPI_ENABLE:1;
      uint64_t SPI_CLK_SEL:1;
      uint64_t SPI2_ENABLE:1;
      uint64_t SPI2_CLK_SEL:1;
      uint64_t I2C_ENABLE:1;
      uint64_t I2C_CLK_SEL:1;
      uint64_t I2C2_ENABLE:1;
      uint64_t I2C2_CLK_SEL:1;
      uint64_t SDADC_CLK_SEL:1;
      uint64_t SNC_DIV:2;
      uint64_t LCD_EXT_CLK_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_CLK_COM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_ENABLE:1;
      uint64_t UART2_ENABLE:1;
      uint64_t UART2_CLK_SEL:1;
      uint64_t UART3_ENABLE:1;
      uint64_t UART3_CLK_SEL:1;
      uint64_t SPI_ENABLE:1;
      uint64_t SPI_CLK_SEL:1;
      uint64_t SPI2_ENABLE:1;
      uint64_t SPI2_CLK_SEL:1;
      uint64_t I2C_ENABLE:1;
      uint64_t I2C_CLK_SEL:1;
      uint64_t I2C2_ENABLE:1;
      uint64_t I2C2_CLK_SEL:1;
      uint64_t SDADC_CLK_SEL:1;
      uint64_t SNC_DIV:2;
      uint64_t LCD_EXT_CLK_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_CLK_COM_REG;

