iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define CRG_COM_1 (*(volatile struct CRG_COM_1_tag *) 0x50020904)

struct CRG_PER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADC_CLK_SEL:1;
      uint64_t LRA_CLK_EN:1;
      uint64_t MC_CLK_EN:1;
      uint64_t MC_CLK_DIV:5;
      uint64_t MC_TRIG_DIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_PER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADC_CLK_SEL:1;
      uint64_t LRA_CLK_EN:1;
      uint64_t MC_CLK_EN:1;
      uint64_t MC_CLK_DIV:5;
      uint64_t MC_TRIG_DIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SET_CLK_PER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPADC_CLK_SEL:1;
      uint64_t LRA_CLK_EN:1;
      uint64_t MC_CLK_EN:1;
      uint64_t MC_CLK_DIV:5;
      uint64_t MC_TRIG_DIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_CLK_PER_REG;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_DIV:12;
      uint64_t CLK_PCM_EN:1;
      uint64_t PCM_SRC_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM_DIV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_FDIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM_FDIV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDM_DIV:8;
      uint64_t CLK_PDM_EN:1;
      uint64_t PDM_MASTER_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDM_DIV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_DIV:8;
      uint64_t CLK_SRC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC_DIV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MC_RAM_MS:4;
      uint64_t MC_RAM_MSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERRAM_CONFIG_REG;

};

#define CRG_PER_1 (*(volatile struct CRG_PER_1_tag *) 0x50030c04)

struct CRG_SYS_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCD_ENABLE:1;
      uint64_t LCD_CLK_SEL:1;
      uint64_t reservedSpace0:2;
      uint64_t LCD_RESET_REQ:1;
      uint64_t CLK_CHG_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_SYS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BATCHECK_TRIM:4;
      uint64_t BATCHECK_ILOAD:3;
      uint64_t BATCHECK_LOAD_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BATCHECK_REG;

  uint8_t res0[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M31RAM_MS:4;
      uint64_t M31RAM_MSE:1;
      uint64_t CACHERAM_DST:1;
      uint64_t CACHERAM_MARGIN:2;
      uint64_t CACHERAM_LPMX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSRAM_CONFIG_REG;

};

#define CRG_SYS_1 (*(volatile struct CRG_SYS_1_tag *) 0x50040500)

struct CRG_TOP_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCLK_DIV:3;
      uint64_t reservedSpace0:1;
      uint64_t PCLK_DIV:2;
      uint64_t AES_CLK_ENABLE:1;
      uint64_t reservedSpace1:1;
      uint64_t TRNG_CLK_ENABLE:1;
      uint64_t OTP_ENABLE:1;
      uint64_t QSPI_DIV:2;
      uint64_t QSPI_ENABLE:1;
      uint64_t QSPI2_DIV:2;
      uint64_t QSPI2_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_AMBA_REG;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMAC_DIV:2;
      uint64_t CMAC_CLK_ENABLE:1;
      uint64_t CMAC_CLK_SEL:1;
      uint64_t CMAC_SYNCH_RESET:1;
      uint64_t RFCU_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_RADIO_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYS_CLK_SEL:2;
      uint64_t LP_CLK_SEL:2;
      uint64_t USB_CLK_SRC:1;
      uint64_t reservedSpace0:1;
      uint64_t CLK_WDOG_ENABLE:1;
      uint64_t reservedSpace1:5;
      uint64_t RUNNING_AT_LP_CLK:1;
      uint64_t RUNNING_AT_RC32M:1;
      uint64_t RUNNING_AT_XTAL32M:1;
      uint64_t RUNNING_AT_PLL96M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUPCT_ENABLE:1;
      uint64_t TMR_PWM_AON_MODE:1;
      uint64_t TMR2_PWM_AON_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_TMR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWITCH2XTAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_SWITCH2XTAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIPH_SLEEP:1;
      uint64_t RADIO_SLEEP:1;
      uint64_t TIM_SLEEP:1;
      uint64_t COM_SLEEP:1;
      uint64_t MAP_BANDGAP_EN:1;
      uint64_t RESET_ON_WAKEUP:1;
      uint64_t SYS_SLEEP:1;
      uint64_t RETAIN_CACHE:1;
      uint64_t ENABLE_CLKLESS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMU_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REMAP_ADR0:3;
      uint64_t REMAP_INTVECT:1;
      uint64_t QSPI_INIT:1;
      uint64_t reservedSpace0:1;
      uint64_t CMAC_DEBUGGER_ENABLE:1;
      uint64_t DEBUGGER_ENABLE:1;
      uint64_t DRA_OFF:1;
      uint64_t TIMEOUT_DISABLE:1;
      uint64_t CACHERAM_MUX:1;
      uint64_t reservedSpace1:4;
      uint64_t SW_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAD_IS_DOWN:1;
      uint64_t RAD_IS_UP:1;
      uint64_t PER_IS_DOWN:1;
      uint64_t PER_IS_UP:1;
      uint64_t SYS_IS_DOWN:1;
      uint64_t SYS_IS_UP:1;
      uint64_t MEM_IS_DOWN:1;
      uint64_t MEM_IS_UP:1;
      uint64_t TIM_IS_DOWN:1;
      uint64_t TIM_IS_UP:1;
      uint64_t COM_IS_DOWN:1;
      uint64_t COM_IS_UP:1;
      uint64_t DBG_IS_ACTIVE:1;
      uint64_t POWER_IS_UP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYS_STAT_REG;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RC32K_ENABLE:1;
      uint64_t RC32K_TRIM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_RC32K_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32K_ENABLE:1;
      uint64_t XTAL32K_RBIAS:2;
      uint64_t XTAL32K_CUR:4;
      uint64_t XTAL32K_DISABLE_AMPREG:1;
      uint64_t XTAL32K_XTAL1_BIAS_DISABLE:1;
      uint64_t XTAL32K_DISABLE_OUTPUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_XTAL32K_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RC32M_ENABLE:1;
      uint64_t RC32M_BIAS:4;
      uint64_t RC32M_INIT_DTC:4;
      uint64_t RC32M_INIT_DTCF:3;
      uint64_t RC32M_INIT_DEL:8;
      uint64_t RC32M_INIT_RANGE:2;
      uint64_t reservedSpace0:3;
      uint64_t RC32M_STARTUP_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_RC32M_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCX_ENABLE:1;
      uint64_t RCX_RADJUST:1;
      uint64_t RCX_CADJUST:5;
      uint64_t RCX_C0:1;
      uint64_t RCX_BIAS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_RCX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_DIV_FRAC:10;
      uint64_t RTC_DIV_INT:9;
      uint64_t RTC_DIV_DENOM:1;
      uint64_t RTC_DIV_ENABLE:1;
      uint64_t RTC_RESET_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_RTCDIV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BGR_TRIM:6;
      uint64_t BGR_ITRIM:6;
      uint64_t BANDGAP_ENABLE_CLAMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BANDGAP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUS_IRQ_EN_FALL:1;
      uint64_t VBUS_IRQ_EN_RISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VBUS_IRQ_MASK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VBUS_IRQ_CLEAR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VBUS_IRQ_CLEAR_REG;

