iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOD_CLK_DIV:2;
      uint64_t BOD_STATUS_CLEAR:1;
      uint64_t BOD_VBAT_EN:1;
      uint64_t BOD_V30_EN:1;
      uint64_t BOD_V18_EN:1;
      uint64_t BOD_V18P_EN:1;
      uint64_t BOD_VDD_EN:1;
      uint64_t BOD_V18F_EN:1;
      uint64_t BOD_V14_EN:1;
      uint64_t BOD_VBAT_RST_EN:1;
      uint64_t BOD_V30_RST_EN:1;
      uint64_t BOD_V18_RST_EN:1;
      uint64_t BOD_V18P_RST_EN:1;
      uint64_t BOD_VDD_RST_EN:1;
      uint64_t BOD_V18F_RST_EN:1;
      uint64_t BOD_V14_RST_EN:1;
      uint64_t BOD_TEST_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOD_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOD_LVL_VBAT:9;
      uint64_t BOD_LVL_V30:9;
      uint64_t BOD_LVL_V18:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOD_LVL_CTRL0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOD_LVL_V18P:9;
      uint64_t BOD_LVL_VDD_ON:8;
      uint64_t BOD_LVL_VDD_RET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOD_LVL_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOD_LVL_V18F:9;
      uint64_t BOD_LVL_V14:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOD_LVL_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_LATCH_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PAD_LATCH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_SET_LATCH_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_SET_PAD_LATCH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_RESET_LATCH_EN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RESET_PAD_LATCH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P1_LATCH_EN:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_PAD_LATCH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P1_SET_LATCH_EN:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_SET_PAD_LATCH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P1_RESET_LATCH_EN:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_RESET_PAD_LATCH_REG;

  uint8_t res3[8];

  uint32_t BOD_STATUS_REG;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_VBAT_THRES_LOW:4;
      uint64_t POR_VBAT_THRES_HIGH:4;
      uint64_t POR_VBAT_HYST_LOW:4;
      uint64_t POR_VBAT_ENABLE:1;
      uint64_t POR_VBAT_MASK_N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POR_VBAT_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_PIN_SELECT:6;
      uint64_t reservedSpace0:1;
      uint64_t POR_PIN_POLARITY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POR_PIN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_TIME:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POR_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDO_VDDD_HIGH_VREF_HOLD:1;
      uint64_t LDO_VDDD_HIGH_ENABLE:1;
      uint64_t LDO_VDDD_HIGH_STATIC_LOAD_ENABLE:1;
      uint64_t LDO_VDDD_HIGH_LOW_ZOUT_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDO_VDDD_HIGH_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIAS_VREF_RF1_SEL:4;
      uint64_t BIAS_VREF_RF2_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIAS_VREF_SEL_REG;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISABLE_LCD:1;
      uint64_t DISABLE_CHARGER:1;
      uint64_t DISABLE_GPADC:1;
      uint64_t DISABLE_SDADC:1;
      uint64_t DISABLE_UART3:1;
      uint64_t DISABLE_USB:1;
      uint64_t DISABLE_APU:1;
      uint64_t DISABLE_LRA:1;
      uint64_t DISABLE_PWM:1;
      uint64_t DISABLE_QSPIRAM:1;
      uint64_t DISABLE_MOTORC:1;
      uint64_t REDUCE_RAM_SIZE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_CONFIG_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORESET_STAT:1;
      uint64_t HWRESET_STAT:1;
      uint64_t SWRESET_STAT:1;
      uint64_t WDOGRESET_STAT:1;
      uint64_t SWD_HWRESET_STAT:1;
      uint64_t CMAC_WDOGRESET_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM1_PWR_CTRL:2;
      uint64_t RAM2_PWR_CTRL:2;
      uint64_t RAM3_PWR_CTRL:2;
      uint64_t RAM4_PWR_CTRL:2;
      uint64_t RAM5_PWR_CTRL:2;
      uint64_t RAM6_PWR_CTRL:2;
      uint64_t RAM7_PWR_CTRL:2;
      uint64_t RAM8_PWR_CTRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM_PWR_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDOS_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDOS_DISABLE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_TST_DET_DISABLE:1;
      uint64_t KEEP_VDDNOTSLEEP_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AON_SPARE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECURE_BOOT:1;
      uint64_t FORCE_DEBUGGER_OFF:1;
      uint64_t FORCE_CMAC_DEBUGGER_OFF:1;
      uint64_t PROT_SIG_KEY_WRITE:1;
      uint64_t PROT_AES_KEY_WRITE:1;
      uint64_t PROT_AES_KEY_READ:1;
      uint64_t PROT_QSPI_KEY_WRITE:1;
      uint64_t PROT_QSPI_KEY_READ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECURE_BOOT_REG;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET_V14:1;
      uint64_t RESET_V18:1;
      uint64_t RESET_V18P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DISCHARGE_RAIL_REG;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOD_VIN_NOK:1;
      uint64_t LDO_VDD_HIGH_OK:1;
      uint64_t LDO_CORE_OK:1;
      uint64_t LDO_RADIO_OK:1;
      uint64_t LDO_1V8_OK:1;
      uint64_t LDO_1V8P_OK:1;
      uint64_t LDO_3V0_VBUS_OK:1;
      uint64_t LDO_3V0_VBAT_OK:1;
      uint64_t BANDGAP_OK:1;
      uint64_t VBUS_AVAILABLE:1;
      uint64_t COMP_VDD_OK:1;
      uint64_t COMP_VBAT_LOW:1;
      uint64_t COMP_VBAT_HIGH:1;
      uint64_t COMP_VBUS_LOW:1;
      uint64_t COMP_VBUS_HIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDO_1V8P_ENABLE:1;
      uint64_t LDO_1V8P_RET_ENABLE_ACTIVE:1;
      uint64_t LDO_1V8P_RET_ENABLE_SLEEP:1;
      uint64_t SW_1V8F_ENABLE_FORCE:1;
      uint64_t LDO_1V8_ENABLE:1;
      uint64_t LDO_1V8_RET_ENABLE_ACTIVE:1;
      uint64_t LDO_1V8_RET_ENABLE_SLEEP:1;
      uint64_t LDO_RADIO_ENABLE:1;
      uint64_t LDO_3V0_MODE:2;
      uint64_t LDO_3V0_RET_ENABLE_ACTIVE:1;
      uint64_t LDO_3V0_RET_ENABLE_SLEEP:1;
      uint64_t LDO_CORE_ENABLE:1;
      uint64_t LDO_CORE_RET_ENABLE_ACTIVE:1;
      uint64_t LDO_CORE_RET_ENABLE_SLEEP:1;
      uint64_t LDO_3V0_REF:1;
      uint64_t VDD_LEVEL:2;
      uint64_t V30_LEVEL:2;
      uint64_t V14_LEVEL:3;
      uint64_t V18_LEVEL:1;
      uint64_t CLAMP_3V0_VBAT_ENABLE:1;
      uint64_t VDD_CLAMP_LEVEL:4;
      uint64_t VDD_SLEEP_LEVEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) POWER_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BG_REFRESH_INTERVAL:12;
      uint64_t BOD_SLEEP_INTERVAL:4;
      uint64_t FAST_WAKEUP:1;
      uint64_t ULTRA_FAST_WAKEUP:1;
      uint64_t CLAMP_VDD_WKUP_MAX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMU_SLEEP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDO_SUPPLY_VBUS_TRIM:4;
      uint64_t LDO_SUPPLY_VBAT_TRIM:4;
      uint64_t LDO_1V8P_TRIM:4;
      uint64_t LDO_1V8_TRIM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMU_TRIM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUP_LDO_3V0_TIMEOUT:1;
      uint64_t WUP_LDO_1V8P_TIMEOUT:1;
      uint64_t WUP_LDO_1V8_TIMEOUT:1;
      uint64_t WUP_RAILS_OK_TIMEOUT:1;
      uint64_t WUP_LDO_3V0_VBAT_OK:1;
      uint64_t WUP_LDO_3V0_VBUS_OK:1;
      uint64_t WUP_LDO_1V8P_OK:1;
      uint64_t WUP_LDO_1V8_OK:1;
      uint64_t WUP_LDO_CORE_OK:1;
      uint64_t WUP_VBUS_AVAILABLE:1;
      uint64_t WUP_COMP_VBUS_LOW:1;
      uint64_t WUP_COMP_VBUS_HIGH:1;
      uint64_t WUP_COMP_VBAT_OK:1;
      uint64_t WUP_COMP_VDD_OK:1;
      uint64_t WUP_BANDGAP_OK:1;
      uint64_t WUP_LDO_RADIO_OK:1;
      uint64_t WUP_FAIL_STATE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTUP_STATUS_REG;

