iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define CRG_TOP_1 (*(volatile struct CRG_TOP_1_tag *) 0x50000000)

struct CRG_XTAL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32M_TRIM:10;
      uint64_t XTAL32M_RAMP:10;
      uint64_t XTAL32M_START:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_FREQ_TRIM_REG;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32M_TRSTAT:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTAL32M_TRSTAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL_COUNT_N:6;
      uint64_t XTAL_TRIM_SELECT:2;
      uint64_t XTAL_SETTLE_N:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIM_CTRL_REG;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTALRDY_CNT:8;
      uint64_t XTALRDY_CLK_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTALRDY_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTALRDY_STAT:8;
      uint64_t XTALRDY_COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTALRDY_STAT_REG;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32M_CXCOMP_ENABLE:1;
      uint64_t XTAL32M_RCOSC_XTAL_DRIVE:1;
      uint64_t XTAL32M_DXTAL_ENABLE:1;
      uint64_t XTAL32M_RCOSC_CALIBRATE:1;
      uint64_t XTAL32M_DCBLOCK_ENABLE:1;
      uint64_t XTAL32M_LDO_VREF_HOLD:1;
      uint64_t XTAL32M_BIAS_SAH_HOLD:1;
      uint64_t XTAL32M_BIAS_SAH_RADIO_GATE:1;
      uint64_t XTAL32M_DIFFBUF_BYPASS:1;
      uint64_t XTAL32M_HOLD_AMPREG_RADIO_GATE:1;
      uint64_t XTAL32M_RFCLK_ENABLE:1;
      uint64_t XTAL32M_SPIKE_FLT_DISABLE:1;
      uint64_t XTAL32M_CORE_HOLD_AMPREG:1;
      uint64_t XTAL32M_RCOSC_SYNC_MODE_ENABLE:1;
      uint64_t XTAL32M_CORE_GM_CURRENT:1;
      uint64_t XTAL32M_CORE_CUR_SET:3;
      uint64_t XTAL32M_CORE_AMPL_TRIM:3;
      uint64_t XTAL32M_CORE_AMPL_CTRL_DISABLE:1;
      uint64_t XTAL32M_CORE_FREQ_TRIM_SW2_AMP:3;
      uint64_t XTAL32M_CORE_AMPREG_SIG_SELECT:1;
      uint64_t XTAL32M_SW_DELAY:3;
      uint64_t XTAL32M_CORE_MAX_CURRENT:1;
      uint64_t XTAL32M_DXTAL_SYSPLL_ENABLE:1;
      uint64_t XTAL32M_VARICAP_CX_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTAL32M_CTRL0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32M_RCOSC_SYNC_DELAY_TRIM:5;
      uint64_t XTAL32M_STARTUP_TDRIVE:3;
      uint64_t XTAL32M_DRIVE_CYCLES:5;
      uint64_t XTAL32M_STARTUP_TDRIVE_LSB:10;
      uint64_t XTAL32M_XTAL_ENABLE:1;
      uint64_t XTAL32M_STARTUP_TSETTLE:3;
      uint64_t XTAL32M_CORE_XTAL_DISCHARGE:1;
      uint64_t XTAL32M_STARTUP_TDISCHARGE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTAL32M_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32M_CXCOMP_BIAS_TRIM:3;
      uint64_t XTAL32M_CXCOMP_TRIM_CAP:9;
      uint64_t XTAL32M_CXCOMP_PHI_TRIM:2;
      uint64_t XTAL32M_RCOSC_TRIM_SNS:8;
      uint64_t XTAL32M_FREQ_DET_LEN:2;
      uint64_t XTAL32M_FREQ_DET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTAL32M_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32M_CORE_AMPREG_SIG_ENABLE:1;
      uint64_t XTAL32M_CORE_SAMPLE_AMPL_CTRL:1;
      uint64_t XTAL32M_CORE_FB_ENABLE:1;
      uint64_t XTAL32M_CORE_AMPREG_NULLBIAS:1;
      uint64_t XTAL32M_RCOSC_TRIM:10;
      uint64_t XTAL32M_RCOSC_BAND_SELECT:4;
      uint64_t XTAL32M_SW_CTRL_MODE:1;
      uint64_t XTAL32M_RCOSC_SYNC_GATE:1;
      uint64_t XTAL32M_RCOSC_SYNC_FORCE:1;
      uint64_t XTAL32M_RCOSC_ENABLE:1;
      uint64_t XTAL32M_FREQ_DET_START:1;
      uint64_t XTAL32M_OSC_TRIM_OPEN_DISABLE:1;
      uint64_t XTAL32M_CORE_I2V_TO_TESTBUS:1;
      uint64_t XTAL32M_CORE_I2V_TO_TESTBUS_10X:1;
      uint64_t XTAL32M_RCOSC2DXTAL:1;
      uint64_t XTAL32M_DCBLOCK_LV_MODE:1;
      uint64_t XTAL32M_SW1_OUT:1;
      uint64_t XTAL32M_OSC_TRIM_CAP_BIAS:1;
      uint64_t XTAL32M_RCOSC_TRIM_STROBE:1;
      uint64_t XTAL32M_LDO_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTAL32M_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32M_SYNC_DELAY_TEST:1;
      uint64_t XTAL32M_LDO_TEST:1;
      uint64_t XTAL32M_CXCOMP_TEST:1;
      uint64_t XTAL32M_VARICAP_TEST_ENABLE:1;
      uint64_t XTAL32M_SW2_MASK:1;
      uint64_t XTAL32M_CXCOMP_TEST_CTRL:4;
      uint64_t XTAL32M_CXCOMP_TEST_N_TO_TB:1;
      uint64_t XTAL32M_CXCOMP_TEST_P_TO_TB:1;
      uint64_t XTAL32M_RFCLK_ADC_TO_GPIO:1;
      uint64_t XTAL32M_RFCLK_ADPLL_TO_GPIO:1;
      uint64_t XTAL32M_LDO_VREF_SELECT:1;
      uint64_t XTAL32M_RST_N_XTAL:1;
      uint64_t XTAL32M_CXCOMP_ENABLE_GATE:1;
      uint64_t XTAL32M_AMPDET_BLANK:1;
      uint64_t XTAL32M_TAMPDET_BLANK:2;
      uint64_t XTAL32M_TAMPDET_BLANK_SETTLE:2;
      uint64_t XTAL32M_SYNC_DELAY_TEST_INT:1;
      uint64_t XTAL32M_CORE_CUR_NTAT_DIS:1;
      uint64_t XTAL32M_CORE_CUR_PTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTAL32M_CTRL4_REG;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32M_FREQ_DET_OUT:14;
      uint64_t XTAL32M_FREQ_DET_END:1;
      uint64_t XTAL32M_RCOSC_CALIBRATION_DONE:1;
      uint64_t XTAL32M_SW2_IN:1;
      uint64_t XTAL32M_LDO_OK:1;
      uint64_t XTAL32M_RCOSC_TRIM_STAT:10;
      uint64_t XTAL32M_RCOSC_BAND_SELECT_STAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTAL32M_STAT0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XTAL32M_STATE:4;
      uint64_t XTAL32M_CAL_STATE:4;
      uint64_t XTAL32M_SW2_OUT:1;
      uint64_t XTAL32M_SETTLE_READY:1;
      uint64_t XTAL32M_TRIM_READY:1;
      uint64_t XTAL32M_SM_TIMER:12;
      uint64_t XTAL32M_RCOSC_XTAL_DRIVE_STAT:1;
      uint64_t XTAL32M_RCOSC_SYNC_GATE_STAT:1;
      uint64_t XTAL32M_RCOSC_SYNC_FORCE_STAT:1;
      uint64_t XTAL32M_XTAL_OVERLOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XTAL32M_STAT1_REG;

