iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PLL_EN:1;
      uint64_t LDO_PLL_ENABLE:1;
      uint64_t LDO_PLL_VREF_HOLD:1;
      uint64_t PLL_N_DIV:7;
      uint64_t PLL_PRE_DIV:1;
      uint64_t PLL_DEL_SEL:2;
      uint64_t PLL_SEL_MIN_CUR_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_SYS_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL_ICP_SEL:5;
      uint64_t reservedSpace0:5;
      uint64_t PLL_START_DEL:5;
      uint64_t PLL_RECALIB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_SYS_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL_DIS_LOOPFILT:1;
      uint64_t PLL_MIN_CURRENT:6;
      uint64_t PLL_TEST_VCTR:1;
      uint64_t PLL_OPEN_LOOP:1;
      uint64_t PLL_CHANGE:1;
      uint64_t PLL_SEL_N_DIV_TEST:1;
      uint64_t reservedSpace0:2;
      uint64_t PLL_LOCK_DET_RES_CNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_SYS_CTRL3_REG;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL_LOCK_FINE:1;
      uint64_t reservedSpace0:4;
      uint64_t PLL_BEST_MIN_CUR:6;
      uint64_t PLL_CALIBRATION_END:1;
      uint64_t reservedSpace1:3;
      uint64_t LDO_PLL_OK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL_SYS_STATUS_REG;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL96M_ENABLE:1;
      uint64_t reservedSpace0:3;
      uint64_t PLL96M_DELTA_SEARCH:2;
      uint64_t PLL96M_DELTA_SEARCH_MODE:1;
      uint64_t PLL96M_PANIC_EN:1;
      uint64_t PLL96M_DELTA_COUNT:2;
      uint64_t PLL96M_OUTPUT_STREAMING:1;
      uint64_t PLL96M_SAVE_POWER:1;
      uint64_t PLL96M_SKIP_LIMIT_SEARCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL96M_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL96M_EXTERN_CMD:1;
      uint64_t PLL96M_INIT_DUTYCYCLE:6;
      uint64_t PLL96M_INIT_DELAY:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL96M_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL96M_PHD_CD1:4;
      uint64_t PLL96M_PHD_CD2:4;
      uint64_t PLL96M_BIAS:4;
      uint64_t PLL96M_CDEL1:2;
      uint64_t reservedSpace0:1;
      uint64_t PLL96M_TST_CLK_INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL96M_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL96M_DELTA_DELAY:8;
      uint64_t PLL96M_EFF_DELAY:9;
      uint64_t PLL96M_TRIGGER:1;
      uint64_t PLL96M_FINE_CNT:6;
      uint64_t PLL96M_ERROR_HISAT:1;
      uint64_t PLL96M_ERROR_LOSAT:1;
      uint64_t PLL96M_OK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL96M_STATUS1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL96M_PHD_OUT:5;
      uint64_t PLL96M_CNT96:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLL96M_STATUS2_REG;

};

#define CRG_XTAL_1 (*(volatile struct CRG_XTAL_1_tag *) 0x50010000)

struct DCDC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_ENABLE:1;
      uint64_t DCDC_FW_ENABLE:1;
      uint64_t DCDC_PRIORITY:8;
      uint64_t DCDC_IDLE_CLK_DIV:2;
      uint64_t DCDC_AUTO_LV_MODE:1;
      uint64_t DCDC_MAN_LV_MODE:1;
      uint64_t DCDC_FAST_STARTUP:1;
      uint64_t DCDC_SW_TIMEOUT:5;
      uint64_t DCDC_IDLE_MAX_FAST_DOWNRAMP:6;
      uint64_t DCDC_STARTUP_DELAY:5;
      uint64_t DCDC_SH_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_HSGND_TRIM:2;
      uint64_t DCDC_LSSUP_TRIM:2;
      uint64_t DCDC_VBTSTRP_TRIM:2;
      uint64_t DCDC_SLOPE_CONTROL:2;
      uint64_t DCDC_TIMEOUT_IRQ_RES:4;
      uint64_t DCDC_TIMEOUT_IRQ_TRIG:4;
      uint64_t DCDC_N_COMP_TRIM_VAL:6;
      uint64_t DCDC_N_COMP_TRIM_MAN:1;
      uint64_t reservedSpace0:1;
      uint64_t DCDC_V_NOK_CNT_MAX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_V14_ENABLE_LV:1;
      uint64_t DCDC_V14_ENABLE_HV:1;
      uint64_t DCDC_V14_IDLE_MIN:5;
      uint64_t DCDC_V14_IDLE_HYST:5;
      uint64_t DCDC_V14_CUR_LIM_MIN:5;
      uint64_t DCDC_V14_CUR_LIM_MAX_LV:5;
      uint64_t DCDC_V14_CUR_LIM_MAX_HV:5;
      uint64_t DCDC_V14_TRIM:1;
      uint64_t reservedSpace0:3;
      uint64_t DCDC_V14_FAST_RAMPING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_V14_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_VDD_ENABLE_LV:1;
      uint64_t DCDC_VDD_ENABLE_HV:1;
      uint64_t DCDC_VDD_IDLE_MIN:5;
      uint64_t DCDC_VDD_IDLE_HYST:5;
      uint64_t DCDC_VDD_CUR_LIM_MIN:5;
      uint64_t DCDC_VDD_CUR_LIM_MAX_LV:5;
      uint64_t DCDC_VDD_CUR_LIM_MAX_HV:5;
      uint64_t DCDC_VDD_TRIM:3;
      uint64_t reservedSpace0:1;
      uint64_t DCDC_VDD_FAST_RAMPING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_VDD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_V18_ENABLE_LV:1;
      uint64_t DCDC_V18_ENABLE_HV:1;
      uint64_t DCDC_V18_IDLE_MIN:5;
      uint64_t DCDC_V18_IDLE_HYST:5;
      uint64_t DCDC_V18_CUR_LIM_MIN:5;
      uint64_t DCDC_V18_CUR_LIM_MAX_LV:5;
      uint64_t DCDC_V18_CUR_LIM_MAX_HV:5;
      uint64_t DCDC_V18_TRIM:4;
      uint64_t DCDC_V18_FAST_RAMPING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_V18_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_V18P_ENABLE_LV:1;
      uint64_t DCDC_V18P_ENABLE_HV:1;
      uint64_t DCDC_V18P_IDLE_MIN:5;
      uint64_t DCDC_V18P_IDLE_HYST:5;
      uint64_t DCDC_V18P_CUR_LIM_MIN:5;
      uint64_t DCDC_V18P_CUR_LIM_MAX_LV:5;
      uint64_t DCDC_V18P_CUR_LIM_MAX_HV:5;
      uint64_t DCDC_V18P_TRIM:4;
      uint64_t DCDC_V18P_FAST_RAMPING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_V18P_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_FORCE_P_SW:1;
      uint64_t DCDC_FORCE_N_SW:1;
      uint64_t DCDC_FORCE_FW_SW:1;
      uint64_t DCDC_FORCE_V14_SW:1;
      uint64_t DCDC_FORCE_V18_SW:1;
      uint64_t DCDC_FORCE_VDD_SW:1;
      uint64_t DCDC_FORCE_V18P_SW:1;
      uint64_t DCDC_FORCE_IDLE:1;
      uint64_t DCDC_ANA_TEST:3;
      uint64_t DCDC_OUTPUT_MON:3;
      uint64_t DCDC_FORCE_COMP_CLK:1;
      uint64_t DCDC_FORCE_CUR_LIM:1;
      uint64_t DCDC_FORCE_COMP_CLK_VAL:4;
      uint64_t DCDC_FORCE_CUR_LIM_VAL:5;
      uint64_t DCDC_TEST_OUT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_TEST_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_STARTUP_COMPLETE:1;
      uint64_t DCDC_P_SW_STATE:1;
      uint64_t DCDC_N_SW_STATE:1;
      uint64_t DCDC_V14_SW_STATE:1;
      uint64_t DCDC_V18_SW_STATE:1;
      uint64_t DCDC_VDD_SW_STATE:1;
      uint64_t DCDC_V18P_SW_STATE:1;
      uint64_t DCDC_LV_MODE:1;
      uint64_t DCDC_N_COMP:1;
      uint64_t DCDC_P_COMP:1;
      uint64_t DCDC_N_COMP_N:1;
      uint64_t DCDC_N_COMP_P:1;
      uint64_t reservedSpace0:4;
      uint64_t DCDC_V14_COMP_NOK:1;
      uint64_t DCDC_V18_COMP_NOK:1;
      uint64_t DCDC_VDD_COMP_NOK:1;
      uint64_t DCDC_V18P_COMP_NOK:1;
      uint64_t DCDC_V14_COMP_OK:1;
      uint64_t DCDC_V18_COMP_OK:1;
      uint64_t DCDC_VDD_COMP_OK:1;
      uint64_t DCDC_V18P_COMP_OK:1;
      uint64_t DCDC_V14_AVAILABLE:1;
      uint64_t DCDC_V18_AVAILABLE:1;
      uint64_t DCDC_VDD_AVAILABLE:1;
      uint64_t DCDC_V18P_AVAILABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_STATUS1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_V14_CUR_LIM:5;
      uint64_t DCDC_VDD_CUR_LIM:5;
      uint64_t reservedSpace0:6;
      uint64_t DCDC_V18_CUR_LIM:5;
      uint64_t DCDC_V18P_CUR_LIM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_STATUS2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_V14_N_COMP_TRIM:6;
      uint64_t DCDC_VDD_N_COMP_TRIM:6;
      uint64_t reservedSpace0:4;
      uint64_t DCDC_V18_N_COMP_TRIM:6;
      uint64_t DCDC_V18P_N_COMP_TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_STATUS3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_CHARGE_REG_0:3;
      uint64_t DCDC_CHARGE_REG_1:3;
      uint64_t DCDC_CHARGE_REG_2:3;
      uint64_t DCDC_CHARGE_REG_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_STATUS4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_V14_TIMEOUT_IRQ_STATUS:1;
      uint64_t DCDC_V18_TIMEOUT_IRQ_STATUS:1;
      uint64_t DCDC_VDD_TIMEOUT_IRQ_STATUS:1;
      uint64_t DCDC_V18P_TIMEOUT_IRQ_STATUS:1;
      uint64_t DCDC_LOW_VBAT_IRQ_STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_IRQ_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_V14_TIMEOUT_IRQ_CLEAR:1;
      uint64_t DCDC_V18_TIMEOUT_IRQ_CLEAR:1;
      uint64_t DCDC_VDD_TIMEOUT_IRQ_CLEAR:1;
      uint64_t DCDC_V18P_TIMEOUT_IRQ_CLEAR:1;
      uint64_t DCDC_LOW_VBAT_IRQ_CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_IRQ_CLEAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_V14_TIMEOUT_IRQ_MASK:1;
      uint64_t DCDC_V18_TIMEOUT_IRQ_MASK:1;
      uint64_t DCDC_VDD_TIMEOUT_IRQ_MASK:1;
      uint64_t DCDC_V18P_TIMEOUT_IRQ_MASK:1;
      uint64_t DCDC_LOW_VBAT_IRQ_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCDC_IRQ_MASK_REG;

