iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define DMA_2 (*(volatile struct DMA_2_tag *) 0x50040800)

struct DW_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_PL1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_PL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_PL2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_PL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_PL3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_PL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_PL4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_PL4_REG;

  uint8_t res0[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_DFLT_MASTER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_DFLT_MASTER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_WTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_WTEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_TCL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_TCL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_CCLM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_CCLM1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_CCLM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_CCLM2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_CCLM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_CCLM3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_CCLM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_CCLM4_REG;

  uint8_t res1[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_DMA_VERSION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_DMA_VERSION_REG;

};

#define DW_1 (*(volatile struct DW_1_tag *) 0x30020000)

struct GPADC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP_ADC_EN:1;
      uint64_t GP_ADC_START:1;
      uint64_t GP_ADC_CONT:1;
      uint64_t GP_ADC_CLK_SEL:1;
      uint64_t GP_ADC_INT:1;
      uint64_t GP_ADC_MINT:1;
      uint64_t GP_ADC_SE:1;
      uint64_t GP_ADC_MUTE:1;
      uint64_t GP_ADC_SEL:5;
      uint64_t GP_ADC_SIGN:1;
      uint64_t GP_ADC_CHOP:1;
      uint64_t GP_ADC_LDO_ZERO:1;
      uint64_t GP_ADC_DIFF_TEMP_SEL:2;
      uint64_t GP_ADC_DIFF_TEMP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP_ADC_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP_ADC_ATTN3X:1;
      uint64_t GP_ADC_IDYN:1;
      uint64_t GP_ADC_I20U:1;
      uint64_t GP_ADC_DMA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t GP_ADC_CONV_NRS:3;
      uint64_t GP_ADC_SMPL_TIME:4;
      uint64_t GP_ADC_STORE_DEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP_ADC_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP_ADC_EN_DEL:8;
      uint64_t GP_ADC_INTERVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP_ADC_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP_ADC_OFFP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP_ADC_OFFP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP_ADC_OFFN:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP_ADC_OFFN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP_ADC_CLR_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP_ADC_CLEAR_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP_ADC_VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP_ADC_RESULT_REG;

};

#define GPADC_1 (*(volatile struct GPADC_1_tag *) 0x50030900)

struct GPIO_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_DATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P1_DATA:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_DATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_SET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_SET_DATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P1_SET:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_SET_DATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_RESET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_RESET_DATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P1_RESET:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_RESET_DATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_00_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_01_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_02_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_03_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_04_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_05_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_06_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_07_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_08_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_09_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_10_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_11_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_12_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_13_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_14_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_15_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_16_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_17_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_18_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_19_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_20_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_21_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_22_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_23_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_24_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_25_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_26_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_27_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_28_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_29_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_30_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_31_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_00_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_01_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_02_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_03_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_04_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_05_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_06_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_07_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_08_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_09_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_10_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_11_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_12_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_13_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_14_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_15_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_16_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_17_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_18_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_19_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_20_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_21_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_22_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t P0_OUT_CTRL:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P0_PADPWR_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P1_OUT_CTRL:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) P1_PADPWR_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC_CLOCK_SEL:3;
      uint64_t FUNC_CLOCK_EN:1;
      uint64_t XTAL32K_OUTPUT_EN:1;
      uint64_t RC32K_OUTPUT_EN:1;
      uint64_t RCX_OUTPUT_EN:1;
      uint64_t XTAL32M_OUTPUT_EN:1;
      uint64_t RC32M_OUTPUT_EN:1;
      uint64_t DIVN_OUTPUT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIO_CLK_SEL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_06_LOWDRV:1;
      uint64_t P0_07_LOWDRV:1;
      uint64_t P0_16_LOWDRV:1;
      uint64_t P0_17_LOWDRV:1;
      uint64_t P0_18_LOWDRV:1;
      uint64_t P0_25_LOWDRV:1;
      uint64_t P0_26_LOWDRV:1;
      uint64_t P0_27_LOWDRV:1;
      uint64_t P1_00_LOWDRV:1;
      uint64_t P1_01_LOWDRV:1;
      uint64_t P1_02_LOWDRV:1;
      uint64_t P1_06_LOWDRV:1;
      uint64_t P1_09_LOWDRV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAD_WEAK_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROMBIST_CONFIG:2;
      uint64_t reservedSpace0:2;
      uint64_t ROMBIST_ENABLE:1;
      uint64_t reservedSpace1:1;
      uint64_t SYSRAMBIST_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BIST_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t ROM_BIST_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMBIST_STATUS1_REG;

  uint32_t RAMBIST_STATUS2_REG;
  uint32_t RAMBIST_STATUS3_REG;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROMBIST_RESULTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROMBIST_RESULTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROMBIST_RESULTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROMBIST_RESULTH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHOW_CLOCKS:1;
      uint64_t ENABLE_RFPT:1;
      uint64_t SHOW_PLL_TEST_OUT:1;
      uint64_t SHOW_DCDC_TESTBUS:1;
      uint64_t XTAL32M_CAP_TEST_EN:1;
      uint64_t SHOW_IF_RO:1;
      uint64_t ADPLL_SCAN_TEST_EN:1;
      uint64_t PM_MON_EN:1;
      uint64_t SHOW_PWR_TST_OUT:3;
      uint64_t RADIO_ONLY_MODE_EN:1;
      uint64_t SDADC_TEST_OUT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t XTAL32M_TRIM_TEST_EN:1;
      uint64_t LED0_PWM_DISABLE:1;
      uint64_t LED1_PWM_DISABLE:1;
      uint64_t PM_MON_CTRL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ANA_TESTMUX_CTRL:4;
      uint64_t reservedSpace0:4;
      uint64_t RF_IN_TESTMUX_CTRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF_TEST_OUT_SEL:6;
      uint64_t VBUS_COMPARATOR_TEST:1;
      uint64_t reservedSpace0:1;
      uint64_t RF_TEST_OUT_PARAM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF_TEST_IN_SEL:3;
      uint64_t reservedSpace0:5;
      uint64_t RF_TEST_IN_PARAM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CTRL4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_BUS_TO_AVS:1;
      uint64_t TEST_LDO_1V4:1;
      uint64_t TEST_LDO_1V8:1;
      uint64_t TEST_LDO_CORE:1;
      uint64_t TEST_LDO_1V8P:1;
      uint64_t TEST_LDO_ADC:1;
      uint64_t TEST_LDO_PLL:1;
      uint64_t TEST_LDO_VDDHIGH:1;
      uint64_t TEST_VDDD_NOTSLEEP:1;
      uint64_t TEST_VDDX_OSC32M:1;
      uint64_t TEST_VDDX_RCX:1;
      uint64_t TEST_VDDX_ADPLL:1;
      uint64_t TEST_SIMO_BUCK:1;
      uint64_t TEST_VCONT:1;
      uint64_t TEST_DIFFTEMP:1;
      uint64_t TEST_FORCE_RUNNING:1;
      uint64_t TEST_POR_VBAT:1;
      uint64_t TEST_LRA_ADC:1;
      uint64_t TEST_PLL:1;
      uint64_t TEST_BANDGAP_I_TEST:1;
      uint64_t TEST_BANDGAP:4;
      uint64_t BGR_BOOST_VREF:1;
      uint64_t LDO_CORE_BOOST_VDD:1;
      uint64_t TEST_VCAP_PRECHARGE:1;
      uint64_t reservedSpace0:1;
      uint64_t POR_VBAT_FORCE_MASK:1;
      uint64_t POR_VBAT_FORCE_OFF:1;
      uint64_t POR_VBAT_FORCE_ON:1;
      uint64_t LDO_RET_FORCE_HOLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CTRL5_REG;

