iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res2[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_RES_Y:16;
      uint64_t LCDC_JDI_RES_X:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_RESXY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_BXBLANKING:16;
      uint64_t LCDC_JDI_FXBLANKING:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_FBX_BLANKING_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_BYBLANKING:16;
      uint64_t LCDC_JDI_FYBLANKING:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_FBY_BLANKING_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_HCK_WIDTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_HCK_WIDTH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_XRST_WIDTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_XRST_WIDTH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_VST_DELAY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_VST_DELAY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_VST_WIDTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_VST_WIDTH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_VCK_DELAY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_VCK_DELAY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_HST_DELAY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_HST_DELAY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_HST_WIDTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_HST_WIDTH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_ENB_START_HLINE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_ENB_START_HLINE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_ENB_END_HLINE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_ENB_END_HLINE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_ENB_START_CLK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_ENB_START_CLK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_JDI_ENB_WIDTH_CLK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_JDI_ENB_WIDTH_CLK_REG;

  uint8_t res3[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_DBIB_CMD_VAL:16;
      uint64_t reservedSpace0:11;
      uint64_t LCDC_DBIB_CMD_STORE:1;
      uint64_t reservedSpace1:2;
      uint64_t LCDC_DBIB_CMD_SEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_DBIB_CMD_REG;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_IDREG_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_VSYNC_IRQ_EN:1;
      uint64_t LCDC_HSYNC_IRQ_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t LCDC_TE_IRQ_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t LCDC_FRAME_END_IRQ_EN:1;
      uint64_t reservedSpace2:25;
      uint64_t LCDC_IRQ_TRIGGER_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_INTERRUPT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_STAT_ACTIVE:1;
      uint64_t LCDC_FRAMEGEN_BUSY:1;
      uint64_t LCDC_STAT_HSYNC:1;
      uint64_t LCDC_STAT_VSYNC:1;
      uint64_t LCDC_STAT_CSYNC:1;
      uint64_t LCDC_LAST_ROW:1;
      uint64_t LCDC_UNDERFLOW:1;
      uint64_t LCDC_STICKY_UNDERFLOW:1;
      uint64_t LCDC_DBIB_TE:1;
      uint64_t reservedSpace0:1;
      uint64_t LCDC_DBIB_CMD_FIFO_EMPTY_N:1;
      uint64_t LCDC_DBIB_CMD_FIFO_FULL:1;
      uint64_t LCDC_DBIB_CMD_PENDING:1;
      uint64_t LCDC_FRAME_END:1;
      uint64_t LCDC_FRAME_START:1;
      uint64_t LCDC_JDI_TIM_SW_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_STATUS_REG;

  uint8_t res5[132];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_CRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_CRC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCDC_L0_OFFSETX:16;
      uint64_t LCDC_L0_DMA_PREFETCH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDC_LAYER0_OFFSETX_REG;

};

#define LCDC_1 (*(volatile struct LCDC_1_tag *) 0x30030000)

struct LRA_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_EN:1;
      uint64_t HBRIDGE_EN:1;
      uint64_t ADC_EN:1;
      uint64_t LDO_EN:1;
      uint64_t LOOP_EN:1;
      uint64_t PULLDOWN_EN:1;
      uint64_t SMP_SEL:2;
      uint64_t IRQ_DIV:4;
      uint64_t IRQ_IDX:4;
      uint64_t IRQ_CTRL_EN:1;
      uint64_t IRQ_ADC_EN:1;
      uint64_t IRQ_SCP_EVENT_EN:1;
      uint64_t reservedSpace0:5;
      uint64_t SMP_IDX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWM_MODE:2;
      uint64_t FLT_IN_SEL:1;
      uint64_t POLARITY:1;
      uint64_t SMP_MODE:1;
      uint64_t AUTO_MODE:1;
      uint64_t reservedSpace0:10;
      uint64_t HALF_PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DREF:16;
      uint64_t VREF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_SMP_1:16;
      uint64_t LRA_SMP_2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_SMP1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_SMP_3:16;
      uint64_t LRA_SMP_4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_SMP2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_SMP_5:16;
      uint64_t LRA_SMP_6:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_SMP3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_SMP_7:16;
      uint64_t LRA_SMP_8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_SMP4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_SMP_9:16;
      uint64_t LRA_SMP_10:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_SMP5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_SMP_11:16;
      uint64_t LRA_SMP_12:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_SMP6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_SMP_13:16;
      uint64_t LRA_SMP_14:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_SMP7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_SMP_15:16;
      uint64_t LRA_SMP_16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_SMP8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT_COEF_00:16;
      uint64_t FLT_COEF_01:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_COEF1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT_COEF_02:16;
      uint64_t FLT_COEF_10:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_COEF2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT_COEF_11:16;
      uint64_t FLT_COEF_12:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_FLT_COEF3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERC_LS_EN:1;
      uint64_t ERC_LS_TRIM:2;
      uint64_t SCP_LS_EN:1;
      uint64_t SCP_LS_TRIM_P:4;
      uint64_t SCP_LS_TRIM_N:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_BRD_LS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERC_HS_EN:1;
      uint64_t ERC_HS_TRIM:2;
      uint64_t SCP_HS_EN:1;
      uint64_t SCP_HS_TRIM:4;
      uint64_t HSGND_TRIM:3;
      uint64_t TRIM_GAIN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_BRD_HS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSP_STAT:1;
      uint64_t HSN_STAT:1;
      uint64_t LSP_STAT:1;
      uint64_t LSN_STAT:1;
      uint64_t HSP_ON:1;
      uint64_t HSN_ON:1;
      uint64_t LSP_ON:1;
      uint64_t LSN_ON:1;
      uint64_t LOOP_STAT:1;
      uint64_t SC_EVENT_HS:1;
      uint64_t SC_EVENT_LS:1;
      uint64_t SCP_LS_COMP_OUT_P:1;
      uint64_t SCP_LS_COMP_OUT_N:1;
      uint64_t SCP_HS_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_BRD_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LRA_ADC_START:1;
      uint64_t LRA_ADC_MUTE:1;
      uint64_t LRA_ADC_SIGN:1;
      uint64_t LRA_ADC_FREQ:4;
      uint64_t LRA_ADC_TEST_IN_SEL:1;
      uint64_t LRA_ADC_TEST_PARAM:1;
      uint64_t LRA_ADC_OFFSET:8;
      uint64_t reservedSpace0:14;
      uint64_t LRA_ADC_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_ADC_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_OFFP_I_WR:9;
      uint64_t ADC_OFFN_I_WR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_ADC_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_OFFP_Q_WR:9;
      uint64_t ADC_OFFN_Q_WR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_ADC_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GP_ADC_VAL:16;
      uint64_t MAN_FLT_IN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_ADC_RESULT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDO_VREF_HOLD:1;
      uint64_t LDO_TST:1;
      uint64_t reservedSpace0:29;
      uint64_t LDO_OK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_LDO_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFT_CTRL:16;
      uint64_t DFT_STALL:2;
      uint64_t DFT_EN_TIMER:1;
      uint64_t DFT_FORCE_HSPN:1;
      uint64_t DFT_SEL:1;
      uint64_t TIMER_SCALE_TRIM:2;
      uint64_t TIMER_TRIM:2;
      uint64_t PWM_MAN:1;
      uint64_t PWM_SEL:1;
      uint64_t SWM_MAN:1;
      uint64_t SWM_SEL:1;
      uint64_t SPARE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LRA_DFT_REG;

