iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define LRA_1 (*(volatile struct LRA_1_tag *) 0x50030a00)

struct MEMCTRL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM_MARGIN:2;
      uint64_t RAM_LPMX:1;
      uint64_t RAM_DST:1;
      uint64_t ROM_MARGIN_CTRL:4;
      uint64_t ROM_MARGIN_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEM_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SNC_PRIO:2;
      uint64_t AHB2_PRIO:2;
      uint64_t AHB_PRIO:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEM_PRIO_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SNC_MAX_STALL:4;
      uint64_t AHB2_MAX_STALL:4;
      uint64_t AHB_MAX_STALL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEM_STALL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_WRITE_BUFF:1;
      uint64_t AHB2_WRITE_BUFF:1;
      uint64_t AHB_CLR_WR_BUFF:1;
      uint64_t AHB2_CLR_WR_BUFF:1;
      uint64_t AHB_WR_BUFF_CNT:4;
      uint64_t AHB2_WR_BUFF_CNT:4;
      uint64_t CMI_NOT_READY:1;
      uint64_t CMI_CLEAR_READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEM_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM1_OFF_BUT_ACCESS:1;
      uint64_t RAM2_OFF_BUT_ACCESS:1;
      uint64_t RAM3_OFF_BUT_ACCESS:1;
      uint64_t RAM4_OFF_BUT_ACCESS:1;
      uint64_t RAM5_OFF_BUT_ACCESS:1;
      uint64_t RAM6_OFF_BUT_ACCESS:1;
      uint64_t RAM7_OFF_BUT_ACCESS:1;
      uint64_t RAM8_OFF_BUT_ACCESS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEM_STATUS2_REG;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t CMI_CODE_BASE_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMI_CODE_BASE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CMI_DATA_BASE_ADDR:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMI_DATA_BASE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t CMI_SHARED_BASE_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMI_SHARED_BASE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t CMI_END_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMI_END_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SNC_BASE_ADDRESS:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNC_BASE_REG;

  uint8_t res1[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY_UART:2;
      uint64_t BUSY_UART2:2;
      uint64_t BUSY_SPI:2;
      uint64_t BUSY_SPI2:2;
      uint64_t BUSY_I2C:2;
      uint64_t BUSY_I2C2:2;
      uint64_t BUSY_SDADC:2;
      uint64_t BUSY_PCM:2;
      uint64_t BUSY_SRC:2;
      uint64_t BUSY_PDM:2;
      uint64_t BUSY_GPADC:2;
      uint64_t BUSY_UART3:2;
      uint64_t BUSY_TIMER:2;
      uint64_t BUSY_TIMER2:2;
      uint64_t BUSY_MOTOR:2;
      uint64_t BUSY_SPARE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSY_SET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY_UART:2;
      uint64_t BUSY_UART2:2;
      uint64_t BUSY_SPI:2;
      uint64_t BUSY_SPI2:2;
      uint64_t BUSY_I2C:2;
      uint64_t BUSY_I2C2:2;
      uint64_t BUSY_SDADC:2;
      uint64_t BUSY_PCM:2;
      uint64_t BUSY_SRC:2;
      uint64_t BUSY_PDM:2;
      uint64_t BUSY_GPADC:2;
      uint64_t BUSY_UART3:2;
      uint64_t BUSY_TIMER:2;
      uint64_t BUSY_TIMER2:2;
      uint64_t BUSY_MOTOR:2;
      uint64_t BUSY_SPARE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSY_RESET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY_UART:2;
      uint64_t BUSY_UART2:2;
      uint64_t BUSY_SPI:2;
      uint64_t BUSY_SPI2:2;
      uint64_t BUSY_I2C:2;
      uint64_t BUSY_I2C2:2;
      uint64_t BUSY_SDADC:2;
      uint64_t BUSY_PCM:2;
      uint64_t BUSY_SRC:2;
      uint64_t BUSY_PDM:2;
      uint64_t BUSY_GPADC:2;
      uint64_t BUSY_UART3:2;
      uint64_t BUSY_TIMER:2;
      uint64_t BUSY_TIMER2:2;
      uint64_t BUSY_MOTOR:2;
      uint64_t BUSY_SPARE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSY_STAT_REG;

};

#define MEMCTRL_1 (*(volatile struct MEMCTRL_1_tag *) 0x50050000)

struct OTPC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_MODE_MODE:3;
      uint64_t reservedSpace0:1;
      uint64_t OTPC_MODE_USE_TST_ROW:1;
      uint64_t OTPC_MODE_HT_MARG_EN:1;
      uint64_t OTPC_MODE_PRG_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_STAT_PRDY:1;
      uint64_t OTPC_STAT_PBUF_EMPTY:1;
      uint64_t OTPC_STAT_MRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_PADDR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_PADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_PWORD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_PWORD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_TIM1_CC_T_1US:7;
      uint64_t reservedSpace0:1;
      uint64_t OTPC_TIM1_CC_T_20NS:2;
      uint64_t reservedSpace1:2;
      uint64_t OTPC_TIM1_CC_T_RD:3;
      uint64_t reservedSpace2:1;
      uint64_t OTPC_TIM1_US_T_PL:4;
      uint64_t OTPC_TIM1_US_T_CS:4;
      uint64_t OTPC_TIM1_US_T_CSP:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_TIM1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_TIM2_US_T_PW:5;
      uint64_t OTPC_TIM2_US_T_PWI:3;
      uint64_t OTPC_TIM2_US_T_PPR:7;
      uint64_t reservedSpace0:1;
      uint64_t OTPC_TIM2_US_T_PPS:5;
      uint64_t OTPC_TIM2_US_T_VDS:3;
      uint64_t OTPC_TIM2_US_T_PPH:5;
      uint64_t OTPC_TIM2_US_T_SAS:2;
      uint64_t OTPC_TIM2_US_ADD_CC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_TIM2_REG;

