iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res0[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t QSPIC_CTR_SADDR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_SADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t QSPIC_CTR_EADDR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_EADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_NONCE_0_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_NONCE_0_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_NONCE_4_7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_NONCE_4_7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_KEY_0_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_KEY_0_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_KEY_4_7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_KEY_4_7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_KEY_8_11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_KEY_8_11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_KEY_12_15:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_KEY_12_15_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_KEY_16_19:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_KEY_16_19_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_KEY_20_23:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_KEY_20_23_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_KEY_24_27:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_KEY_24_27_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CTR_KEY_28_31:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTR_KEY_28_31_REG;

};

#define QSPIC_1 (*(volatile struct QSPIC_1_tag *) 0x38000000)

struct QSPIC2_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_SET_SINGLE:1;
      uint64_t QSPIC_SET_DUAL:1;
      uint64_t QSPIC_SET_QUAD:1;
      uint64_t QSPIC_EN_CS:1;
      uint64_t QSPIC_DIS_CS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_CTRLBUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_AUTO_MD:1;
      uint64_t QSPIC_CLK_MD:1;
      uint64_t QSPIC_IO2_OEN:1;
      uint64_t QSPIC_IO3_OEN:1;
      uint64_t QSPIC_IO2_DAT:1;
      uint64_t QSPIC_IO3_DAT:1;
      uint64_t QSPIC_HRDY_MD:1;
      uint64_t QSPIC_RXD_NEG:1;
      uint64_t QSPIC_RPIPE_EN:1;
      uint64_t QSPIC_PCLK_MD:3;
      uint64_t QSPIC_FORCENSEQ_EN:1;
      uint64_t QSPIC_USE_32BA:1;
      uint64_t QSPIC_SRAM_EN:1;
      uint64_t QSPIC_CS_MD:1;
      uint64_t QSPIC_CLK_FREE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_CTRLMODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_RECVDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_RECVDATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_INST:8;
      uint64_t QSPIC_INST_WB:8;
      uint64_t QSPIC_EXT_BYTE:8;
      uint64_t QSPIC_INST_TX_MD:2;
      uint64_t QSPIC_ADR_TX_MD:2;
      uint64_t QSPIC_EXT_TX_MD:2;
      uint64_t QSPIC_DMY_TX_MD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_BURSTCMDA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_DAT_RX_MD:2;
      uint64_t QSPIC_EXT_BYTE_EN:1;
      uint64_t QSPIC_EXT_HF_DS:1;
      uint64_t QSPIC_DMY_NUM:2;
      uint64_t QSPIC_INST_MD:1;
      uint64_t QSPIC_WRAP_MD:1;
      uint64_t QSPIC_WRAP_LEN:2;
      uint64_t QSPIC_WRAP_SIZE:2;
      uint64_t QSPIC_CS_HIGH_MIN:3;
      uint64_t QSPIC_DMY_FORCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_BURSTCMDB_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_WRITEDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_WRITEDATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_READDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_READDATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_DUMMYDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_DUMMYDATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t QSPIC_ERS_ADDR:20;
      uint64_t QSPIC_ERASE_EN:1;
      uint64_t QSPIC_ERS_STATE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_ERASECTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_ERS_INST:8;
      uint64_t QSPIC_WEN_INST:8;
      uint64_t QSPIC_SUS_INST:8;
      uint64_t QSPIC_RES_INST:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_ERASECMDA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_ERS_TX_MD:2;
      uint64_t QSPIC_WEN_TX_MD:2;
      uint64_t QSPIC_SUS_TX_MD:2;
      uint64_t QSPIC_RES_TX_MD:2;
      uint64_t QSPIC_EAD_TX_MD:2;
      uint64_t QSPIC_ERS_CS_HI:5;
      uint64_t reservedSpace0:1;
      uint64_t QSPIC_ERSRES_HLD:4;
      uint64_t reservedSpace1:4;
      uint64_t QSPIC_RESSUS_DLY:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_ERASECMDB_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_BRK_WRD:16;
      uint64_t QSPIC_BRK_EN:1;
      uint64_t QSPIC_BRK_SZ:1;
      uint64_t QSPIC_BRK_TX_MD:2;
      uint64_t QSPIC_SEC_HF_DS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_BURSTBRK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_RSTAT_INST:8;
      uint64_t QSPIC_RSTAT_TX_MD:2;
      uint64_t QSPIC_RSTAT_RX_MD:2;
      uint64_t QSPIC_BUSY_POS:3;
      uint64_t QSPIC_BUSY_VAL:1;
      uint64_t QSPIC_RESSTS_DLY:6;
      uint64_t QSPIC_STSDLY_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_STATUSCMD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CHCKERASE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_CHCKERASE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t QSPIC_PADS_DRV:2;
      uint64_t QSPIC_PADS_SLEW:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_GP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_WR_INST:8;
      uint64_t QSPIC_WR_INST_TX_MD:2;
      uint64_t QSPIC_WR_ADR_TX_MD:2;
      uint64_t QSPIC_WR_DAT_TX_MD:2;
      uint64_t QSPIC_WR_CS_HIGH_MIN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_AWRITECMD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_MEMBLEN:3;
      uint64_t QSPIC_T_CEM_EN:1;
      uint64_t QSPIC_T_CEM_CC:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC2_MEMBLEN_REG;

