iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFIO_RX_TUNE_CAP_TRIM_RX:4;
      uint64_t RFIO_TX_TUNE_CAP_TRIM_RX:3;
      uint64_t reservedSpace0:1;
      uint64_t RFIO_RX_TUNE_CAP_TRIM_TX:4;
      uint64_t RFIO_TX_TUNE_CAP_TRIM_TX:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_IO_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_TRIM_GAIN0_HP:5;
      uint64_t LNA_TRIM_GAIN1_HP:5;
      uint64_t LNA_TRIM_GAIN2_HP:5;
      uint64_t LNA_TRIM_GAIN3_HP:5;
      uint64_t LNA_TRIM_GAIN4_HP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_LNA_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_TRIM_GAIN0_LP:5;
      uint64_t LNA_TRIM_GAIN1_LP:5;
      uint64_t LNA_TRIM_GAIN2_LP:5;
      uint64_t LNA_TRIM_GAIN3_LP:5;
      uint64_t LNA_TRIM_GAIN4_LP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_LNA_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_TRIM_CASC:3;
      uint64_t reservedSpace0:1;
      uint64_t LNA_MODE_GAIN0_LP:2;
      uint64_t reservedSpace1:2;
      uint64_t LNA_MODE_GAIN1_LP:2;
      uint64_t reservedSpace2:2;
      uint64_t LNA_MODE_GAIN2_LP:2;
      uint64_t reservedSpace3:2;
      uint64_t LNA_MODE_GAIN3_LP:2;
      uint64_t reservedSpace4:2;
      uint64_t LNA_MODE_GAIN4_LP:2;
      uint64_t reservedSpace5:2;
      uint64_t LNA_SPARE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_LNA_CTRL3_REG;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF_CAL_CAP_RD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_IFF_RESULT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF_CAL_CAP_1M_SET1:4;
      uint64_t reservedSpace0:4;
      uint64_t IF_CAL_CAP_1M_SET2:4;
      uint64_t reservedSpace1:4;
      uint64_t IF_CAL_CAP_2M_SET1:4;
      uint64_t reservedSpace2:4;
      uint64_t IF_CAL_CAP_2M_SET2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_IFF_CC_SET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF_CAL_CAP_RD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_IFF_CAL_CAP_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIX_CAL_CAP_RD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_MIX_CAL_CAP_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLLDIG_SYNC_CLK_INV:1;
      uint64_t ADPLLDIG_RFMON_MUX_SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ADPLLDIG_RFMON_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDP_RFCU_SEL:1;
      uint64_t RDP_MOD_SEL1:1;
      uint64_t RDP_MOD_SEL2:2;
      uint64_t RDP_MOD_RATE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_RDP_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF_RFCU_CLK_DIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_RFCU_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_EN_OVR:2;
      uint64_t RX_EN_OVR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_OVERRULE_REG;

};

#define RFCU_1 (*(volatile struct RFCU_1_tag *) 0x40020000)

struct RFCU_POWER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFIO_LDO_EN_DCF_RX:5;
      uint64_t RFIO_LDO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_LDO_EN_DCF_RX:5;
      uint64_t PA_LDO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_LDO_EN_DCF_RX:5;
      uint64_t LNA_LDO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIX_LDO_EN_DCF_RX:5;
      uint64_t MIX_LDO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFF_LDO_EN_DCF_RX:5;
      uint64_t IFF_LDO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFFADC_LDO_EN_DCF_RX:5;
      uint64_t IFFADC_LDO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLL_TDC_LDO_EN_DCF_RX:5;
      uint64_t ADPLL_TDC_LDO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLL_DTC_LDO_EN_DCF_RX:5;
      uint64_t ADPLL_DTC_LDO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLL_DCO_LDO_EN_DCF_RX:5;
      uint64_t ADPLL_DCO_LDO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDO_ZERO_EN_DCF_RX:5;
      uint64_t LDO_ZERO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG9_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_LDO_ZERO_DCF_RX:5;
      uint64_t LNA_LDO_ZERO_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG10_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLLDIG_LDO_ACTIVERDY_DCF_RX:5;
      uint64_t ADPLLDIG_LDO_ACTIVERDY_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLLDIG_LDO_LP_DCF_RX:5;
      uint64_t ADPLLDIG_LDO_LP_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG12_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFIO_RX_EN_DCF_RX:5;
      uint64_t RFIO_RX_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG13_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFIO_TX_EN_DCF_RX:5;
      uint64_t RFIO_TX_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG14_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFIO_TX_HARM_EN_DCF_RX:5;
      uint64_t RFIO_TX_HARM_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG15_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFIO_BIAS_EN_DCF_RX:5;
      uint64_t RFIO_BIAS_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG16_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFIO_BIAS_SH_OPEN_DCF_RX:5;
      uint64_t RFIO_BIAS_SH_OPEN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG17_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_RAMP_EN_DCF_RX:5;
      uint64_t PA_RAMP_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG18_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA_EN_DCF_RX:5;
      uint64_t PA_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG19_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_CORE_EN_DCF_RX:5;
      uint64_t LNA_CORE_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG20_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LNA_CGM_EN_DCF_RX:5;
      uint64_t LNA_CGM_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG21_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIX_EN_DCF_RX:5;
      uint64_t MIX_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG22_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIX_BIAS_SH_OPEN_DCF_RX:5;
      uint64_t MIX_BIAS_SH_OPEN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG23_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFF_EN_DCF_RX:5;
      uint64_t IFF_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG24_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFF_BIAS_SH_OPEN_DCF_RX:5;
      uint64_t IFF_BIAS_SH_OPEN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG25_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_CLK_EN_DCF_RX:5;
      uint64_t ADC_CLK_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG26_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_EN_DCF_RX:5;
      uint64_t ADC_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG27_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLL_DCO_EN_DCF_RX:5;
      uint64_t ADPLL_DCO_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG28_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLL_CLK_EN_DCF_RX:5;
      uint64_t ADPLL_CLK_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG29_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLLDIG_RST_DCF_RX:5;
      uint64_t ADPLLDIG_RST_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG30_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLLDIG_EN_DCF_RX:5;
      uint64_t ADPLLDIG_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG31_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLLDIG_RX_EN_DCF_RX:5;
      uint64_t ADPLLDIG_RX_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG32_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLLDIG_PAIN_EN_DCF_RX:5;
      uint64_t ADPLLDIG_PAIN_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG33_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLL_LOBUF_PA_EN_DCF_RX:5;
      uint64_t ADPLL_LOBUF_PA_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG34_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL_EN_DCF_RX:5;
      uint64_t CAL_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG35_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEM_EN_DCF_RX:5;
      uint64_t DEM_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG36_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEM_DC_PARCAL_EN_DCF_RX:5;
      uint64_t SPARE_DEM_DC_PARCAL_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG37_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEM_AGC_UNFREEZE_EN_DCF_RX:5;
      uint64_t SPARE_DEM_AGC_UNFREEZE_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG38_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEM_SIGDETECT_EN_DCF_RX:5;
      uint64_t SPARE_DEM_SIGDETECT_EN_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG39_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHY_RDY4BS_DCF_RX:5;
      uint64_t PHY_RDY4BS_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG40_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADPLL_RDY_FOR_DIV_DCF_RX:5;
      uint64_t ADPLL_RDY_FOR_DIV_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG41_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARE1_DCF_RX:5;
      uint64_t SPARE1_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG42_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARE2_DCF_RX:5;
      uint64_t SPARE2_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG43_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARE3_DCF_RX:5;
      uint64_t SPARE3_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG44_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARE4_DCF_RX:5;
      uint64_t SPARE4_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG45_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARE5_DCF_RX:5;
      uint64_t SPARE5_DCF_TX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ENABLE_CONFIG46_REG;

