iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALW_EN_RFIO_LDO_EN:1;
      uint64_t ALW_EN_PA_LDO_EN:1;
      uint64_t ALW_EN_LNA_LDO_EN:1;
      uint64_t ALW_EN_MIX_LDO_EN:1;
      uint64_t ALW_EN_IFF_LDO_EN:1;
      uint64_t ALW_EN_IFFADC_LDO_EN:1;
      uint64_t ALW_EN_ADPLL_TDC_LDO_EN:1;
      uint64_t ALW_EN_ADPLL_DTC_LDO_EN:1;
      uint64_t ALW_EN_ADPLL_DCO_LDO_EN:1;
      uint64_t ALW_EN_LDO_ZERO_EN:1;
      uint64_t ALW_EN_LNA_LDO_ZERO:1;
      uint64_t ALW_EN_ADPLLDIG_LDO_ACTIVERDY:1;
      uint64_t ALW_EN_ADPLLDIG_LDO_LP:1;
      uint64_t ALW_EN_RFIO_RX_EN:1;
      uint64_t ALW_EN_RFIO_TX_EN:1;
      uint64_t ALW_EN_RFIO_TX_HARM_EN:1;
      uint64_t ALW_EN_RFIO_BIAS_EN:1;
      uint64_t ALW_EN_RFIO_BIAS_SH_OPEN:1;
      uint64_t ALW_EN_PA_RAMP_EN:1;
      uint64_t ALW_EN_PA_EN:1;
      uint64_t ALW_EN_LNA_CORE_EN:1;
      uint64_t ALW_EN_LNA_CGM_EN:1;
      uint64_t ALW_EN_MIX_EN:1;
      uint64_t ALW_EN_MIX_BIAS_SH_OPEN:1;
      uint64_t ALW_EN_IFF_EN:1;
      uint64_t ALW_EN_IFF_BIAS_SH_OPEN:1;
      uint64_t ALW_EN_ADC_CLK_EN:1;
      uint64_t ALW_EN_ADC_EN:1;
      uint64_t ALW_EN_ADPLL_DCO_EN:1;
      uint64_t ALW_EN_ADPLL_CLK_EN:1;
      uint64_t ALW_EN_ADPLLDIG_RST:1;
      uint64_t ALW_EN_ADPLLDIG_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ALWAYS_EN1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALW_EN_ADPLLDIG_RX_EN:1;
      uint64_t ALW_EN_ADPLL_PAIN_EN:1;
      uint64_t ALW_EN_ADPLL_LOBUF_PA_EN:1;
      uint64_t ALW_EN_CAL_EN:1;
      uint64_t ALW_EN_DEM_EN:1;
      uint64_t ALW_EN_DEM_DC_PARCAL_EN:1;
      uint64_t ALW_EN_DEM_AGC_UNFREEZE_EN:1;
      uint64_t ALW_EN_DEM_SIGDETECT_EN:1;
      uint64_t ALW_EN_PHY_RDY4BS:1;
      uint64_t ALW_EN_ADPLL_RDY_FOR_DIV:1;
      uint64_t ALW_EN_SPARE1:1;
      uint64_t ALW_EN_SPARE2:1;
      uint64_t ALW_EN_SPARE3:1;
      uint64_t ALW_EN_SPARE4:1;
      uint64_t ALW_EN_SPARE5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_ALWAYS_EN2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF_PORT0_RX:1;
      uint64_t RF_PORT0_TX:1;
      uint64_t RF_PORT1_RX:1;
      uint64_t RF_PORT1_TX:1;
      uint64_t RF_PORT2_RX:1;
      uint64_t RF_PORT2_TX:1;
      uint64_t RF_PORT3_RX:1;
      uint64_t RF_PORT3_TX:1;
      uint64_t RF_PORT4_RX:1;
      uint64_t RF_PORT4_TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_PORT_EN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF_PORT0_POL:1;
      uint64_t RF_PORT1_POL:1;
      uint64_t RF_PORT2_POL:1;
      uint64_t RF_PORT3_POL:1;
      uint64_t RF_PORT4_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RF_PORT_POL_REG;

};

#define RFCU_POWER_1 (*(volatile struct RFCU_POWER_1_tag *) 0x40020200)

struct RFMON_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFMON_PACK_EN:1;
      uint64_t RFMON_CIRC_EN:1;
      uint64_t RFMON_BREQ_FORCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFMON_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RFMON_ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFMON_ADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFMON_LEN:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFMON_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFMON_ACTIVE:1;
      uint64_t RFMON_OFLOW_STK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFMON_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RFMON_CRV_ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFMON_CRV_ADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFMON_CRV_LEN:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFMON_CRV_LEN_REG;

};

#define RFMON_1 (*(volatile struct RFMON_1_tag *) 0x50040600)

struct RTC_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_TIME_DISABLE:1;
      uint64_t RTC_CAL_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_CONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_HMS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_HOUR_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_TIME_H_U:4;
      uint64_t RTC_TIME_H_T:4;
      uint64_t RTC_TIME_S_U:4;
      uint64_t RTC_TIME_S_T:3;
      uint64_t reservedSpace0:1;
      uint64_t RTC_TIME_M_U:4;
      uint64_t RTC_TIME_M_T:3;
      uint64_t reservedSpace1:1;
      uint64_t RTC_TIME_HR_U:4;
      uint64_t RTC_TIME_HR_T:2;
      uint64_t RTC_TIME_PM:1;
      uint64_t RTC_TIME_CH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TIME_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_DAY:3;
      uint64_t RTC_CAL_M_U:4;
      uint64_t RTC_CAL_M_T:1;
      uint64_t RTC_CAL_D_U:4;
      uint64_t RTC_CAL_D_T:2;
      uint64_t reservedSpace0:2;
      uint64_t RTC_CAL_Y_U:4;
      uint64_t RTC_CAL_Y_T:4;
      uint64_t RTC_CAL_C_U:4;
      uint64_t RTC_CAL_C_T:2;
      uint64_t reservedSpace1:1;
      uint64_t RTC_CAL_CH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_CALENDAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_TIME_H_U:4;
      uint64_t RTC_TIME_H_T:4;
      uint64_t RTC_TIME_S_U:4;
      uint64_t RTC_TIME_S_T:3;
      uint64_t reservedSpace0:1;
      uint64_t RTC_TIME_M_U:4;
      uint64_t RTC_TIME_M_T:3;
      uint64_t reservedSpace1:1;
      uint64_t RTC_TIME_HR_U:4;
      uint64_t RTC_TIME_HR_T:2;
      uint64_t RTC_TIME_PM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TIME_ALARM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t RTC_CAL_M_U:4;
      uint64_t RTC_CAL_M_T:1;
      uint64_t RTC_CAL_D_U:4;
      uint64_t RTC_CAL_D_T:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_CALENDAR_ALARM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_ALARM_HOS_EN:1;
      uint64_t RTC_ALARM_SEC_EN:1;
      uint64_t RTC_ALARM_MIN_EN:1;
      uint64_t RTC_ALARM_HOUR_EN:1;
      uint64_t RTC_ALARM_DATE_EN:1;
      uint64_t RTC_ALARM_MNTH_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_ALARM_ENABLE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_EVENT_HOS:1;
      uint64_t RTC_EVENT_SEC:1;
      uint64_t RTC_EVENT_MIN:1;
      uint64_t RTC_EVENT_HOUR:1;
      uint64_t RTC_EVENT_DATE:1;
      uint64_t RTC_EVENT_MNTH:1;
      uint64_t RTC_EVENT_ALRM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_EVENT_FLAGS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_HOS_INT_EN:1;
      uint64_t RTC_SEC_INT_EN:1;
      uint64_t RTC_MIN_INT_EN:1;
      uint64_t RTC_HOUR_INT_EN:1;
      uint64_t RTC_DATE_INT_EN:1;
      uint64_t RTC_MNTH_INT_EN:1;
      uint64_t RTC_ALRM_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_INTERRUPT_ENABLE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_HOS_INT_DIS:1;
      uint64_t RTC_SEC_INT_DIS:1;
      uint64_t RTC_MIN_INT_DIS:1;
      uint64_t RTC_HOUR_INT_DIS:1;
      uint64_t RTC_DATE_INT_DIS:1;
      uint64_t RTC_MNTH_INT_DIS:1;
      uint64_t RTC_ALRM_INT_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_INTERRUPT_DISABLE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_HOS_INT_MSK:1;
      uint64_t RTC_SEC_INT_MSK:1;
      uint64_t RTC_MIN_INT_MSK:1;
      uint64_t RTC_HOUR_INT_MSK:1;
      uint64_t RTC_DATE_INT_MSK:1;
      uint64_t RTC_MNTH_INT_MSK:1;
      uint64_t RTC_ALRM_INT_MSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_INTERRUPT_MASK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_VALID_TIME:1;
      uint64_t RTC_VALID_CAL:1;
      uint64_t RTC_VALID_TIME_ALM:1;
      uint64_t RTC_VALID_CAL_ALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_KEEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_KEEP_RTC_REG;

  uint8_t res0[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_MOTOR_EVENT_EN:1;
      uint64_t RTC_PDC_EVENT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_EVENT_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_MOTOR_EVENT_PERIOD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_MOTOR_EVENT_PERIOD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_PDC_EVENT_PERIOD:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_PDC_EVENT_PERIOD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDC_EVENT_CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_PDC_EVENT_CLEAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_MOTOR_EVENT_CNT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_MOTOR_EVENT_CNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_PDC_EVENT_CNT:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_PDC_EVENT_CNT_REG;

