iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define RTC_4 (*(volatile struct RTC_4_tag *) 0x50000400)

struct SDADC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDADC_EN:1;
      uint64_t SDADC_START:1;
      uint64_t SDADC_INP_SEL:4;
      uint64_t SDADC_INN_SEL:3;
      uint64_t SDADC_SE:1;
      uint64_t SDADC_OSR:2;
      uint64_t SDADC_CONT:1;
      uint64_t SDADC_VREF_SEL:1;
      uint64_t SDADC_LDO_OK:1;
      uint64_t SDADC_INT:1;
      uint64_t SDADC_MINT:1;
      uint64_t SDADC_DMA_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDADC_CTRL_REG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDADC_CHOP_DIS:1;
      uint64_t SDADC_DEM_DIS:1;
      uint64_t reservedSpace0:1;
      uint64_t SDADC_OPMODE:1;
      uint64_t SDADC_LDO_SMPL_DIS:1;
      uint64_t SDADC_LDO_TEST:1;
      uint64_t SDADC_CLK_FREQ:2;
      uint64_t SDADC_OTA_BIAS:2;
      uint64_t SDADC_CORR_ORDER:1;
      uint64_t SDADC_GAIN_SEL_INIT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDADC_TEST_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDADC_GAIN_CORR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDADC_GAIN_CORR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDADC_OFFS_CORR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDADC_OFFS_CORR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDADC_CLR_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDADC_CLEAR_INT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDADC_VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDADC_RESULT_REG;

};

#define SDADC_1 (*(volatile struct SDADC_1_tag *) 0x50020800)

struct SMOTOR_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CYCLIC_MODE:1;
      uint64_t CYCLIC_SIZE:6;
      uint64_t SMOTOR_MOI:10;
      uint64_t SMOTOR_GENSTART_IRQ_EN:1;
      uint64_t SMOTOR_GENEND_IRQ_EN:1;
      uint64_t SMOTOR_FIFO_OVF_IRQ_EN:1;
      uint64_t SMOTOR_FIFO_UNR_IRQ_EN:1;
      uint64_t SMOTOR_THRESHOLD:5;
      uint64_t SMOTOR_THRESHOLD_IRQ_EN:1;
      uint64_t MC_LP_CLK_TRIG_EN:1;
      uint64_t TRIG_RTC_EVENT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMOTOR_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUT0_SIG:2;
      uint64_t OUT1_SIG:2;
      uint64_t OUT2_SIG:2;
      uint64_t OUT3_SIG:2;
      uint64_t SIG0_EN:1;
      uint64_t SIG1_EN:1;
      uint64_t SIG2_EN:1;
      uint64_t SIG3_EN:1;
      uint64_t PG_MODE:1;
      uint64_t PG_START_MODE:1;
      uint64_t GENSTART_IRQ_EN:1;
      uint64_t GENEND_IRQ_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG0_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUT0_SIG:2;
      uint64_t OUT1_SIG:2;
      uint64_t OUT2_SIG:2;
      uint64_t OUT3_SIG:2;
      uint64_t SIG0_EN:1;
      uint64_t SIG1_EN:1;
      uint64_t SIG2_EN:1;
      uint64_t SIG3_EN:1;
      uint64_t PG_MODE:1;
      uint64_t PG_START_MODE:1;
      uint64_t GENSTART_IRQ_EN:1;
      uint64_t GENEND_IRQ_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG1_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUT0_SIG:2;
      uint64_t OUT1_SIG:2;
      uint64_t OUT2_SIG:2;
      uint64_t OUT3_SIG:2;
      uint64_t SIG0_EN:1;
      uint64_t SIG1_EN:1;
      uint64_t SIG2_EN:1;
      uint64_t SIG3_EN:1;
      uint64_t PG_MODE:1;
      uint64_t PG_START_MODE:1;
      uint64_t GENSTART_IRQ_EN:1;
      uint64_t GENEND_IRQ_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG2_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUT0_SIG:2;
      uint64_t OUT1_SIG:2;
      uint64_t OUT2_SIG:2;
      uint64_t OUT3_SIG:2;
      uint64_t SIG0_EN:1;
      uint64_t SIG1_EN:1;
      uint64_t SIG2_EN:1;
      uint64_t SIG3_EN:1;
      uint64_t PG_MODE:1;
      uint64_t PG_START_MODE:1;
      uint64_t GENSTART_IRQ_EN:1;
      uint64_t GENEND_IRQ_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG3_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUT0_SIG:2;
      uint64_t OUT1_SIG:2;
      uint64_t OUT2_SIG:2;
      uint64_t OUT3_SIG:2;
      uint64_t SIG0_EN:1;
      uint64_t SIG1_EN:1;
      uint64_t SIG2_EN:1;
      uint64_t SIG3_EN:1;
      uint64_t PG_MODE:1;
      uint64_t PG_START_MODE:1;
      uint64_t GENSTART_IRQ_EN:1;
      uint64_t GENEND_IRQ_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PG4_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POP_CMD:1;
      uint64_t PG0_START:1;
      uint64_t PG1_START:1;
      uint64_t PG2_START:1;
      uint64_t PG3_START:1;
      uint64_t PG4_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMOTOR_TRIGGER_REG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOTOR_CMD_FIFO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMOTOR_CMD_FIFO_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOTOR_CMD_READ_PTR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMOTOR_CMD_READ_PTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOTOR_CMD_WRITE_PTR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMOTOR_CMD_WRITE_PTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GENSTART_IRQ_STATUS:1;
      uint64_t GENEND_IRQ_STATUS:1;
      uint64_t FIFO_OVF_IRQ_STATUS:1;
      uint64_t FIFO_UNR_IRQ_STATUS:1;
      uint64_t THRESHOLD_IRQ_STATUS:1;
      uint64_t PG0_BUSY:1;
      uint64_t PG1_BUSY:1;
      uint64_t PG2_BUSY:1;
      uint64_t PG3_BUSY:1;
      uint64_t PG4_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMOTOR_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GENSTART_IRQ_CLEAR:1;
      uint64_t GENEND_IRQ_CLEAR:1;
      uint64_t FIFO_OVF_IRQ_CLEAR:1;
      uint64_t FIFO_UNR_IRQ_CLEAR:1;
      uint64_t THRESHOLD_IRQ_CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMOTOR_IRQ_CLEAR_REG;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAVETABLE_BASE_X_B0:5;
      uint64_t reservedSpace0:3;
      uint64_t WAVETABLE_BASE_X_B1:5;
      uint64_t reservedSpace1:3;
      uint64_t WAVETABLE_BASE_X_B2:5;
      uint64_t reservedSpace2:3;
      uint64_t WAVETABLE_BASE_X_B3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WAVETABLE_BASE;

  uint8_t res2[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD_TABLE_BASE_X:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD_TABLE_BASE;

