iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define SMOTOR_1 (*(volatile struct SMOTOR_1_tag *) 0x50030e00)

struct SNC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SNC_EN:1;
      uint64_t SNC_SW_CTRL:1;
      uint64_t BUS_ERROR_DETECT_EN:1;
      uint64_t SNC_RESET:1;
      uint64_t SNC_BRANCH_LOOP_INIT:1;
      uint64_t SNC_IRQ_EN:1;
      uint64_t SNC_IRQ_CONFIG:2;
      uint64_t SNC_IRQ_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNC_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EQ_FLAG:1;
      uint64_t GR_FLAG:1;
      uint64_t SNC_DONE_STATUS:1;
      uint64_t BUS_ERROR_STATUS:1;
      uint64_t HARD_FAULT_STATUS:1;
      uint64_t SNC_IS_STOPPED:1;
      uint64_t SNC_PC_LOADED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNC_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LP_TIMER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNC_LP_TIMER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PC_REG:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNC_PC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R1_REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNC_R1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R2_REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNC_R2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMP1_REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNC_TMP1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMP2_REG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SNC_TMP2_REG;

};

#define SNC_1 (*(volatile struct SNC_1_tag *) 0x50020c00)

struct SPI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_ON:1;
      uint64_t SPI_PHA:1;
      uint64_t SPI_POL:1;
      uint64_t SPI_CLK:2;
      uint64_t SPI_DO:1;
      uint64_t SPI_SMN:1;
      uint64_t SPI_RST:1;
      uint64_t SPI_WORD:2;
      uint64_t SPI_FORCE_DO:1;
      uint64_t SPI_TXH:1;
      uint64_t SPI_DI:1;
      uint64_t SPI_INT_BIT:1;
      uint64_t SPI_MINT:1;
      uint64_t SPI_EN_CTRL:1;
      uint64_t SPI_FIFO_MODE:2;
      uint64_t SPI_PRIORITY:1;
      uint64_t SPI_BUSY:1;
      uint64_t SPI_9BIT_VAL:1;
      uint64_t SPI_RX_FIFO_EMPTY:1;
      uint64_t SPI_RX_FIFO_FULL:1;
      uint64_t SPI_TX_FIFO_EMPTY:1;
      uint64_t SPI_DMA_TXREQ_MODE:1;
      uint64_t SPI_TX_FIFO_NOTFULL_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_RX_TX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_CLEAR_INT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CLEAR_INT_REG;

};

#define SPI_1 (*(volatile struct SPI_1_tag *) 0x50020300)

struct SPI2_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_ON:1;
      uint64_t SPI_PHA:1;
      uint64_t SPI_POL:1;
      uint64_t SPI_CLK:2;
      uint64_t SPI_DO:1;
      uint64_t SPI_SMN:1;
      uint64_t SPI_RST:1;
      uint64_t SPI_WORD:2;
      uint64_t SPI_FORCE_DO:1;
      uint64_t SPI_TXH:1;
      uint64_t SPI_DI:1;
      uint64_t SPI_INT_BIT:1;
      uint64_t SPI_MINT:1;
      uint64_t SPI_EN_CTRL:1;
      uint64_t SPI_FIFO_MODE:2;
      uint64_t SPI_PRIORITY:1;
      uint64_t SPI_BUSY:1;
      uint64_t SPI_9BIT_VAL:1;
      uint64_t SPI_RX_FIFO_EMPTY:1;
      uint64_t SPI_RX_FIFO_FULL:1;
      uint64_t SPI_TX_FIFO_EMPTY:1;
      uint64_t SPI_DMA_TXREQ_MODE:1;
      uint64_t SPI_TX_FIFO_NOTFULL_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI2_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI2_RX_TX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_CLEAR_INT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI2_CLEAR_INT_REG;

};

#define SPI2_3 (*(volatile struct SPI2_3_tag *) 0x50020400)

struct SYS_WDOG_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDOG_VAL:13;
      uint64_t WDOG_VAL_NEG:1;
      uint64_t WDOG_WEN:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMI_RST:1;
      uint64_t reservedSpace0:1;
      uint64_t WDOG_FREEZE_EN:1;
      uint64_t WRITE_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATCHDOG_CTRL_REG;

};

#define SYS_WDOG_1 (*(volatile struct SYS_WDOG_1_tag *) 0x50000700)

struct TIMER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_EN:1;
      uint64_t TIM_ONESHOT_MODE_EN:1;
      uint64_t TIM_COUNT_DOWN_EN:1;
      uint64_t TIM_IN1_EVENT_FALL_EN:1;
      uint64_t TIM_IN2_EVENT_FALL_EN:1;
      uint64_t TIM_IRQ_EN:1;
      uint64_t TIM_FREE_RUN_MODE_EN:1;
      uint64_t TIM_SYS_CLK_EN:1;
      uint64_t TIM_CLK_EN:1;
      uint64_t TIM_IN3_EVENT_FALL_EN:1;
      uint64_t TIM_IN4_EVENT_FALL_EN:1;
      uint64_t TIM_CAP_GPIO1_IRQ_EN:1;
      uint64_t TIM_CAP_GPIO2_IRQ_EN:1;
      uint64_t TIM_CAP_GPIO3_IRQ_EN:1;
      uint64_t TIM_CAP_GPIO4_IRQ_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_TIMER_VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_TIMER_VAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_IN1_STATE:1;
      uint64_t TIM_IN2_STATE:1;
      uint64_t TIM_ONESHOT_PHASE:2;
      uint64_t TIM_GPIO1_EVENT_PENDING:1;
      uint64_t TIM_GPIO2_EVENT_PENDING:1;
      uint64_t TIM_GPIO3_EVENT_PENDING:1;
      uint64_t TIM_GPIO4_EVENT_PENDING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO1_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_GPIO1_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO2_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_GPIO2_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_RELOAD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_SHOTWIDTH:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_SHOTWIDTH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PRESCALER:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_PRESCALER_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_CAPTURE_GPIO1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_CAPTURE_GPIO2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PRESCALER_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_PRESCALER_VAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PWM_FREQ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_PWM_FREQ_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_PWM_DC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_PWM_DC_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO3_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_GPIO3_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_GPIO4_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_GPIO4_CONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO3:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_CAPTURE_GPIO3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CAPTURE_GPIO4:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_CAPTURE_GPIO4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CLEAR_GPIO1_EVENT:1;
      uint64_t TIM_CLEAR_GPIO2_EVENT:1;
      uint64_t TIM_CLEAR_GPIO3_EVENT:1;
      uint64_t TIM_CLEAR_GPIO4_EVENT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_CLEAR_GPIO_EVENT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM_CLEAR_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER_CLEAR_IRQ_REG;

