iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DLF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_DLF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_RAR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_RAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_TAR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_TAR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DLS_E:1;
      uint64_t UART_ADDR_MATCH:1;
      uint64_t UART_SEND_ADDR:1;
      uint64_t UART_TRANSMIT_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_LCR_EXT;

  uint8_t res3[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_UCV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_UCV_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_CTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART2_CTR_REG;

};

#define UART2_1 (*(volatile struct UART2_1_tag *) 0x50020100)

struct UART3_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBR_THR_DLL:8;
      uint64_t RBR_THR_9BIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_RBR_THR_DLL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERBFI_DLH0:1;
      uint64_t ETBEI_DLH1:1;
      uint64_t ELSI_DLH2:1;
      uint64_t EDSSI_DLH3:1;
      uint64_t ELCOLR_DLH4:1;
      uint64_t DLH6_5:2;
      uint64_t PTIME_DLH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_IER_DLH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IIR_FCR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_IIR_FCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DLS:2;
      uint64_t UART_STOP:1;
      uint64_t UART_PEN:1;
      uint64_t UART_EPS:1;
      uint64_t UART_SP:1;
      uint64_t UART_BC:1;
      uint64_t UART_DLAB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_LCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t UART_RTS:1;
      uint64_t reservedSpace1:2;
      uint64_t UART_LB:1;
      uint64_t UART_AFCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_MCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DR:1;
      uint64_t UART_OE:1;
      uint64_t UART_PE:1;
      uint64_t UART_FE:1;
      uint64_t UART_BI:1;
      uint64_t UART_THRE:1;
      uint64_t UART_TEMT:1;
      uint64_t UART_RFE:1;
      uint64_t UART_ADDR_RCVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_LSR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DCTS:1;
      uint64_t reservedSpace0:3;
      uint64_t UART_CTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_MSR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISO7816_CONVENTION:1;
      uint64_t ISO7816_ERR_SIG_EN:1;
      uint64_t ISO7816_ENABLE:1;
      uint64_t ISO7816_SCRATCH_PAD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_CONFIG_REG;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR9_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR10_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR12_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR13_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR14_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRBR_STHR15_REG;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_BUSY:1;
      uint64_t UART_TFNF:1;
      uint64_t UART_TFE:1;
      uint64_t UART_RFNE:1;
      uint64_t UART_RFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_USR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_TRANSMIT_FIFO_LEVEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_TFL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_RECEIVE_FIFO_LEVEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_RFL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_UR:1;
      uint64_t UART_RFR:1;
      uint64_t UART_XFR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_REQUEST_TO_SEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRTS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_BREAK_CONTROL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SBCR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_DMA_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SDMAM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_FIFO_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SFE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_RCVR_TRIGGER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_SRT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_SHADOW_TX_EMPTY_TRIGGER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_STET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_HALT_TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_HTX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_DMASA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART3_DMASA_REG;

