iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_CHARGE_ON:1;
      uint64_t IDP_SRC_ON:1;
      uint64_t VDP_SRC_ON:1;
      uint64_t VDM_SRC_ON:1;
      uint64_t IDP_SINK_ON:1;
      uint64_t IDM_SINK_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_CHARGER_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_DCP_DET:1;
      uint64_t USB_CHG_DET:1;
      uint64_t USB_DP_VAL:1;
      uint64_t USB_DM_VAL:1;
      uint64_t USB_DP_VAL2:1;
      uint64_t USB_DM_VAL2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB_CHARGER_STAT_REG;

};

#define USB_1 (*(volatile struct USB_1_tag *) 0x50040000)

struct WAKEUP_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_DEB_VALUE:6;
      uint64_t WKUP_SFT_KEYHIT:1;
      uint64_t WKUP_ENABLE_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_CTRL_REG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_IRQ_RST:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_RESET_IRQ_REG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_SELECT_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_SELECT_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_SELECT_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_SELECT_P1_REG;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_POL_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_POL_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_POL_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_POL_P1_REG;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_STAT_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_STATUS_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_STAT_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_STATUS_P1_REG;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_CLEAR_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_CLEAR_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_CLEAR_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_CLEAR_P1_REG;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_SEL_GPIO_P0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_SEL_GPIO_P0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUP_SEL_GPIO_P1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WKUP_SEL_GPIO_P1_REG;

};

#define WAKEUP_1 (*(volatile struct WAKEUP_1_tag *) 0x50000100)

struct SYS_ID_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WLID0:16;
      uint64_t WLID1:6;
      uint64_t WLFP:5;
      uint64_t WLNR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSSER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARTID:16;
      uint64_t KRMI:4;
      uint64_t KRID:8;
      uint64_t SIMSK:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSSER1;

};

#define SYS_ID (*(volatile struct SYS_ID_tag *) 0x207f0)

struct GPT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0VAL0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0VAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0VAL1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0VAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRE:2;
      uint64_t INC_DEC:1;
      uint64_t FREEZE:1;
      uint64_t FREE_RUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0CON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0TOFA0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0TOFA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0TOFA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0TOFA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0TOFB0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0TOFB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0TOFB1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0TOFB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0TOFC0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0TOFC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0TOFC1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0TOFC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOFA:1;
      uint64_t TOFB:1;
      uint64_t TOFC:1;
      uint64_t ROLL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOFA:1;
      uint64_t TOFB:1;
      uint64_t TOFC:1;
      uint64_t ROLL:1;
      uint64_t reservedSpace0:3;
      uint64_t FREEZE:1;
      uint64_t EN_SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0ISTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOFA:1;
      uint64_t TOFB:1;
      uint64_t TOFC:1;
      uint64_t ROLL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0CLRI;

};

#define GPT (*(volatile struct GPT_tag *) 0x40000000)

struct CLKCTL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CD:1;
      uint64_t reservedSpace0:2;
      uint64_t CLKMUX:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKCON;

