iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define CLKCTL (*(volatile struct CLKCTL_tag *) 0x40002000)

struct SRAM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SBEIE:1;
      uint64_t SEIN:1;
      uint64_t reservedSpace1:12;
      uint64_t SICOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRAMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRAMERR;

};

#define SRAM (*(volatile struct SRAM_tag *) 0x4000202c)

struct PWR_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD:3;
      uint64_t reservedSpace0:3;
      uint64_t HFOSC_LPM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRMOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRKEY;

};

#define PWR_2 (*(volatile struct PWR_2_tag *) 0x40002400)

struct EXINT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ0MDE:3;
      uint64_t IRQ0EN:1;
      uint64_t IRQ1MDE:3;
      uint64_t IRQ1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EI0CFG;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ0:1;
      uint64_t IRQ1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICLR;

};

#define EXINT (*(volatile struct EXINT_tag *) 0x40002420)

struct WUT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2VAL0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2VAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2VAL1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2VAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRE:2;
      uint64_t INC_DEC:1;
      uint64_t FREEZE:1;
      uint64_t FREE_RUN:1;
      uint64_t CLKSEL:2;
      uint64_t EVENT_ENABLE:1;
      uint64_t EVENT_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2CON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2WUFA0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2WUFA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2WUFA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2WUFA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2WUFB0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2WUFB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2WUFB1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2WUFB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2WUFC0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2WUFC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2WUFC1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2WUFC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUFA:1;
      uint64_t WUFB:1;
      uint64_t WUFC:1;
      uint64_t T2ROLL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUFA:1;
      uint64_t WUFB:1;
      uint64_t WUFC:1;
      uint64_t T2ROLL:1;
      uint64_t CAPTURE:1;
      uint64_t reservedSpace0:1;
      uint64_t WAKE_UP_STATUS:1;
      uint64_t FREEZE:1;
      uint64_t EN_SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2ISTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUFA:1;
      uint64_t WUFB:1;
      uint64_t WUFC:1;
      uint64_t ROLL:1;
      uint64_t CAPTURE_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2CLRI;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2CAP0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2CAP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T2CAP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T2CAP1;

};

#define WUT (*(volatile struct WUT_tag *) 0x40002500)

struct WDT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t T3LD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T3LD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T3VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T3VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t IRQ:1;
      uint64_t PRE:2;
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t MOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T3CON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T3CLRI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T3CLRI;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:1;
      uint64_t CLRI_SYNC:1;
      uint64_t LD_SYNC:1;
      uint64_t CON_SYNC:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T3STA;

};

#define WDT (*(volatile struct WDT_tag *) 0x40002580)

struct HV_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HVCON:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HVCON;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
      uint64_t COM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HVDAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIN_EN:1;
      uint64_t DLSCP:1;
      uint64_t IOE:1;
      uint64_t VE:1;
      uint64_t LVFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HVCFG0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSCI:1;
      uint64_t LSCS:1;
      uint64_t LVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HVSTA;

