iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define HV (*(volatile struct HV_tag *) 0x40003004)

struct SPI_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQ:1;
      uint64_t TXFSTA:3;
      uint64_t TXUR:1;
      uint64_t TX:1;
      uint64_t RX:1;
      uint64_t RXOF:1;
      uint64_t RXFSTA:3;
      uint64_t RXS:1;
      uint64_t CSRERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPISTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIRX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIRX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPITX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPITX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:6;
      uint64_t reservedSpace0:1;
      uint64_t BCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t MASEN:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t WOM:1;
      uint64_t LSB:1;
      uint64_t TIM:1;
      uint64_t ZEN:1;
      uint64_t RXOF:1;
      uint64_t OEN:1;
      uint64_t LOOPBACK:1;
      uint64_t CON:1;
      uint64_t RFLUSH:1;
      uint64_t TFLUSH:1;
      uint64_t MOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPICON;

};

#define SPI_2 (*(volatile struct SPI_2_tag *) 0x40004000)

struct LIN_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINENABLE:1;
      uint64_t RXTXMODE:1;
      uint64_t CSCALC:1;
      uint64_t LEN:1;
      uint64_t SYNCTIM:1;
      uint64_t BYPASSEN:1;
      uint64_t UARTEN:1;
      uint64_t CSCLR:1;
      uint64_t SLEEPEN:1;
      uint64_t COLL:1;
      uint64_t NAD:1;
      uint64_t SYNC:1;
      uint64_t TXTIMEOUT:1;
      uint64_t WUPEN:1;
      uint64_t PIDRXINT:1;
      uint64_t TRDLY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HEADERRX:1;
      uint64_t FRAMERX:1;
      uint64_t TXCOMP:1;
      uint64_t PIDPARITY:1;
      uint64_t CSERR:1;
      uint64_t COLLDETECT:1;
      uint64_t FRAMEERR:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t MAXNEGEDGE:1;
      uint64_t MAXBRK:1;
      uint64_t UARTMODE:1;
      uint64_t reservedSpace0:2;
      uint64_t SYNC:1;
      uint64_t STOPSTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINIMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAUDRATE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINBRK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINBRK;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINSAMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINSAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINFORCE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFORCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINWUP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINWUP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUMBYTES:4;
      uint64_t COUNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRDLY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINTRDLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINSLP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINSLP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUMLBYTES:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINLCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HEADERRX:1;
      uint64_t FRAMERX:1;
      uint64_t TXCOMP:1;
      uint64_t PIDPARITY:1;
      uint64_t CSMATCH:1;
      uint64_t COLLDETECT:1;
      uint64_t FRMERR:1;
      uint64_t SLEEPSTA:1;
      uint64_t WAKESTA:1;
      uint64_t MAXNEGEDGE:1;
      uint64_t BRKTIME:1;
      uint64_t UARTTX:1;
      uint64_t UARTDATA:1;
      uint64_t COLL:1;
      uint64_t SYNCERR:1;
      uint64_t STOPSTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINSTA;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRMINCOMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINSTA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIDRX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATABYTE1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIND1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATABYTE2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIND2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATABYTE3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIND3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATABYTE4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIND4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATABYTE5:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIND5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATABYTE6:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIND6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATABYTE7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIND7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATABYTE8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIND8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINFCS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFCS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINCCS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCCS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NODEID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINNAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INITNODEID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LININAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNCID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VARID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINVID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUPID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINSUPID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SERVID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINSID;

