iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define LIN (*(volatile struct LIN_tag *) 0x40005000)

struct LIN_CAL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALMODE:1;
      uint64_t STEP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPTRIM:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALVAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPTRIM:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALVAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXSYNCL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALMAXL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXSYNCH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALMAXH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINSYNCL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALMINL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINSYNCH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALMINH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRMODE:1;
      uint64_t HPACC:1;
      uint64_t LPACC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALSTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPTRIM:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALVAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPTRIM:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALVAL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCALOCK;

};

#define LIN_CAL (*(volatile struct LIN_CAL_tag *) 0x40005c00)

struct GPIO_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CON0:2;
      uint64_t CON1:2;
      uint64_t CON2:2;
      uint64_t CON3:2;
      uint64_t CON4:2;
      uint64_t CON5:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP0CON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP0OEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP0PUL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP0OCE;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP0INR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP0OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP0SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP0CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIO0:1;
      uint64_t GPIO1:1;
      uint64_t GPIO2:1;
      uint64_t GPIO3:1;
      uint64_t GPIO4:1;
      uint64_t GPIO5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GP0TGL;

};

#define GPIO_2 (*(volatile struct GPIO_2_tag *) 0x40006000)

struct ANA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRFPD:1;
      uint64_t HRFAUTOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRFCTRL;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTREFPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRFPD;

};

#define ANA (*(volatile struct ANA_tag *) 0x40008808)

struct TRM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CYCEND:1;
      uint64_t UCNTOF:1;
      uint64_t MAXCAL:1;
      uint64_t MINCAL:1;
      uint64_t INCCAL:1;
      uint64_t DECCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRMSTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIRQEN:1;
      uint64_t UIRQEN:1;
      uint64_t MXIRQEN:1;
      uint64_t MNIRQEN:1;
      uint64_t ENABLE:1;
      uint64_t TOLSEL:1;
      uint64_t NOINCDEC:1;
      uint64_t CLREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRMCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCAL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRMMXC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINCAL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRMMNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCOTRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRMVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXLFOSC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRM32TGT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFOSCCNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRM32CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXPUCLK:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRMUCTGT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCLKCNT:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRMUCCNT;

