iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
};

#define TRM (*(volatile struct TRM_tag *) 0x40009c00)

struct FEE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDBUSY:1;
      uint64_t WRCLOSE:1;
      uint64_t CMDDONE:1;
      uint64_t WRALCOMP:1;
      uint64_t CMDFAIL:2;
      uint64_t reservedSpace0:1;
      uint64_t ECCERRCMD:2;
      uint64_t ECCERRREADPG:2;
      uint64_t ECCERRREADDT:2;
      uint64_t SIGNERR:1;
      uint64_t INIT:1;
      uint64_t ECCERRSIGN:2;
      uint64_t ECCCOUNTPROG:3;
      uint64_t reservedSpace1:2;
      uint64_t ECCCOUNTDATA:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEESTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDCOMPINTEN:1;
      uint64_t WRALCOMP:1;
      uint64_t CMDERRINTEN:1;
      uint64_t reservedSpace0:1;
      uint64_t ECCCMDINTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEECON0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEECMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t ADDRESS:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATALOW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEDATL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAHIGH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEDATH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t ADRESSLOW:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEADR1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t ADDRESSHIGH:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEADR1H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEKEY;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEPROP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEPROP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEPROD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEPROD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCDISDT:3;
      uint64_t reservedSpace0:28;
      uint64_t ECCDISDT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEECC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEESIGN:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEESIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEECON1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEE0ADRA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEABORT;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSIRQABORT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEAEN0;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERFAKEY0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERFAKEY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USERFAKEY1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERFAKEY1;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEPECC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEPECC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEEDECC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEEDECC;

};

#define FEE (*(volatile struct FEE_tag *) 0x40018000)

struct ADC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0RDY:1;
      uint64_t ADC1RDY:1;
      uint64_t ADC2RDY:1;
      uint64_t ADC0OVR:1;
      uint64_t ADC0THEX:1;
      uint64_t ADC0ATHEX:1;
      uint64_t ADCINT:1;
      uint64_t reservedSpace0:5;
      uint64_t ADC0ERR:1;
      uint64_t ADC1ERR:1;
      uint64_t reservedSpace1:1;
      uint64_t ADCxCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCSTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0RDY:1;
      uint64_t ADC1RDY:1;
      uint64_t ADC2RDY:1;
      uint64_t ADC0OVR:1;
      uint64_t ADC0THEX:1;
      uint64_t ADC0ATHEX:1;
      uint64_t ADCINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCMSKI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCMD:3;
      uint64_t ADCLP:1;
      uint64_t reservedSpace0:1;
      uint64_t ALINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCMDE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0PGA:4;
      uint64_t ADC0REF:1;
      uint64_t reservedSpace0:1;
      uint64_t ADC0CH:3;
      uint64_t ADC0CODE:1;
      uint64_t PGASCALE:2;
      uint64_t ADC0DIAG1:2;
      uint64_t ADC0DIAG2:2;
      uint64_t ADC0BUFBP:2;
      uint64_t reservedSpace1:1;
      uint64_t ADC0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0CON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ADC1REF:1;
      uint64_t reservedSpace1:1;
      uint64_t ADC1CH:3;
      uint64_t ADC1CODE:1;
      uint64_t reservedSpace2:2;
      uint64_t ADC1DIAG1:2;
      uint64_t reservedSpace3:2;
      uint64_t ADC1BUFBP:2;
      uint64_t reservedSpace4:1;
      uint64_t ADC1EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1CON;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SF:7;
      uint64_t NOTCH2:1;
      uint64_t AF:6;
      uint64_t RAVG2:1;
      uint64_t CHOP:1;
      uint64_t SINC4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCFLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCRCEN:1;
      uint64_t FASTEN:1;
      uint64_t ADC0OREN:1;
      uint64_t ADC0CMPEN:2;
      uint64_t ADC0ACCEN:1;
      uint64_t reservedSpace0:1;
      uint64_t SWEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALID:1;
      uint64_t RESULT:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0DAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALID:1;
      uint64_t RESULT:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1DAT;

