iSYSTEMLabs/winIDEAExampleWorkspaces/AnalogDevices/ADuCM331/emptyTargetInit/ADuCM331_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0OF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0OF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC1OF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1OF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC2OF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC2OF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0GN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0GN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC1GN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1GN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC2GN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC2GN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0RCL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0RCL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0RCV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0RCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0TH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0TH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0THC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0THC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0THV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0THV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0ACC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0ACC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0ATH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0ATH;

};

#define ADC_2 (*(volatile struct ADC_2_tag *) 0x40030000)

